[Timeout] ArrayDeclaration
src/framework/AWSTestingFramework.ts:117:54
   private reporter: TestReporter;
   private executionTracker: Map<string, ExecutionDetails[]> = new Map();
   private config: FrameworkConfig;
-  private performanceMetrics: PerformanceMetrics[] = [];
+  private performanceMetrics: PerformanceMetrics[] = ["Stryker was here"];
   private testStartTime: Date | null = null;
 

[Timeout] BlockStatement
src/framework/AWSTestingFramework.ts:128:73
   /**
    * Create framework instance with common configurations
    */
-  static create(config?: Partial<FrameworkConfig>): AWSTestingFramework {
-    return new AWSTestingFramework(config);
-  }
+  static create(config?: Partial<FrameworkConfig>): AWSTestingFramework {}
 
   /**

[Timeout] BlockStatement
src/framework/AWSTestingFramework.ts:135:69
   /**
    * Create framework instance for development environment
    */
-  static createForDevelopment(region?: string): AWSTestingFramework {
-    return new AWSTestingFramework({
-      aws: { region: region || 'us-east-1' },
-      defaultTimeout: 60000,
-      retryAttempts: 5,
-      retryDelay: 2000,
-      enableLogging: true,
-      logLevel: 'debug',
-    });
-  }
+  static createForDevelopment(region?: string): AWSTestingFramework {}
 
   /**

[Timeout] LogicalOperator
src/framework/AWSTestingFramework.ts:137:22
    */
   static createForDevelopment(region?: string): AWSTestingFramework {
     return new AWSTestingFramework({
-      aws: { region: region || 'us-east-1' },
+      aws: { region: region && 'us-east-1' },
       defaultTimeout: 60000,
       retryAttempts: 5,

[Timeout] ConditionalExpression
src/framework/AWSTestingFramework.ts:137:22
    */
   static createForDevelopment(region?: string): AWSTestingFramework {
     return new AWSTestingFramework({
-      aws: { region: region || 'us-east-1' },
+      aws: { region: true },
       defaultTimeout: 60000,
       retryAttempts: 5,

[Timeout] BooleanLiteral
src/framework/AWSTestingFramework.ts:141:22
       defaultTimeout: 60000,
       retryAttempts: 5,
       retryDelay: 2000,
-      enableLogging: true,
+      enableLogging: false,
       logLevel: 'debug',
     });

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:142:17
       retryAttempts: 5,
       retryDelay: 2000,
       enableLogging: true,
-      logLevel: 'debug',
+      logLevel: "",
     });
   }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:149:68
   /**
    * Create framework instance for production environment
    */
-  static createForProduction(region?: string): AWSTestingFramework {
-    return new AWSTestingFramework({
-      aws: { region: region || 'us-east-1' },
-      defaultTimeout: 120000,
-      retryAttempts: 3,
-      retryDelay: 1000,
-      enableLogging: true,
-      logLevel: 'info',
-    });
-  }
+  static createForProduction(region?: string): AWSTestingFramework {}
 
   /**

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:155:22
       defaultTimeout: 120000,
       retryAttempts: 3,
       retryDelay: 1000,
-      enableLogging: true,
+      enableLogging: false,
       logLevel: 'info',
     });

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:163:60
   /**
    * Create framework instance for CI/CD environment
    */
-  static createForCI(region?: string): AWSTestingFramework {
-    return new AWSTestingFramework({
-      aws: { region: region || 'us-east-1' },
-      defaultTimeout: 300000, // 5 minutes for CI
-      retryAttempts: 3,
-      retryDelay: 1000,
-      enableLogging: true,
-      logLevel: 'warn',
-    });
-  }
+  static createForCI(region?: string): AWSTestingFramework {}
 
   constructor(config?: FrameworkConfig) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:165:22
    */
   static createForCI(region?: string): AWSTestingFramework {
     return new AWSTestingFramework({
-      aws: { region: region || 'us-east-1' },
+      aws: { region: false },
       defaultTimeout: 300000, // 5 minutes for CI
       retryAttempts: 3,

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:180:17
       retryAttempts: 3,
       retryDelay: 1000,
       enableLogging: true,
-      logLevel: 'info',
+      logLevel: "",
       testDataDir: './test-data',
       ...config,

[Killed] LogicalOperator
src/framework/AWSTestingFramework.ts:185:23
       ...config,
     };
 
-    const awsConfig = this.config.aws || {};
+    const awsConfig = this.config.aws && {};
     const clientConfig = {
       region: awsConfig.region || process.env.AWS_REGION || 'us-east-1',
killedBy: AWSTestingFramework S3 Operations should upload a file to S3
statusReason: TypeError: Cannot read properties of undefined (reading 'region')

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:185:23
       ...config,
     };
 
-    const awsConfig = this.config.aws || {};
+    const awsConfig = false;
     const clientConfig = {
       region: awsConfig.region || process.env.AWS_REGION || 'us-east-1',

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:186:26
     };
 
     const awsConfig = this.config.aws || {};
-    const clientConfig = {
-      region: awsConfig.region || process.env.AWS_REGION || 'us-east-1',
-      maxAttempts: awsConfig.maxRetries || 3,
-      requestHandler: awsConfig.timeout
-        ? { requestTimeout: awsConfig.timeout }
-        : undefined,
-    };
+    const clientConfig = {};
 
     this.s3Client = new S3Client(clientConfig);

[Killed] ConditionalExpression
src/framework/AWSTestingFramework.ts:187:15
 
     const awsConfig = this.config.aws || {};
     const clientConfig = {
-      region: awsConfig.region || process.env.AWS_REGION || 'us-east-1',
+      region: false,
       maxAttempts: awsConfig.maxRetries || 3,
       requestHandler: awsConfig.timeout
killedBy: AWSTestingFramework S3 Operations should upload a file to S3
statusReason: Error: Region is missing

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:187:15
 
     const awsConfig = this.config.aws || {};
     const clientConfig = {
-      region: awsConfig.region || process.env.AWS_REGION || 'us-east-1',
+      region: (awsConfig.region || process.env.AWS_REGION) && 'us-east-1',
       maxAttempts: awsConfig.maxRetries || 3,
       requestHandler: awsConfig.timeout

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:188:20
     const awsConfig = this.config.aws || {};
     const clientConfig = {
       region: awsConfig.region || process.env.AWS_REGION || 'us-east-1',
-      maxAttempts: awsConfig.maxRetries || 3,
+      maxAttempts: awsConfig.maxRetries && 3,
       requestHandler: awsConfig.timeout
         ? { requestTimeout: awsConfig.timeout }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:188:20
     const awsConfig = this.config.aws || {};
     const clientConfig = {
       region: awsConfig.region || process.env.AWS_REGION || 'us-east-1',
-      maxAttempts: awsConfig.maxRetries || 3,
+      maxAttempts: true,
       requestHandler: awsConfig.timeout
         ? { requestTimeout: awsConfig.timeout }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:205:32
   /**
    * Get the current framework configuration
    */
-  getConfig(): FrameworkConfig {
-    return { ...this.config };
-  }
+  getConfig(): FrameworkConfig {}
 
   /**

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:212:57
   /**
    * Update framework configuration
    */
-  updateConfig(updates: Partial<FrameworkConfig>): void {
-    this.config = { ...this.config, ...updates };
-  }
+  updateConfig(updates: Partial<FrameworkConfig>): void {}
 
   /**

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:223:11
     level: 'debug' | 'info' | 'warn' | 'error',
     message: string,
     data?: unknown
-  ): void {
-    if (!this.config.enableLogging) return;
-
-    const levels = { debug: 0, info: 1, warn: 2, error: 3 };
-    const currentLevel = levels[this.config.logLevel || 'info'];
-    const messageLevel = levels[level];
-
-    if (messageLevel >= currentLevel) {
-      const timestamp = new Date().toISOString();
-      const prefix = `[${timestamp}] [${level.toUpperCase()}] AWS Testing Framework:`;
-
-      if (data) {
-        console[level](`${prefix} ${message}`, data);
-      } else {
-        console[level](`${prefix} ${message}`);
-      }
-    }
-  }
+  ): void {}
 
   configureReporter(_outputDir?: string) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:224:9
     message: string,
     data?: unknown
   ): void {
-    if (!this.config.enableLogging) return;
+    if (false) return;
 
     const levels = { debug: 0, info: 1, warn: 2, error: 3 };

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:224:9
     message: string,
     data?: unknown
   ): void {
-    if (!this.config.enableLogging) return;
+    if (this.config.enableLogging) return;
 
     const levels = { debug: 0, info: 1, warn: 2, error: 3 };

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:227:33
     if (!this.config.enableLogging) return;
 
     const levels = { debug: 0, info: 1, warn: 2, error: 3 };
-    const currentLevel = levels[this.config.logLevel || 'info'];
+    const currentLevel = levels[true];
     const messageLevel = levels[level];
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:227:33
     if (!this.config.enableLogging) return;
 
     const levels = { debug: 0, info: 1, warn: 2, error: 3 };
-    const currentLevel = levels[this.config.logLevel || 'info'];
+    const currentLevel = levels[false];
     const messageLevel = levels[level];
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:230:9
     const currentLevel = levels[this.config.logLevel || 'info'];
     const messageLevel = levels[level];
 
-    if (messageLevel >= currentLevel) {
+    if (false) {
       const timestamp = new Date().toISOString();
       const prefix = `[${timestamp}] [${level.toUpperCase()}] AWS Testing Framework:`;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:230:9
     const currentLevel = levels[this.config.logLevel || 'info'];
     const messageLevel = levels[level];
 
-    if (messageLevel >= currentLevel) {
+    if (messageLevel < currentLevel) {
       const timestamp = new Date().toISOString();
       const prefix = `[${timestamp}] [${level.toUpperCase()}] AWS Testing Framework:`;

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:232:41
 
     if (messageLevel >= currentLevel) {
       const timestamp = new Date().toISOString();
-      const prefix = `[${timestamp}] [${level.toUpperCase()}] AWS Testing Framework:`;
+      const prefix = `[${timestamp}] [${level.toLowerCase()}] AWS Testing Framework:`;
 
       if (data) {

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:235:24
       const prefix = `[${timestamp}] [${level.toUpperCase()}] AWS Testing Framework:`;
 
       if (data) {
-        console[level](`${prefix} ${message}`, data);
+        console[level](``, data);
       } else {
         console[level](`${prefix} ${message}`);

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:236:14
 
       if (data) {
         console[level](`${prefix} ${message}`, data);
-      } else {
-        console[level](`${prefix} ${message}`);
-      }
+      } else {}
     }
   }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:242:42
     }
   }
 
-  configureReporter(_outputDir?: string) {
-    this.reporter = new TestReporter();
-    return this;
-  }
+  configureReporter(_outputDir?: string) {}
 
   getReporter() {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:247:17
     return this;
   }
 
-  getReporter() {
-    return this.reporter;
-  }
+  getReporter() {}
 
   //#region S3

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:253:55
 
   //#region S3
 
-  async findBucket(bucketName: string): Promise<void> {
-    const command = new ListBucketsCommand({});
-    const response = await this.s3Client.send(command);
-    const bucket = response.Buckets?.find(
-      (bucket) => bucket.Name === bucketName
-    );
-    if (!bucket) {
-      throw new Error(`Bucket ${bucketName} not found`);
-    }
-    this.log('info', `Found S3 bucket: ${bucketName}`);
-  }
+  async findBucket(bucketName: string): Promise<void> {}
 
   async uploadFile(

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:256:20
   async findBucket(bucketName: string): Promise<void> {
     const command = new ListBucketsCommand({});
     const response = await this.s3Client.send(command);
-    const bucket = response.Buckets?.find(
+    const bucket = response.Buckets.find(
       (bucket) => bucket.Name === bucketName
     );

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:257:19
     const command = new ListBucketsCommand({});
     const response = await this.s3Client.send(command);
     const bucket = response.Buckets?.find(
-      (bucket) => bucket.Name === bucketName
+      (bucket) => true
     );
     if (!bucket) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:257:19
     const command = new ListBucketsCommand({});
     const response = await this.s3Client.send(command);
     const bucket = response.Buckets?.find(
-      (bucket) => bucket.Name === bucketName
+      (bucket) => false
     );
     if (!bucket) {

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:259:9
     const bucket = response.Buckets?.find(
       (bucket) => bucket.Name === bucketName
     );
-    if (!bucket) {
+    if (bucket) {
       throw new Error(`Bucket ${bucketName} not found`);
     }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:259:9
     const bucket = response.Buckets?.find(
       (bucket) => bucket.Name === bucketName
     );
-    if (!bucket) {
+    if (false) {
       throw new Error(`Bucket ${bucketName} not found`);
     }

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:260:23
       (bucket) => bucket.Name === bucketName
     );
     if (!bucket) {
-      throw new Error(`Bucket ${bucketName} not found`);
+      throw new Error(``);
     }
     this.log('info', `Found S3 bucket: ${bucketName}`);

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:269:20
     bucketName: string,
     fileName: string,
     content: string
-  ): Promise<void> {
-    await this.s3Client.send(
-      new PutObjectCommand({
-        Bucket: bucketName,
-        Key: fileName,
-        Body: content,
-      })
-    );
-    this.log('info', `Uploaded file ${fileName} to bucket ${bucketName}`);
-  }
+  ): Promise<void> {}
 
   async checkFileExists(
killedBy: AWSTestingFramework S3 Operations should upload a file to S3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:277:14
         Body: content,
       })
     );
-    this.log('info', `Uploaded file ${fileName} to bucket ${bucketName}`);
+    this.log("", `Uploaded file ${fileName} to bucket ${bucketName}`);
   }
 

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:283:23
   async checkFileExists(
     bucketName: string,
     fileName: string
-  ): Promise<boolean> {
-    try {
-      await this.s3Client.send(
-        new HeadObjectCommand({
-          Bucket: bucketName,
-          Key: fileName,
-        })
-      );
-      return true;
-    } catch (error) {
-      this.log(
-        'debug',
-        `File ${fileName} not found in bucket ${bucketName}:`,
-        error
-      );
-      return false;
-    }
-  }
+  ): Promise<boolean> {}
 
   //#endregion
killedBy: AWSTestingFramework S3 Operations should check if a file exists in S3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:284:9
     bucketName: string,
     fileName: string
   ): Promise<boolean> {
-    try {
-      await this.s3Client.send(
-        new HeadObjectCommand({
-          Bucket: bucketName,
-          Key: fileName,
-        })
-      );
-      return true;
-    } catch (error) {
+    try {} catch (error) {
       this.log(
         'debug',
killedBy: AWSTestingFramework S3 Operations should check if a file exists in S3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ObjectLiteral
src/framework/AWSTestingFramework.ts:286:31
   ): Promise<boolean> {
     try {
       await this.s3Client.send(
-        new HeadObjectCommand({
-          Bucket: bucketName,
-          Key: fileName,
-        })
+        new HeadObjectCommand({})
       );
       return true;
killedBy: AWSTestingFramework S3 Operations should check if a file exists in S3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "Bucket": "test-bucket",
-   "Key": "test.txt",

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:292:21
         })
       );
       return true;
-    } catch (error) {
-      this.log(
-        'debug',
-        `File ${fileName} not found in bucket ${bucketName}:`,
-        error
-      );
-      return false;
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:306:55
 
   //#region SQS
 
-  async findQueue(queueName: string): Promise<string> {
-    const command = new ListQueuesCommand({});
-    const response = await this.sqsClient.send(command);
-    const queue = response.QueueUrls?.find((queue) =>
-      queue.includes(queueName)
-    );
-    return queue ?? '';
-  }
+  async findQueue(queueName: string): Promise<string> {}
 
   async sendMessage(queueUrl: string, message: string): Promise<void> {

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:309:44
   async findQueue(queueName: string): Promise<string> {
     const command = new ListQueuesCommand({});
     const response = await this.sqsClient.send(command);
-    const queue = response.QueueUrls?.find((queue) =>
-      queue.includes(queueName)
+    const queue = response.QueueUrls?.find(() => undefined
     );
     return queue ?? '';

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:309:19
   async findQueue(queueName: string): Promise<string> {
     const command = new ListQueuesCommand({});
     const response = await this.sqsClient.send(command);
-    const queue = response.QueueUrls?.find((queue) =>
+    const queue = response.QueueUrls.find((queue) =>
       queue.includes(queueName)
     );

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:312:12
     const queue = response.QueueUrls?.find((queue) =>
       queue.includes(queueName)
     );
-    return queue ?? '';
+    return queue && '';
   }
 

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:312:21
     const queue = response.QueueUrls?.find((queue) =>
       queue.includes(queueName)
     );
-    return queue ?? '';
+    return queue ?? "Stryker was here!";
   }
 

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:315:71
     return queue ?? '';
   }
 
-  async sendMessage(queueUrl: string, message: string): Promise<void> {
-    await this.sqsClient.send(
-      new SendMessageCommand({
-        QueueUrl: queueUrl,
-        MessageBody: message,
-      })
-    );
-  }
+  async sendMessage(queueUrl: string, message: string): Promise<void> {}
 
   async receiveMessage(queueUrl: string): Promise<{
killedBy: AWSTestingFramework SQS Operations should send a message to a queue
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:328:13
     Body?: string;
     MessageId?: string;
     ReceiptHandle?: string;
-  } | null> {
-    const response = await this.sqsClient.send(
-      new ReceiveMessageCommand({
-        QueueUrl: queueUrl,
-        MaxNumberOfMessages: 1,
-        WaitTimeSeconds: 1,
-      })
-    );
-    return response.Messages?.[0] ?? null;
-  }
+  } | null> {}
 
   async getUnreadMessageCount(queueUrl: string): Promise<number> {
killedBy: AWSTestingFramework SQS Operations should receive messages from a queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test message"
Received: undefined

[Killed] LogicalOperator
src/framework/AWSTestingFramework.ts:336:12
         WaitTimeSeconds: 1,
       })
     );
-    return response.Messages?.[0] ?? null;
+    return response.Messages?.[0] && null;
   }
 
killedBy: AWSTestingFramework SQS Operations should receive messages from a queue
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:336:12
         WaitTimeSeconds: 1,
       })
     );
-    return response.Messages?.[0] ?? null;
+    return response.Messages[0] ?? null;
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:339:66
     return response.Messages?.[0] ?? null;
   }
 
-  async getUnreadMessageCount(queueUrl: string): Promise<number> {
-    const response = await this.sqsClient.send(
-      new GetQueueAttributesCommand({
-        QueueUrl: queueUrl,
-        AttributeNames: ['ApproximateNumberOfMessages'],
-      })
-    );
-    return Number.parseInt(
-      response.Attributes?.ApproximateNumberOfMessages || '0',
-      10
-    );
-  }
+  async getUnreadMessageCount(queueUrl: string): Promise<number> {}
 
   //#endregion

[Survived] ArrayDeclaration
src/framework/AWSTestingFramework.ts:343:25
     const response = await this.sqsClient.send(
       new GetQueueAttributesCommand({
         QueueUrl: queueUrl,
-        AttributeNames: ['ApproximateNumberOfMessages'],
+        AttributeNames: [],
       })
     );

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:343:26
     const response = await this.sqsClient.send(
       new GetQueueAttributesCommand({
         QueueUrl: queueUrl,
-        AttributeNames: ['ApproximateNumberOfMessages'],
+        AttributeNames: [""],
       })
     );

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:347:7
       })
     );
     return Number.parseInt(
-      response.Attributes?.ApproximateNumberOfMessages || '0',
+      response.Attributes.ApproximateNumberOfMessages || '0',
       10
     );

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:347:7
       })
     );
     return Number.parseInt(
-      response.Attributes?.ApproximateNumberOfMessages || '0',
+      response.Attributes?.ApproximateNumberOfMessages && '0',
       10
     );

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:356:59
 
   //#region Lambda
 
-  async findFunction(functionName: string): Promise<void> {
-    const command = new ListFunctionsCommand({});
-    const response = await this.lambdaClient.send(command);
-    const functionDetails = response.Functions?.find(
-      (f) => f.FunctionName === functionName
-    );
-    if (!functionDetails) {
-      throw new Error(`Lambda function ${functionName} not found`);
-    }
-  }
+  async findFunction(functionName: string): Promise<void> {}
 
   async invokeFunction(

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:359:29
   async findFunction(functionName: string): Promise<void> {
     const command = new ListFunctionsCommand({});
     const response = await this.lambdaClient.send(command);
-    const functionDetails = response.Functions?.find(
+    const functionDetails = response.Functions.find(
       (f) => f.FunctionName === functionName
     );

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:360:14
     const command = new ListFunctionsCommand({});
     const response = await this.lambdaClient.send(command);
     const functionDetails = response.Functions?.find(
-      (f) => f.FunctionName === functionName
+      (f) => f.FunctionName !== functionName
     );
     if (!functionDetails) {

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:360:7
     const command = new ListFunctionsCommand({});
     const response = await this.lambdaClient.send(command);
     const functionDetails = response.Functions?.find(
-      (f) => f.FunctionName === functionName
+      () => undefined
     );
     if (!functionDetails) {

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:362:9
     const functionDetails = response.Functions?.find(
       (f) => f.FunctionName === functionName
     );
-    if (!functionDetails) {
+    if (functionDetails) {
       throw new Error(`Lambda function ${functionName} not found`);
     }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:362:9
     const functionDetails = response.Functions?.find(
       (f) => f.FunctionName === functionName
     );
-    if (!functionDetails) {
+    if (true) {
       throw new Error(`Lambda function ${functionName} not found`);
     }

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:370:43
   async invokeFunction(
     functionName: string,
     payload: Record<string, unknown>
-  ): Promise<{ Payload?: string } | null> {
-    const response = await this.lambdaClient.send(
-      new InvokeCommand({
-        FunctionName: functionName,
-        Payload: Buffer.from(JSON.stringify(payload)),
-      })
-    );
-    return {
-      Payload: response.Payload
-        ? Buffer.from(response.Payload).toString()
-        : undefined,
-    };
-  }
+  ): Promise<{ Payload?: string } | null> {}
 
   /**
killedBy: AWSTestingFramework Lambda Operations should invoke a function
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"test\":\"response\"}"
Received: undefined

[Killed] ObjectLiteral
src/framework/AWSTestingFramework.ts:372:25
     payload: Record<string, unknown>
   ): Promise<{ Payload?: string } | null> {
     const response = await this.lambdaClient.send(
-      new InvokeCommand({
-        FunctionName: functionName,
-        Payload: Buffer.from(JSON.stringify(payload)),
-      })
+      new InvokeCommand({})
     );
     return {
killedBy: AWSTestingFramework Lambda Operations should invoke a function
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-function"
Received: undefined

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:387:70
   /**
    * Check if Lambda function has been executed recently
    */
-  async checkLambdaExecution(functionName: string): Promise<boolean> {
-    try {
-      // Check if the function exists and is accessible
-      await this.findFunction(functionName);
-
-      // In a real implementation, you would check CloudWatch logs or Lambda metrics
-      // For now, we'll check if the function is accessible and assume it can be executed
-      // This is a limitation that should be addressed with proper CloudWatch integration
-
-      // TODO: Implement proper Lambda execution checking using CloudWatch logs
-      // const logs = await this.getLambdaLogs(functionName, startTime, endTime);
-      // return logs.length > 0;
-
-      return true;
-    } catch (error) {
-      console.warn(
-        `Error checking Lambda execution for ${functionName}:`,
-        error
-      );
-      return false;
-    }
-  }
+  async checkLambdaExecution(functionName: string): Promise<boolean> {}
 
   //#endregion

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:388:9
    * Check if Lambda function has been executed recently
    */
   async checkLambdaExecution(functionName: string): Promise<boolean> {
-    try {
-      // Check if the function exists and is accessible
-      await this.findFunction(functionName);
-
-      // In a real implementation, you would check CloudWatch logs or Lambda metrics
-      // For now, we'll check if the function is accessible and assume it can be executed
-      // This is a limitation that should be addressed with proper CloudWatch integration
-
-      // TODO: Implement proper Lambda execution checking using CloudWatch logs
-      // const logs = await this.getLambdaLogs(functionName, startTime, endTime);
-      // return logs.length > 0;
-
-      return true;
-    } catch (error) {
+    try {} catch (error) {
       console.warn(
         `Error checking Lambda execution for ${functionName}:`,

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:401:21
       // return logs.length > 0;
 
       return true;
-    } catch (error) {
-      console.warn(
-        `Error checking Lambda execution for ${functionName}:`,
-        error
-      );
-      return false;
-    }
+    } catch (error) {}
   }
 

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:403:9
       return true;
     } catch (error) {
       console.warn(
-        `Error checking Lambda execution for ${functionName}:`,
+        ``,
         error
       );

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:414:69
 
   //#region Step Functions
 
-  async findStateMachine(stateMachineName: string): Promise<string> {
-    const command = new ListStateMachinesCommand({});
-    const response = await this.sfnClient.send(command);
-    const stateMachine = response.stateMachines?.find(
-      (sm) => sm.name === stateMachineName
-    );
-    return stateMachine?.stateMachineArn || '';
-  }
+  async findStateMachine(stateMachineName: string): Promise<string> {}
 
   async startExecution(
