[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:417:26
   async findStateMachine(stateMachineName: string): Promise<string> {
     const command = new ListStateMachinesCommand({});
     const response = await this.sfnClient.send(command);
-    const stateMachine = response.stateMachines?.find(
+    const stateMachine = response.stateMachines.find(
       (sm) => sm.name === stateMachineName
     );

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:418:15
     const command = new ListStateMachinesCommand({});
     const response = await this.sfnClient.send(command);
     const stateMachine = response.stateMachines?.find(
-      (sm) => sm.name === stateMachineName
+      (sm) => false
     );
     return stateMachine?.stateMachineArn || '';

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:418:7
     const command = new ListStateMachinesCommand({});
     const response = await this.sfnClient.send(command);
     const stateMachine = response.stateMachines?.find(
-      (sm) => sm.name === stateMachineName
+      () => undefined
     );
     return stateMachine?.stateMachineArn || '';

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:420:12
     const stateMachine = response.stateMachines?.find(
       (sm) => sm.name === stateMachineName
     );
-    return stateMachine?.stateMachineArn || '';
+    return stateMachine.stateMachineArn || '';
   }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:420:12
     const stateMachine = response.stateMachines?.find(
       (sm) => sm.name === stateMachineName
     );
-    return stateMachine?.stateMachineArn || '';
+    return true;
   }
 

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:426:22
   async startExecution(
     stateMachineArn: string,
     input: Record<string, unknown>
-  ): Promise<string> {
-    const response = await this.sfnClient.send(
-      new StartExecutionCommand({
-        stateMachineArn,
-        input: JSON.stringify(input),
-      })
-    );
-    if (!response.executionArn) {
-      throw new Error('Failed to start execution: No execution ARN returned');
-    }
-    return response.executionArn;
-  }
+  ): Promise<string> {}
 
   async listExecutions(
killedBy: AWSTestingFramework Step Functions Operations should start an execution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "arn:aws:states:us-east-1:123456789012:execution:test-state-machine:test-execution"
Received: undefined

[Killed] ConditionalExpression
src/framework/AWSTestingFramework.ts:433:9
         input: JSON.stringify(input),
       })
     );
-    if (!response.executionArn) {
+    if (true) {
       throw new Error('Failed to start execution: No execution ARN returned');
     }
killedBy: AWSTestingFramework Step Functions Operations should start an execution
statusReason: Error: Failed to start execution: No execution ARN returned

[Killed] BooleanLiteral
src/framework/AWSTestingFramework.ts:433:9
         input: JSON.stringify(input),
       })
     );
-    if (!response.executionArn) {
+    if (response.executionArn) {
       throw new Error('Failed to start execution: No execution ARN returned');
     }
killedBy: AWSTestingFramework Step Functions Operations should start an execution
statusReason: Error: Failed to start execution: No execution ARN returned

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:441:47
 
   async listExecutions(
     stateMachineName: string
-  ): Promise<Array<{ executionArn: string }>> {
-    const stateMachineArn = await this.findStateMachine(stateMachineName);
-    const response = await this.sfnClient.send(
-      new ListExecutionsCommand({
-        stateMachineArn,
-        maxResults: 1,
-      })
-    );
-    return (
-      response.executions?.map((execution) => ({
-        executionArn: execution.executionArn || '',
-      })) || []
-    );
-  }
+  ): Promise<Array<{ executionArn: string }>> {}
 
   async getExecutionStatus(executionArn: string): Promise<string> {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:450:7
       })
     );
     return (
-      response.executions?.map((execution) => ({
-        executionArn: execution.executionArn || '',
-      })) || []
+      true
     );
   }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:450:7
       })
     );
     return (
-      response.executions?.map((execution) => ({
-        executionArn: execution.executionArn || '',
-      })) || []
+      false
     );
   }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:451:23
     );
     return (
       response.executions?.map((execution) => ({
-        executionArn: execution.executionArn || '',
+        executionArn: false,
       })) || []
     );

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:451:23
     );
     return (
       response.executions?.map((execution) => ({
-        executionArn: execution.executionArn || '',
+        executionArn: true,
       })) || []
     );

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:456:67
     );
   }
 
-  async getExecutionStatus(executionArn: string): Promise<string> {
-    const response = await this.sfnClient.send(
-      new DescribeExecutionCommand({
-        executionArn,
-      })
-    );
-    return response.status || '';
-  }
+  async getExecutionStatus(executionArn: string): Promise<string> {}
 
   /**
killedBy: AWSTestingFramework Step Functions Operations should get execution status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SUCCEEDED"
Received: undefined

[Killed] ConditionalExpression
src/framework/AWSTestingFramework.ts:462:12
         executionArn,
       })
     );
-    return response.status || '';
+    return true;
   }
 
killedBy: AWSTestingFramework Step Functions Operations should get execution status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SUCCEEDED"
Received: true

[Killed] LogicalOperator
src/framework/AWSTestingFramework.ts:462:12
         executionArn,
       })
     );
-    return response.status || '';
+    return response.status && '';
   }
 
killedBy: AWSTestingFramework Step Functions Operations should get execution status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SUCCEEDED"
Received: ""

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:469:9
    * Check if Step Function has been executed recently
    */
   async checkStateMachineExecution(stateMachineName: string): Promise<boolean> {
-    try {
-      // Check for recent executions
-      const executions = await this.listExecutions(stateMachineName);
-      if (executions.length === 0) {
-        return false;
-      }
-
-      // Check if any execution started in the last 5 minutes
-      // In a real implementation, you would check the actual execution timestamps
-      // For now, we'll assume recent executions exist if the state machine is accessible
-
-      // TODO: Implement proper Step Function execution checking with timestamps
-      // const recentExecutions = executions.filter((execution) => {
-      //   const executionTime = new Date(execution.startDate);
-      //   const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-      //   return executionTime.getTime() > fiveMinutesAgo;
-      // });
-
-      return executions.length > 0;
-    } catch (error) {
+    try {} catch (error) {
       console.warn(
         `Error checking Step Function execution for ${stateMachineName}:`,

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:472:11
     try {
       // Check for recent executions
       const executions = await this.listExecutions(stateMachineName);
-      if (executions.length === 0) {
+      if (executions.length !== 0) {
         return false;
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:472:11
     try {
       // Check for recent executions
       const executions = await this.listExecutions(stateMachineName);
-      if (executions.length === 0) {
+      if (true) {
         return false;
       }

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:473:16
       // Check for recent executions
       const executions = await this.listExecutions(stateMachineName);
       if (executions.length === 0) {
-        return false;
+        return true;
       }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:487:14
       //   return executionTime.getTime() > fiveMinutesAgo;
       // });
 
-      return executions.length > 0;
+      return false;
     } catch (error) {
       console.warn(

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:487:14
       //   return executionTime.getTime() > fiveMinutesAgo;
       // });
 
-      return executions.length > 0;
+      return executions.length >= 0;
     } catch (error) {
       console.warn(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:488:21
       // });
 
       return executions.length > 0;
-    } catch (error) {
-      console.warn(
-        `Error checking Step Function execution for ${stateMachineName}:`,
-        error
-      );
-      return false;
-    }
+    } catch (error) {}
   }
 

[Survived] ArrayDeclaration
src/framework/AWSTestingFramework.ts:509:44
       })
     );
 
-    const executions: ExecutionDetails[] = [];
+    const executions: ExecutionDetails[] = ["Stryker was here"];
 
     // Get full details for each execution including input/output

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:512:29
     const executions: ExecutionDetails[] = [];
 
     // Get full details for each execution including input/output
-    for (const execution of response.executions || []) {
+    for (const execution of false) {
       if (execution.executionArn) {
         try {

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:512:29
     const executions: ExecutionDetails[] = [];
 
     // Get full details for each execution including input/output
-    for (const execution of response.executions || []) {
+    for (const execution of response.executions && []) {
       if (execution.executionArn) {
         try {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:513:11
 
     // Get full details for each execution including input/output
     for (const execution of response.executions || []) {
-      if (execution.executionArn) {
+      if (true) {
         try {
           const executionDetails = await this.sfnClient.send(

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:513:11
 
     // Get full details for each execution including input/output
     for (const execution of response.executions || []) {
-      if (execution.executionArn) {
+      if (false) {
         try {
           const executionDetails = await this.sfnClient.send(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:514:13
     // Get full details for each execution including input/output
     for (const execution of response.executions || []) {
       if (execution.executionArn) {
-        try {
-          const executionDetails = await this.sfnClient.send(
-            new DescribeExecutionCommand({
-              executionArn: execution.executionArn,
-            })
-          );
-
-          executions.push({
-            executionArn: execution.executionArn,
-            stateMachineArn: execution.stateMachineArn || '',
-            status: execution.status || '',
-            startDate: execution.startDate || new Date(),
-            stopDate: execution.stopDate,
-            input: executionDetails.input,
-            output: executionDetails.output,
-          });
-        } catch (_error) {
+        try {} catch (_error) {
           // Fallback to basic details
           executions.push({

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:516:42
       if (execution.executionArn) {
         try {
           const executionDetails = await this.sfnClient.send(
-            new DescribeExecutionCommand({
-              executionArn: execution.executionArn,
-            })
+            new DescribeExecutionCommand({})
           );
 

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:521:27
             })
           );
 
-          executions.push({
-            executionArn: execution.executionArn,
-            stateMachineArn: execution.stateMachineArn || '',
-            status: execution.status || '',
-            startDate: execution.startDate || new Date(),
-            stopDate: execution.stopDate,
-            input: executionDetails.input,
-            output: executionDetails.output,
-          });
+          executions.push({});
         } catch (_error) {
           // Fallback to basic details

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:523:30
 
           executions.push({
             executionArn: execution.executionArn,
-            stateMachineArn: execution.stateMachineArn || '',
+            stateMachineArn: true,
             status: execution.status || '',
             startDate: execution.startDate || new Date(),

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:523:30
 
           executions.push({
             executionArn: execution.executionArn,
-            stateMachineArn: execution.stateMachineArn || '',
+            stateMachineArn: execution.stateMachineArn && '',
             status: execution.status || '',
             startDate: execution.startDate || new Date(),

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:524:21
           executions.push({
             executionArn: execution.executionArn,
             stateMachineArn: execution.stateMachineArn || '',
-            status: execution.status || '',
+            status: true,
             startDate: execution.startDate || new Date(),
             stopDate: execution.stopDate,

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:524:21
           executions.push({
             executionArn: execution.executionArn,
             stateMachineArn: execution.stateMachineArn || '',
-            status: execution.status || '',
+            status: execution.status && '',
             startDate: execution.startDate || new Date(),
             stopDate: execution.stopDate,

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:525:24
             executionArn: execution.executionArn,
             stateMachineArn: execution.stateMachineArn || '',
             status: execution.status || '',
-            startDate: execution.startDate || new Date(),
+            startDate: false,
             stopDate: execution.stopDate,
             input: executionDetails.input,

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:525:24
             executionArn: execution.executionArn,
             stateMachineArn: execution.stateMachineArn || '',
             status: execution.status || '',
-            startDate: execution.startDate || new Date(),
+            startDate: true,
             stopDate: execution.stopDate,
             input: executionDetails.input,

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:530:26
             input: executionDetails.input,
             output: executionDetails.output,
           });
-        } catch (_error) {
-          // Fallback to basic details
-          executions.push({
-            executionArn: execution.executionArn,
-            stateMachineArn: execution.stateMachineArn || '',
-            status: execution.status || '',
-            startDate: execution.startDate || new Date(),
-            stopDate: execution.stopDate,
-          });
-        }
+        } catch (_error) {}
       }
     }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:534:30
           // Fallback to basic details
           executions.push({
             executionArn: execution.executionArn,
-            stateMachineArn: execution.stateMachineArn || '',
+            stateMachineArn: false,
             status: execution.status || '',
             startDate: execution.startDate || new Date(),

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:535:21
           executions.push({
             executionArn: execution.executionArn,
             stateMachineArn: execution.stateMachineArn || '',
-            status: execution.status || '',
+            status: false,
             startDate: execution.startDate || new Date(),
             stopDate: execution.stopDate,

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:552:23
   async verifyStateMachineTriggered(
     expectedStateMachineName: string,
     timeoutMs = 30000
-  ): Promise<boolean> {
-    const startTime = Date.now();
-
-    while (Date.now() - startTime < timeoutMs) {
-      await this.trackStateMachineExecutions(expectedStateMachineName);
-      const executions =
-        this.executionTracker.get(expectedStateMachineName) || [];
-
-      // Check if there are any recent executions (within the last 5 minutes)
-      const recentExecutions = executions.filter((execution) => {
-        const executionTime = new Date(execution.startDate).getTime();
-        const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-        return executionTime > fiveMinutesAgo;
-      });
-
-      if (recentExecutions.length > 0) {
-        return true;
-      }
-
-      // Wait before checking again
-      await new Promise((resolve) => setTimeout(resolve, 1000));
-    }
-
-    return false;
-  }
+  ): Promise<boolean> {}
 
   /**

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:555:12
   ): Promise<boolean> {
     const startTime = Date.now();
 
-    while (Date.now() - startTime < timeoutMs) {
+    while (Date.now() - startTime <= timeoutMs) {
       await this.trackStateMachineExecutions(expectedStateMachineName);
       const executions =

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:555:12
   ): Promise<boolean> {
     const startTime = Date.now();
 
-    while (Date.now() - startTime < timeoutMs) {
+    while (false) {
       await this.trackStateMachineExecutions(expectedStateMachineName);
       const executions =

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:558:9
     while (Date.now() - startTime < timeoutMs) {
       await this.trackStateMachineExecutions(expectedStateMachineName);
       const executions =
-        this.executionTracker.get(expectedStateMachineName) || [];
+        false;
 
       // Check if there are any recent executions (within the last 5 minutes)

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:558:9
     while (Date.now() - startTime < timeoutMs) {
       await this.trackStateMachineExecutions(expectedStateMachineName);
       const executions =
-        this.executionTracker.get(expectedStateMachineName) || [];
+        true;
 
       // Check if there are any recent executions (within the last 5 minutes)

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:561:65
         this.executionTracker.get(expectedStateMachineName) || [];
 
       // Check if there are any recent executions (within the last 5 minutes)
-      const recentExecutions = executions.filter((execution) => {
-        const executionTime = new Date(execution.startDate).getTime();
-        const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-        return executionTime > fiveMinutesAgo;
-      });
+      const recentExecutions = executions.filter((execution) => {});
 
       if (recentExecutions.length > 0) {

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:561:32
         this.executionTracker.get(expectedStateMachineName) || [];
 
       // Check if there are any recent executions (within the last 5 minutes)
-      const recentExecutions = executions.filter((execution) => {
-        const executionTime = new Date(execution.startDate).getTime();
-        const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-        return executionTime > fiveMinutesAgo;
-      });
+      const recentExecutions = executions;
 
       if (recentExecutions.length > 0) {

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:563:45
       // Check if there are any recent executions (within the last 5 minutes)
       const recentExecutions = executions.filter((execution) => {
         const executionTime = new Date(execution.startDate).getTime();
-        const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
+        const fiveMinutesAgo = Date.now() - 5 * 60 / 1000;
         return executionTime > fiveMinutesAgo;
       });

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:563:32
       // Check if there are any recent executions (within the last 5 minutes)
       const recentExecutions = executions.filter((execution) => {
         const executionTime = new Date(execution.startDate).getTime();
-        const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
+        const fiveMinutesAgo = Date.now() + 5 * 60 * 1000;
         return executionTime > fiveMinutesAgo;
       });

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:564:16
       const recentExecutions = executions.filter((execution) => {
         const executionTime = new Date(execution.startDate).getTime();
         const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-        return executionTime > fiveMinutesAgo;
+        return executionTime >= fiveMinutesAgo;
       });
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:564:16
       const recentExecutions = executions.filter((execution) => {
         const executionTime = new Date(execution.startDate).getTime();
         const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-        return executionTime > fiveMinutesAgo;
+        return true;
       });
 

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:567:11
         return executionTime > fiveMinutesAgo;
       });
 
-      if (recentExecutions.length > 0) {
+      if (recentExecutions.length <= 0) {
         return true;
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:567:11
         return executionTime > fiveMinutesAgo;
       });
 
-      if (recentExecutions.length > 0) {
+      if (true) {
         return true;
       }

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:568:16
       });
 
       if (recentExecutions.length > 0) {
-        return true;
+        return false;
       }
 

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:572:25
       }
 
       // Wait before checking again
-      await new Promise((resolve) => setTimeout(resolve, 1000));
+      await new Promise(() => undefined);
     }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:583:34
    */
   async getExecutionDetails(
     stateMachineName: string
-  ): Promise<ExecutionDetails[]> {
-    await this.trackStateMachineExecutions(stateMachineName);
-    return this.executionTracker.get(stateMachineName) || [];
-  }
+  ): Promise<ExecutionDetails[]> {}
 
   /**

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:585:12
     stateMachineName: string
   ): Promise<ExecutionDetails[]> {
     await this.trackStateMachineExecutions(stateMachineName);
-    return this.executionTracker.get(stateMachineName) || [];
+    return true;
   }
 

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:585:12
     stateMachineName: string
   ): Promise<ExecutionDetails[]> {
     await this.trackStateMachineExecutions(stateMachineName);
-    return this.executionTracker.get(stateMachineName) || [];
+    return this.executionTracker.get(stateMachineName) && [];
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:594:23
   async verifyLambdaTriggeredStateMachine(
     lambdaFunctionName: string,
     expectedStateMachineName: string
-  ): Promise<boolean> {
-    // First, verify the Lambda function executed
-    const lambdaExecuted = await this.checkLambdaExecution(lambdaFunctionName);
-    if (!lambdaExecuted) {
-      return false;
-    }
-
-    // Then, verify the expected state machine was triggered
-    return await this.verifyStateMachineTriggered(expectedStateMachineName);
-  }
+  ): Promise<boolean> {}
 
   /**

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:597:9
   ): Promise<boolean> {
     // First, verify the Lambda function executed
     const lambdaExecuted = await this.checkLambdaExecution(lambdaFunctionName);
-    if (!lambdaExecuted) {
+    if (true) {
       return false;
     }

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:597:9
   ): Promise<boolean> {
     // First, verify the Lambda function executed
     const lambdaExecuted = await this.checkLambdaExecution(lambdaFunctionName);
-    if (!lambdaExecuted) {
+    if (lambdaExecuted) {
       return false;
     }

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:598:14
     // First, verify the Lambda function executed
     const lambdaExecuted = await this.checkLambdaExecution(lambdaFunctionName);
     if (!lambdaExecuted) {
-      return false;
+      return true;
     }
 

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:625:30
       );
 
       return (
-        response.events?.map((event) => ({
-          timestamp: event.timestamp || new Date(),
-          type: event.type || '',
-          stateName:
-            typeof event.stateEnteredEventDetails?.name === 'string'
-              ? event.stateEnteredEventDetails?.name
-              : undefined,
-          stateEnteredEventDetails: event.stateEnteredEventDetails as
-            | Record<string, unknown>
-            | undefined,
-          stateExitedEventDetails: event.stateExitedEventDetails as
-            | Record<string, unknown>
-            | undefined,
-          taskSucceededEventDetails: event.taskSucceededEventDetails as
-            | Record<string, unknown>
-            | undefined,
-          taskFailedEventDetails: event.taskFailedEventDetails as
-            | Record<string, unknown>
-            | undefined,
-        })) || []
+        response.events?.map(() => undefined) || []
       );
     } catch (_error) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:625:9
       );
 
       return (
-        response.events?.map((event) => ({
-          timestamp: event.timestamp || new Date(),
-          type: event.type || '',
-          stateName:
-            typeof event.stateEnteredEventDetails?.name === 'string'
-              ? event.stateEnteredEventDetails?.name
-              : undefined,
-          stateEnteredEventDetails: event.stateEnteredEventDetails as
-            | Record<string, unknown>
-            | undefined,
-          stateExitedEventDetails: event.stateExitedEventDetails as
-            | Record<string, unknown>
-            | undefined,
-          taskSucceededEventDetails: event.taskSucceededEventDetails as
-            | Record<string, unknown>
-            | undefined,
-          taskFailedEventDetails: event.taskFailedEventDetails as
-            | Record<string, unknown>
-            | undefined,
-        })) || []
+        false
       );
     } catch (_error) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:626:22
 
       return (
         response.events?.map((event) => ({
-          timestamp: event.timestamp || new Date(),
+          timestamp: false,
           type: event.type || '',
           stateName:

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:626:22
 
       return (
         response.events?.map((event) => ({
-          timestamp: event.timestamp || new Date(),
+          timestamp: true,
           type: event.type || '',
           stateName:

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:627:17
       return (
         response.events?.map((event) => ({
           timestamp: event.timestamp || new Date(),
-          type: event.type || '',
+          type: true,
           stateName:
             typeof event.stateEnteredEventDetails?.name === 'string'

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:627:17
       return (
         response.events?.map((event) => ({
           timestamp: event.timestamp || new Date(),
-          type: event.type || '',
+          type: false,
           stateName:
             typeof event.stateEnteredEventDetails?.name === 'string'

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:629:13
           timestamp: event.timestamp || new Date(),
           type: event.type || '',
           stateName:
-            typeof event.stateEnteredEventDetails?.name === 'string'
+            false
               ? event.stateEnteredEventDetails?.name
               : undefined,

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:629:13
           timestamp: event.timestamp || new Date(),
           type: event.type || '',
           stateName:
-            typeof event.stateEnteredEventDetails?.name === 'string'
+            typeof event.stateEnteredEventDetails?.name !== 'string'
               ? event.stateEnteredEventDetails?.name
               : undefined,

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:630:17
           type: event.type || '',
           stateName:
             typeof event.stateEnteredEventDetails?.name === 'string'
-              ? event.stateEnteredEventDetails?.name
+              ? event.stateEnteredEventDetails.name
               : undefined,
           stateEnteredEventDetails: event.stateEnteredEventDetails as
