[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:646:22
             | undefined,
         })) || []
       );
-    } catch (_error) {
-      return [];
-    }
+    } catch (_error) {}
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:670:36
       let startTime: Date | null = null;
       let endTime: Date | null = null;
 
-      for (const event of history) {
-        if (event.type === 'ExecutionStarted') {
-          startTime = event.timestamp;
-        } else if (event.type === 'ExecutionSucceeded') {
-          endTime = event.timestamp;
-        } else if (event.type === 'StateEntered' && event.stateName) {
-          completedStates.push(event.stateName);
-        } else if (
-          event.type === 'TaskFailed' ||
-          event.type === 'StateFailed'
-        ) {
-          if (event.stateName) {
-            failedStates.push(event.stateName);
-          }
-        }
-      }
+      for (const event of history) {}
 
       const executionTime =

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:671:13
       let endTime: Date | null = null;
 
       for (const event of history) {
-        if (event.type === 'ExecutionStarted') {
+        if (event.type !== 'ExecutionStarted') {
           startTime = event.timestamp;
         } else if (event.type === 'ExecutionSucceeded') {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:671:48
       let endTime: Date | null = null;
 
       for (const event of history) {
-        if (event.type === 'ExecutionStarted') {
-          startTime = event.timestamp;
-        } else if (event.type === 'ExecutionSucceeded') {
+        if (event.type === 'ExecutionStarted') {} else if (event.type === 'ExecutionSucceeded') {
           endTime = event.timestamp;
         } else if (event.type === 'StateEntered' && event.stateName) {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:673:57
       for (const event of history) {
         if (event.type === 'ExecutionStarted') {
           startTime = event.timestamp;
-        } else if (event.type === 'ExecutionSucceeded') {
-          endTime = event.timestamp;
-        } else if (event.type === 'StateEntered' && event.stateName) {
+        } else if (event.type === 'ExecutionSucceeded') {} else if (event.type === 'StateEntered' && event.stateName) {
           completedStates.push(event.stateName);
         } else if (

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:673:20
       for (const event of history) {
         if (event.type === 'ExecutionStarted') {
           startTime = event.timestamp;
-        } else if (event.type === 'ExecutionSucceeded') {
+        } else if (false) {
           endTime = event.timestamp;
         } else if (event.type === 'StateEntered' && event.stateName) {

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:675:20
           startTime = event.timestamp;
         } else if (event.type === 'ExecutionSucceeded') {
           endTime = event.timestamp;
-        } else if (event.type === 'StateEntered' && event.stateName) {
+        } else if (event.type === 'StateEntered' || event.stateName) {
           completedStates.push(event.stateName);
         } else if (

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:675:20
           startTime = event.timestamp;
         } else if (event.type === 'ExecutionSucceeded') {
           endTime = event.timestamp;
-        } else if (event.type === 'StateEntered' && event.stateName) {
+        } else if (event.type !== 'StateEntered' && event.stateName) {
           completedStates.push(event.stateName);
         } else if (

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:678:11
         } else if (event.type === 'StateEntered' && event.stateName) {
           completedStates.push(event.stateName);
         } else if (
-          event.type === 'TaskFailed' ||
-          event.type === 'StateFailed'
+          event.type === 'TaskFailed' && event.type === 'StateFailed'
         ) {
           if (event.stateName) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:678:11
         } else if (event.type === 'StateEntered' && event.stateName) {
           completedStates.push(event.stateName);
         } else if (
-          event.type === 'TaskFailed' ||
+          false ||
           event.type === 'StateFailed'
         ) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:679:11
           completedStates.push(event.stateName);
         } else if (
           event.type === 'TaskFailed' ||
-          event.type === 'StateFailed'
+          false
         ) {
           if (event.stateName) {

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:679:11
           completedStates.push(event.stateName);
         } else if (
           event.type === 'TaskFailed' ||
-          event.type === 'StateFailed'
+          event.type !== 'StateFailed'
         ) {
           if (event.stateName) {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:680:11
         } else if (
           event.type === 'TaskFailed' ||
           event.type === 'StateFailed'
-        ) {
-          if (event.stateName) {
-            failedStates.push(event.stateName);
-          }
-        }
+        ) {}
       }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:681:15
           event.type === 'TaskFailed' ||
           event.type === 'StateFailed'
         ) {
-          if (event.stateName) {
+          if (false) {
             failedStates.push(event.stateName);
           }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:681:15
           event.type === 'TaskFailed' ||
           event.type === 'StateFailed'
         ) {
-          if (event.stateName) {
+          if (true) {
             failedStates.push(event.stateName);
           }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:688:9
       }
 
       const executionTime =
-        startTime && endTime ? endTime.getTime() - startTime.getTime() : 0;
+        true ? endTime.getTime() - startTime.getTime() : 0;
 
       const success =

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:688:9
       }
 
       const executionTime =
-        startTime && endTime ? endTime.getTime() - startTime.getTime() : 0;
+        false ? endTime.getTime() - startTime.getTime() : 0;
 
       const success =

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:691:9
         startTime && endTime ? endTime.getTime() - startTime.getTime() : 0;
 
       const success =
-        failedStates.length === 0 &&
-        (expectedStates.length === 0 ||
-          expectedStates.every((state) => completedStates.includes(state)));
+        true;
 
       return {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:691:9
         startTime && endTime ? endTime.getTime() - startTime.getTime() : 0;
 
       const success =
-        failedStates.length === 0 &&
+        true &&
         (expectedStates.length === 0 ||
           expectedStates.every((state) => completedStates.includes(state)));

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:692:10
 
       const success =
         failedStates.length === 0 &&
-        (expectedStates.length === 0 ||
+        (expectedStates.length !== 0 ||
           expectedStates.every((state) => completedStates.includes(state)));
 

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:692:10
 
       const success =
         failedStates.length === 0 &&
-        (expectedStates.length === 0 ||
-          expectedStates.every((state) => completedStates.includes(state)));
+        (expectedStates.length === 0 && expectedStates.every(state => completedStates.includes(state)));
 
       return {

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:693:11
       const success =
         failedStates.length === 0 &&
         (expectedStates.length === 0 ||
-          expectedStates.every((state) => completedStates.includes(state)));
+          expectedStates.some(state => completedStates.includes(state)));
 
       return {

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:693:32
       const success =
         failedStates.length === 0 &&
         (expectedStates.length === 0 ||
-          expectedStates.every((state) => completedStates.includes(state)));
+          expectedStates.every(() => undefined));
 
       return {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:701:22
         failedStates,
         executionTime,
       };
-    } catch (_error) {
-      return {
-        success: false,
-        completedStates: [],
-        failedStates: [],
-        executionTime: 0,
-      };
-    }
+    } catch (_error) {}
   }
 

[Survived] ArrayDeclaration
src/framework/AWSTestingFramework.ts:705:23
       return {
         success: false,
         completedStates: [],
-        failedStates: [],
+        failedStates: ["Stryker was here"],
         executionTime: 0,
       };

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:726:52
       let totalTime = 0;
 
       // Calculate execution times for each state
-      for (let i = 0; i < history.length - 1; i++) {
-        const currentEvent = history[i];
-        const nextEvent = history[i + 1];
-
-        if (
-          currentEvent.type === 'StateEntered' &&
-          nextEvent.type === 'StateExited' &&
-          currentEvent.stateName === nextEvent.stateName &&
-          currentEvent.stateName
-        ) {
-          const executionTime =
-            nextEvent.timestamp.getTime() - currentEvent.timestamp.getTime();
-          stateExecutionTimes[currentEvent.stateName] = executionTime;
-          totalTime += executionTime;
-        }
-      }
+      for (let i = 0; i < history.length - 1; i++) {}
 
       const stateNames = Object.keys(stateExecutionTimes);

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:726:23
       let totalTime = 0;
 
       // Calculate execution times for each state
-      for (let i = 0; i < history.length - 1; i++) {
+      for (let i = 0; i <= history.length - 1; i++) {
         const currentEvent = history[i];
         const nextEvent = history[i + 1];

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:728:35
       // Calculate execution times for each state
       for (let i = 0; i < history.length - 1; i++) {
         const currentEvent = history[i];
-        const nextEvent = history[i + 1];
+        const nextEvent = history[i - 1];
 
         if (

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:731:11
         const nextEvent = history[i + 1];
 
         if (
-          currentEvent.type === 'StateEntered' &&
-          nextEvent.type === 'StateExited' &&
-          currentEvent.stateName === nextEvent.stateName &&
+          currentEvent.type === 'StateEntered' && nextEvent.type === 'StateExited' || currentEvent.stateName === nextEvent.stateName &&
           currentEvent.stateName
         ) {

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:731:11
         const nextEvent = history[i + 1];
 
         if (
-          currentEvent.type === 'StateEntered' &&
-          nextEvent.type === 'StateExited' &&
-          currentEvent.stateName === nextEvent.stateName &&
-          currentEvent.stateName
+          currentEvent.type === 'StateEntered' && nextEvent.type === 'StateExited' && currentEvent.stateName === nextEvent.stateName || currentEvent.stateName
         ) {
           const executionTime =

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:732:11
 
         if (
           currentEvent.type === 'StateEntered' &&
-          nextEvent.type === 'StateExited' &&
+          nextEvent.type !== 'StateExited' &&
           currentEvent.stateName === nextEvent.stateName &&
           currentEvent.stateName

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:732:11
 
         if (
           currentEvent.type === 'StateEntered' &&
-          nextEvent.type === 'StateExited' &&
+          true &&
           currentEvent.stateName === nextEvent.stateName &&
           currentEvent.stateName

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:733:11
         if (
           currentEvent.type === 'StateEntered' &&
           nextEvent.type === 'StateExited' &&
-          currentEvent.stateName === nextEvent.stateName &&
+          true &&
           currentEvent.stateName
         ) {

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:733:11
         if (
           currentEvent.type === 'StateEntered' &&
           nextEvent.type === 'StateExited' &&
-          currentEvent.stateName === nextEvent.stateName &&
+          currentEvent.stateName !== nextEvent.stateName &&
           currentEvent.stateName
         ) {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:735:11
           nextEvent.type === 'StateExited' &&
           currentEvent.stateName === nextEvent.stateName &&
           currentEvent.stateName
-        ) {
-          const executionTime =
-            nextEvent.timestamp.getTime() - currentEvent.timestamp.getTime();
-          stateExecutionTimes[currentEvent.stateName] = executionTime;
-          totalTime += executionTime;
-        }
+        ) {}
       }
 

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:737:13
           currentEvent.stateName
         ) {
           const executionTime =
-            nextEvent.timestamp.getTime() - currentEvent.timestamp.getTime();
+            nextEvent.timestamp.getTime() + currentEvent.timestamp.getTime();
           stateExecutionTimes[currentEvent.stateName] = executionTime;
           totalTime += executionTime;

[Survived] AssignmentOperator
src/framework/AWSTestingFramework.ts:739:11
           const executionTime =
             nextEvent.timestamp.getTime() - currentEvent.timestamp.getTime();
           stateExecutionTimes[currentEvent.stateName] = executionTime;
-          totalTime += executionTime;
+          totalTime -= executionTime;
         }
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:747:9
       const executionTimes = Object.values(stateExecutionTimes);
 
       const slowestState =
-        stateNames.length > 0
+        true
           ? stateNames.reduce((a, b) =>
               stateExecutionTimes[a] > stateExecutionTimes[b] ? a : b

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:747:9
       const executionTimes = Object.values(stateExecutionTimes);
 
       const slowestState =
-        stateNames.length > 0
+        false
           ? stateNames.reduce((a, b) =>
               stateExecutionTimes[a] > stateExecutionTimes[b] ? a : b

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:748:31
 
       const slowestState =
         stateNames.length > 0
-          ? stateNames.reduce((a, b) =>
-              stateExecutionTimes[a] > stateExecutionTimes[b] ? a : b
+          ? stateNames.reduce(() => undefined
             )
           : null;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:749:15
       const slowestState =
         stateNames.length > 0
           ? stateNames.reduce((a, b) =>
-              stateExecutionTimes[a] > stateExecutionTimes[b] ? a : b
+              stateExecutionTimes[a] <= stateExecutionTimes[b] ? a : b
             )
           : null;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:749:15
       const slowestState =
         stateNames.length > 0
           ? stateNames.reduce((a, b) =>
-              stateExecutionTimes[a] > stateExecutionTimes[b] ? a : b
+              false ? a : b
             )
           : null;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:754:9
           : null;
 
       const fastestState =
-        stateNames.length > 0
+        true
           ? stateNames.reduce((a, b) =>
               stateExecutionTimes[a] < stateExecutionTimes[b] ? a : b

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:754:9
           : null;
 
       const fastestState =
-        stateNames.length > 0
+        stateNames.length >= 0
           ? stateNames.reduce((a, b) =>
               stateExecutionTimes[a] < stateExecutionTimes[b] ? a : b

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:755:31
 
       const fastestState =
         stateNames.length > 0
-          ? stateNames.reduce((a, b) =>
-              stateExecutionTimes[a] < stateExecutionTimes[b] ? a : b
+          ? stateNames.reduce(() => undefined
             )
           : null;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:756:15
       const fastestState =
         stateNames.length > 0
           ? stateNames.reduce((a, b) =>
-              stateExecutionTimes[a] < stateExecutionTimes[b] ? a : b
+              true ? a : b
             )
           : null;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:756:15
       const fastestState =
         stateNames.length > 0
           ? stateNames.reduce((a, b) =>
-              stateExecutionTimes[a] < stateExecutionTimes[b] ? a : b
+              stateExecutionTimes[a] >= stateExecutionTimes[b] ? a : b
             )
           : null;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:761:9
           : null;
 
       const averageTime =
-        executionTimes.length > 0
+        executionTimes.length <= 0
           ? executionTimes.reduce((a, b) => a + b, 0) / executionTimes.length
           : 0;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:761:9
           : null;
 
       const averageTime =
-        executionTimes.length > 0
+        true
           ? executionTimes.reduce((a, b) => a + b, 0) / executionTimes.length
           : 0;

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:762:45
 
       const averageTime =
         executionTimes.length > 0
-          ? executionTimes.reduce((a, b) => a + b, 0) / executionTimes.length
+          ? executionTimes.reduce((a, b) => a - b, 0) / executionTimes.length
           : 0;
 

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:762:35
 
       const averageTime =
         executionTimes.length > 0
-          ? executionTimes.reduce((a, b) => a + b, 0) / executionTimes.length
+          ? executionTimes.reduce(() => undefined, 0) / executionTimes.length
           : 0;
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:771:22
         slowestState,
         fastestState,
       };
-    } catch (_error) {
-      return {
-        totalExecutionTime: 0,
-        averageStateExecutionTime: 0,
-        slowestState: null,
-        fastestState: null,
-      };
-    }
+    } catch (_error) {}
   }
 

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:794:41
     try {
       const stateMachineArn = await this.findStateMachine(stateMachineName);
       const response = await this.sfnClient.send(
-        new DescribeStateMachineCommand({ stateMachineArn })
+        new DescribeStateMachineCommand({})
       );
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:803:11
       const errors: string[] = [];
 
       // Basic validation
-      if (!definition.StartAt) {
+      if (definition.StartAt) {
         errors.push('Missing StartAt state');
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:803:11
       const errors: string[] = [];
 
       // Basic validation
-      if (!definition.StartAt) {
+      if (false) {
         errors.push('Missing StartAt state');
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:807:11
         errors.push('Missing StartAt state');
       }
 
-      if (!definition.States) {
+      if (true) {
         errors.push('Missing States definition');
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:807:11
         errors.push('Missing StartAt state');
       }
 
-      if (!definition.States) {
+      if (false) {
         errors.push('Missing States definition');
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:811:22
         errors.push('Missing States definition');
       }
 
-      const states = definition.States || {};
+      const states = true;
       const stateNames = Object.keys(states);
       const hasEndStates = stateNames.some(

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:811:22
         errors.push('Missing States definition');
       }
 
-      const states = definition.States || {};
+      const states = false;
       const stateNames = Object.keys(states);
       const hasEndStates = stateNames.some(

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:813:28
 
       const states = definition.States || {};
       const stateNames = Object.keys(states);
-      const hasEndStates = stateNames.some(
-        (stateName) =>
-          states[stateName].End === true ||
-          states[stateName].Type === 'Succeed' ||
-          states[stateName].Type === 'Fail'
-      );
+      const hasEndStates = stateNames.every(stateName => states[stateName].End === true || states[stateName].Type === 'Succeed' || states[stateName].Type === 'Fail');
 
       return {

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:814:9
       const states = definition.States || {};
       const stateNames = Object.keys(states);
       const hasEndStates = stateNames.some(
-        (stateName) =>
-          states[stateName].End === true ||
-          states[stateName].Type === 'Succeed' ||
-          states[stateName].Type === 'Fail'
+        () => undefined
       );
 

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:815:11
       const stateNames = Object.keys(states);
       const hasEndStates = stateNames.some(
         (stateName) =>
-          states[stateName].End === true ||
-          states[stateName].Type === 'Succeed' ||
-          states[stateName].Type === 'Fail'
+          (states[stateName].End === true || states[stateName].Type === 'Succeed') && states[stateName].Type === 'Fail'
       );
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:815:37
       const stateNames = Object.keys(states);
       const hasEndStates = stateNames.some(
         (stateName) =>
-          states[stateName].End === true ||
+          states[stateName].End === false ||
           states[stateName].Type === 'Succeed' ||
           states[stateName].Type === 'Fail'

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:816:11
       const hasEndStates = stateNames.some(
         (stateName) =>
           states[stateName].End === true ||
-          states[stateName].Type === 'Succeed' ||
+          states[stateName].Type !== 'Succeed' ||
           states[stateName].Type === 'Fail'
       );

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:816:11
       const hasEndStates = stateNames.some(
         (stateName) =>
           states[stateName].End === true ||
-          states[stateName].Type === 'Succeed' ||
+          false ||
           states[stateName].Type === 'Fail'
       );

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:817:11
         (stateName) =>
           states[stateName].End === true ||
           states[stateName].Type === 'Succeed' ||
-          states[stateName].Type === 'Fail'
+          states[stateName].Type !== 'Fail'
       );
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:817:11
         (stateName) =>
           states[stateName].End === true ||
           states[stateName].Type === 'Succeed' ||
-          states[stateName].Type === 'Fail'
+          false
       );
 

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:820:14
           states[stateName].Type === 'Fail'
       );
 
-      return {
-        isValid: errors.length === 0,
-        hasStartState: !!definition.StartAt,
-        hasEndStates,
-        stateCount: stateNames.length,
-        errors,
-      };
+      return {};
     } catch (_error) {
       return {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:821:18
       );
 
       return {
-        isValid: errors.length === 0,
+        isValid: false,
         hasStartState: !!definition.StartAt,
         hasEndStates,

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:821:18
       );
 
       return {
-        isValid: errors.length === 0,
+        isValid: errors.length !== 0,
         hasStartState: !!definition.StartAt,
         hasEndStates,

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:822:24
 
       return {
         isValid: errors.length === 0,
-        hasStartState: !!definition.StartAt,
+        hasStartState: !definition.StartAt,
         hasEndStates,
         stateCount: stateNames.length,

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:827:22
         stateCount: stateNames.length,
         errors,
       };
-    } catch (_error) {
-      return {
-        isValid: false,
-        hasStartState: false,
-        hasEndStates: false,
-        stateCount: 0,
-        errors: [`Error parsing definition: ${_error}`],
-      };
-    }
+    } catch (_error) {}
   }
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:830:24
     } catch (_error) {
       return {
         isValid: false,
-        hasStartState: false,
+        hasStartState: true,
         hasEndStates: false,
         stateCount: 0,

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:831:23
       return {
         isValid: false,
         hasStartState: false,
-        hasEndStates: false,
+        hasEndStates: true,
         stateCount: 0,
         errors: [`Error parsing definition: ${_error}`],

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:865:11
 
       for (const event of history) {
         if (
-          event.type === 'TaskStateEntered' ||
-          event.type === 'StateEntered'
+          event.type === 'TaskStateEntered' && event.type === 'StateEntered'
         ) {
           const stateEnteredEvent = event.stateEnteredEventDetails;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:865:11
 
       for (const event of history) {
         if (
-          event.type === 'TaskStateEntered' ||
+          false ||
           event.type === 'StateEntered'
         ) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:866:11
       for (const event of history) {
         if (
           event.type === 'TaskStateEntered' ||
-          event.type === 'StateEntered'
+          false
         ) {
           const stateEnteredEvent = event.stateEnteredEventDetails;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:866:11
       for (const event of history) {
         if (
           event.type === 'TaskStateEntered' ||
-          event.type === 'StateEntered'
+          event.type !== 'StateEntered'
         ) {
           const stateEnteredEvent = event.stateEnteredEventDetails;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:870:13
         ) {
           const stateEnteredEvent = event.stateEnteredEventDetails;
           if (
-            stateEnteredEvent &&
-            (!stateName || stateEnteredEvent.name === stateName)
+            false
           ) {
             const stateOutput = {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:870:13
         ) {
           const stateEnteredEvent = event.stateEnteredEventDetails;
           if (
-            stateEnteredEvent &&
-            (!stateName || stateEnteredEvent.name === stateName)
+            true
           ) {
             const stateOutput = {

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:871:28
           const stateEnteredEvent = event.stateEnteredEventDetails;
           if (
             stateEnteredEvent &&
-            (!stateName || stateEnteredEvent.name === stateName)
+            (!stateName || stateEnteredEvent.name !== stateName)
           ) {
             const stateOutput = {

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:871:14
           const stateEnteredEvent = event.stateEnteredEventDetails;
           if (
             stateEnteredEvent &&
-            (!stateName || stateEnteredEvent.name === stateName)
+            (!stateName && stateEnteredEvent.name === stateName)
           ) {
             const stateOutput = {

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:873:33
             stateEnteredEvent &&
             (!stateName || stateEnteredEvent.name === stateName)
           ) {
-            const stateOutput = {
-              stateName:
-                typeof stateEnteredEvent.name === 'string'
-                  ? stateEnteredEvent.name
-                  : '',
-              input:
-                typeof stateEnteredEvent.input === 'string' &&
-                stateEnteredEvent.input.trim() !== ''
-                  ? JSON.parse(stateEnteredEvent.input)
-                  : {},
-              output: {},
-              timestamp: event.timestamp,
-              type: event.type,
-            };
+            const stateOutput = {};
 
             // Find corresponding output event

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:875:17
           ) {
             const stateOutput = {
               stateName:
-                typeof stateEnteredEvent.name === 'string'
+                typeof stateEnteredEvent.name !== 'string'
                   ? stateEnteredEvent.name
                   : '',
