[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:875:17
           ) {
             const stateOutput = {
               stateName:
-                typeof stateEnteredEvent.name === 'string'
+                false
                   ? stateEnteredEvent.name
                   : '',

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:879:17
                   ? stateEnteredEvent.name
                   : '',
               input:
-                typeof stateEnteredEvent.input === 'string' &&
+                typeof stateEnteredEvent.input !== 'string' &&
                 stateEnteredEvent.input.trim() !== ''
                   ? JSON.parse(stateEnteredEvent.input)

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:879:17
                   ? stateEnteredEvent.name
                   : '',
               input:
-                typeof stateEnteredEvent.input === 'string' &&
-                stateEnteredEvent.input.trim() !== ''
+                false
                   ? JSON.parse(stateEnteredEvent.input)
                   : {},

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:880:17
                   : '',
               input:
                 typeof stateEnteredEvent.input === 'string' &&
-                stateEnteredEvent.input.trim() !== ''
+                true
                   ? JSON.parse(stateEnteredEvent.input)
                   : {},

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:880:17
                   : '',
               input:
                 typeof stateEnteredEvent.input === 'string' &&
-                stateEnteredEvent.input.trim() !== ''
+                stateEnteredEvent.input.trim() === ''
                   ? JSON.parse(stateEnteredEvent.input)
                   : {},

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:890:54
 
             // Find corresponding output event
             const outputEvent = history.find(
-              (e) => e.type === 'TaskStateExited' || e.type === 'StateExited'
+              (e) => e.type === 'TaskStateExited' || false
             );
             if (outputEvent?.stateExitedEventDetails) {

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:890:22
 
             // Find corresponding output event
             const outputEvent = history.find(
-              (e) => e.type === 'TaskStateExited' || e.type === 'StateExited'
+              (e) => e.type !== 'TaskStateExited' || e.type === 'StateExited'
             );
             if (outputEvent?.stateExitedEventDetails) {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:892:55
             const outputEvent = history.find(
               (e) => e.type === 'TaskStateExited' || e.type === 'StateExited'
             );
-            if (outputEvent?.stateExitedEventDetails) {
-              stateOutput.output =
-                typeof outputEvent.stateExitedEventDetails.output ===
-                  'string' &&
-                outputEvent.stateExitedEventDetails.output.trim() !== ''
-                  ? JSON.parse(outputEvent.stateExitedEventDetails.output)
-                  : {};
-            }
+            if (outputEvent?.stateExitedEventDetails) {}
 
             stateOutputs.push(stateOutput);

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:892:17
             const outputEvent = history.find(
               (e) => e.type === 'TaskStateExited' || e.type === 'StateExited'
             );
-            if (outputEvent?.stateExitedEventDetails) {
+            if (false) {
               stateOutput.output =
                 typeof outputEvent.stateExitedEventDetails.output ===

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:894:17
             );
             if (outputEvent?.stateExitedEventDetails) {
               stateOutput.output =
-                typeof outputEvent.stateExitedEventDetails.output ===
-                  'string' &&
-                outputEvent.stateExitedEventDetails.output.trim() !== ''
+                true
                   ? JSON.parse(outputEvent.stateExitedEventDetails.output)
                   : {};

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:894:17
             );
             if (outputEvent?.stateExitedEventDetails) {
               stateOutput.output =
-                typeof outputEvent.stateExitedEventDetails.output ===
-                  'string' &&
+                true &&
                 outputEvent.stateExitedEventDetails.output.trim() !== ''
                   ? JSON.parse(outputEvent.stateExitedEventDetails.output)

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:895:19
             if (outputEvent?.stateExitedEventDetails) {
               stateOutput.output =
                 typeof outputEvent.stateExitedEventDetails.output ===
-                  'string' &&
+                  "" &&
                 outputEvent.stateExitedEventDetails.output.trim() !== ''
                   ? JSON.parse(outputEvent.stateExitedEventDetails.output)

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:896:17
               stateOutput.output =
                 typeof outputEvent.stateExitedEventDetails.output ===
                   'string' &&
-                outputEvent.stateExitedEventDetails.output.trim() !== ''
+                true
                   ? JSON.parse(outputEvent.stateExitedEventDetails.output)
                   : {};

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:896:17
               stateOutput.output =
                 typeof outputEvent.stateExitedEventDetails.output ===
                   'string' &&
-                outputEvent.stateExitedEventDetails.output.trim() !== ''
+                outputEvent.stateExitedEventDetails.output !== ''
                   ? JSON.parse(outputEvent.stateExitedEventDetails.output)
                   : {};

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:907:22
       }
 
       return stateOutputs;
-    } catch (_error) {
-      return [];
-    }
+    } catch (_error) {}
   }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:931:21
         stateName
       );
       const stateOutput = stateOutputs.find(
-        (output) => output.stateName === stateName
+        (output) => true
       );
 

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:931:9
         stateName
       );
       const stateOutput = stateOutputs.find(
-        (output) => output.stateName === stateName
+        () => undefined
       );
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:934:11
         (output) => output.stateName === stateName
       );
 
-      if (!stateOutput) {
+      if (stateOutput) {
         return {
           matches: false,

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:934:11
         (output) => output.stateName === stateName
       );
 
-      if (!stateOutput) {
+      if (false) {
         return {
           matches: false,

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:935:16
       );
 
       if (!stateOutput) {
-        return {
-          matches: false,
-          actualOutput: {},
-          missingFields: Object.keys(expectedOutput),
-          extraFields: [],
-        };
+        return {};
       }
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:936:20
 
       if (!stateOutput) {
         return {
-          matches: false,
+          matches: true,
           actualOutput: {},
           missingFields: Object.keys(expectedOutput),

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:948:66
       const extraFields: string[] = [];
 
       // Check for missing fields
-      for (const [key, value] of Object.entries(expectedOutput)) {
-        if (!(key in actualOutput) || actualOutput[key] !== value) {
-          missingFields.push(key);
-        }
-      }
+      for (const [key, value] of Object.entries(expectedOutput)) {}
 
       // Check for extra fields (optional)

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:949:39
 
       // Check for missing fields
       for (const [key, value] of Object.entries(expectedOutput)) {
-        if (!(key in actualOutput) || actualOutput[key] !== value) {
+        if (!(key in actualOutput) || false) {
           missingFields.push(key);
         }

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:949:39
 
       // Check for missing fields
       for (const [key, value] of Object.entries(expectedOutput)) {
-        if (!(key in actualOutput) || actualOutput[key] !== value) {
+        if (!(key in actualOutput) || actualOutput[key] === value) {
           missingFields.push(key);
         }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:955:52
       }
 
       // Check for extra fields (optional)
-      for (const key of Object.keys(actualOutput)) {
-        if (!(key in expectedOutput)) {
-          extraFields.push(key);
-        }
-      }
+      for (const key of Object.keys(actualOutput)) {}
 
       return {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:956:13
 
       // Check for extra fields (optional)
       for (const key of Object.keys(actualOutput)) {
-        if (!(key in expectedOutput)) {
+        if (true) {
           extraFields.push(key);
         }

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:956:13
 
       // Check for extra fields (optional)
       for (const key of Object.keys(actualOutput)) {
-        if (!(key in expectedOutput)) {
+        if (key in expectedOutput) {
           extraFields.push(key);
         }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:962:18
       }
 
       return {
-        matches: missingFields.length === 0,
+        matches: false,
         actualOutput,
         missingFields,

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:962:18
       }
 
       return {
-        matches: missingFields.length === 0,
+        matches: true,
         actualOutput,
         missingFields,

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:967:22
         missingFields,
         extraFields,
       };
-    } catch (_error) {
-      return {
-        matches: false,
-        actualOutput: {},
-        missingFields: Object.keys(expectedOutput),
-        extraFields: [],
-      };
-    }
+    } catch (_error) {}
   }
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:998:22
         dataTransformation: Record<string, unknown>;
         timestamp: Date;
       }> = [];
-      let dataLoss = false;
+      let dataLoss = true;
       let dataCorruption = false;
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:999:28
         timestamp: Date;
       }> = [];
       let dataLoss = false;
-      let dataCorruption = false;
+      let dataCorruption = true;
 
       // Analyze data flow between states

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1002:23
       let dataCorruption = false;
 
       // Analyze data flow between states
-      for (let i = 0; i < history.length - 1; i++) {
+      for (let i = 0; i >= history.length - 1; i++) {
         const currentEvent = history[i];
         const nextEvent = history[i + 1];

[Survived] UpdateOperator
src/framework/AWSTestingFramework.ts:1002:47
       let dataCorruption = false;
 
       // Analyze data flow between states
-      for (let i = 0; i < history.length - 1; i++) {
+      for (let i = 0; i < history.length - 1; i--) {
         const currentEvent = history[i];
         const nextEvent = history[i + 1];

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1007:11
         const nextEvent = history[i + 1];
 
         if (
-          currentEvent.type === 'StateExited' &&
+          currentEvent.type !== 'StateExited' &&
           nextEvent.type === 'StateEntered'
         ) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1007:11
         const nextEvent = history[i + 1];
 
         if (
-          currentEvent.type === 'StateExited' &&
-          nextEvent.type === 'StateEntered'
+          false
         ) {
           const fromState =

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1008:11
 
         if (
           currentEvent.type === 'StateExited' &&
-          nextEvent.type === 'StateEntered'
+          nextEvent.type !== 'StateEntered'
         ) {
           const fromState =

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1008:11
 
         if (
           currentEvent.type === 'StateExited' &&
-          nextEvent.type === 'StateEntered'
+          true
         ) {
           const fromState =

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1011:13
           nextEvent.type === 'StateEntered'
         ) {
           const fromState =
-            typeof currentEvent.stateExitedEventDetails?.name === 'string'
+            typeof currentEvent.stateExitedEventDetails?.name !== 'string'
               ? currentEvent.stateExitedEventDetails.name
               : '';

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:1011:20
           nextEvent.type === 'StateEntered'
         ) {
           const fromState =
-            typeof currentEvent.stateExitedEventDetails?.name === 'string'
+            typeof currentEvent.stateExitedEventDetails.name === 'string'
               ? currentEvent.stateExitedEventDetails.name
               : '';

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1015:13
               ? currentEvent.stateExitedEventDetails.name
               : '';
           const toState =
-            typeof nextEvent.stateEnteredEventDetails?.name === 'string'
+            typeof nextEvent.stateEnteredEventDetails?.name !== 'string'
               ? nextEvent.stateEnteredEventDetails.name
               : '';

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1015:13
               ? currentEvent.stateExitedEventDetails.name
               : '';
           const toState =
-            typeof nextEvent.stateEnteredEventDetails?.name === 'string'
+            true
               ? nextEvent.stateEnteredEventDetails.name
               : '';

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1017:17
           const toState =
             typeof nextEvent.stateEnteredEventDetails?.name === 'string'
               ? nextEvent.stateEnteredEventDetails.name
-              : '';
+              : "Stryker was here!";
 
           if (fromState && toState) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1019:15
               ? nextEvent.stateEnteredEventDetails.name
               : '';
 
-          if (fromState && toState) {
+          if (false) {
             const fromOutput =
               typeof currentEvent.stateExitedEventDetails?.output ===

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1019:15
               ? nextEvent.stateEnteredEventDetails.name
               : '';
 
-          if (fromState && toState) {
+          if (true) {
             const fromOutput =
               typeof currentEvent.stateExitedEventDetails?.output ===

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1021:15
 
           if (fromState && toState) {
             const fromOutput =
-              typeof currentEvent.stateExitedEventDetails?.output ===
-                'string' &&
-              currentEvent.stateExitedEventDetails.output.trim() !== ''
+              true
                 ? JSON.parse(currentEvent.stateExitedEventDetails.output)
                 : {};

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1021:15
 
           if (fromState && toState) {
             const fromOutput =
-              typeof currentEvent.stateExitedEventDetails?.output ===
-                'string' &&
+              true &&
               currentEvent.stateExitedEventDetails.output.trim() !== ''
                 ? JSON.parse(currentEvent.stateExitedEventDetails.output)

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1023:15
             const fromOutput =
               typeof currentEvent.stateExitedEventDetails?.output ===
                 'string' &&
-              currentEvent.stateExitedEventDetails.output.trim() !== ''
+              true
                 ? JSON.parse(currentEvent.stateExitedEventDetails.output)
                 : {};

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:1023:15
             const fromOutput =
               typeof currentEvent.stateExitedEventDetails?.output ===
                 'string' &&
-              currentEvent.stateExitedEventDetails.output.trim() !== ''
+              currentEvent.stateExitedEventDetails.output !== ''
                 ? JSON.parse(currentEvent.stateExitedEventDetails.output)
                 : {};

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:1027:22
                 ? JSON.parse(currentEvent.stateExitedEventDetails.output)
                 : {};
             const toInput =
-              typeof nextEvent.stateEnteredEventDetails?.input === 'string' &&
+              typeof nextEvent.stateEnteredEventDetails.input === 'string' &&
               nextEvent.stateEnteredEventDetails.input.trim() !== ''
                 ? JSON.parse(nextEvent.stateEnteredEventDetails.input)

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1027:15
                 ? JSON.parse(currentEvent.stateExitedEventDetails.output)
                 : {};
             const toInput =
-              typeof nextEvent.stateEnteredEventDetails?.input === 'string' &&
-              nextEvent.stateEnteredEventDetails.input.trim() !== ''
+              true
                 ? JSON.parse(nextEvent.stateEnteredEventDetails.input)
                 : {};

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1028:15
                 : {};
             const toInput =
               typeof nextEvent.stateEnteredEventDetails?.input === 'string' &&
-              nextEvent.stateEnteredEventDetails.input.trim() !== ''
+              true
                 ? JSON.parse(nextEvent.stateEnteredEventDetails.input)
                 : {};

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1028:15
                 : {};
             const toInput =
               typeof nextEvent.stateEnteredEventDetails?.input === 'string' &&
-              nextEvent.stateEnteredEventDetails.input.trim() !== ''
+              nextEvent.stateEnteredEventDetails.input.trim() === ''
                 ? JSON.parse(nextEvent.stateEnteredEventDetails.input)
                 : {};

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1034:15
 
             // Check for data loss
             if (
-              Object.keys(fromOutput).length > 0 &&
+              Object.keys(fromOutput).length <= 0 &&
               Object.keys(toInput).length === 0
             ) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1034:15
 
             // Check for data loss
             if (
-              Object.keys(fromOutput).length > 0 &&
-              Object.keys(toInput).length === 0
+              true
             ) {
               dataLoss = true;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1035:15
             // Check for data loss
             if (
               Object.keys(fromOutput).length > 0 &&
-              Object.keys(toInput).length === 0
+              Object.keys(toInput).length !== 0
             ) {
               dataLoss = true;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1035:15
             // Check for data loss
             if (
               Object.keys(fromOutput).length > 0 &&
-              Object.keys(toInput).length === 0
+              true
             ) {
               dataLoss = true;

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1036:15
             if (
               Object.keys(fromOutput).length > 0 &&
               Object.keys(toInput).length === 0
-            ) {
-              dataLoss = true;
-            }
+            ) {}
 
             // Check for data corruption (simplified check)

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1037:26
               Object.keys(fromOutput).length > 0 &&
               Object.keys(toInput).length === 0
             ) {
-              dataLoss = true;
+              dataLoss = false;
             }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1043:17
             // Check for data corruption (simplified check)
             const outputKeys = Object.keys(fromOutput);
             const inputKeys = Object.keys(toInput);
-            if (outputKeys.length > 0 && inputKeys.length > 0) {
+            if (false) {
               const commonKeys = outputKeys.filter((key) =>
                 inputKeys.includes(key)

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:1043:17
             // Check for data corruption (simplified check)
             const outputKeys = Object.keys(fromOutput);
             const inputKeys = Object.keys(toInput);
-            if (outputKeys.length > 0 && inputKeys.length > 0) {
+            if (outputKeys.length > 0 || inputKeys.length > 0) {
               const commonKeys = outputKeys.filter((key) =>
                 inputKeys.includes(key)

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:1044:52
             const outputKeys = Object.keys(fromOutput);
             const inputKeys = Object.keys(toInput);
             if (outputKeys.length > 0 && inputKeys.length > 0) {
-              const commonKeys = outputKeys.filter((key) =>
-                inputKeys.includes(key)
+              const commonKeys = outputKeys.filter(() => undefined
               );
               if (commonKeys.length === 0) {

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:1044:34
             const outputKeys = Object.keys(fromOutput);
             const inputKeys = Object.keys(toInput);
             if (outputKeys.length > 0 && inputKeys.length > 0) {
-              const commonKeys = outputKeys.filter((key) =>
-                inputKeys.includes(key)
-              );
+              const commonKeys = outputKeys;
               if (commonKeys.length === 0) {
                 dataCorruption = true;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1047:19
               const commonKeys = outputKeys.filter((key) =>
                 inputKeys.includes(key)
               );
-              if (commonKeys.length === 0) {
+              if (commonKeys.length !== 0) {
                 dataCorruption = true;
               }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1047:44
               const commonKeys = outputKeys.filter((key) =>
                 inputKeys.includes(key)
               );
-              if (commonKeys.length === 0) {
-                dataCorruption = true;
-              }
+              if (commonKeys.length === 0) {}
             }
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1048:34
                 inputKeys.includes(key)
               );
               if (commonKeys.length === 0) {
-                dataCorruption = true;
+                dataCorruption = false;
               }
             }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1070:22
         dataLoss,
         dataCorruption,
       };
-    } catch (_error) {
-      return {
-        dataFlow: [],
-        dataLoss: false,
-        dataCorruption: false,
-      };
-    }
+    } catch (_error) {}
   }
 

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:1071:14
         dataCorruption,
       };
     } catch (_error) {
-      return {
-        dataFlow: [],
-        dataLoss: false,
-        dataCorruption: false,
-      };
+      return {};
     }
   }

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1073:19
     } catch (_error) {
       return {
         dataFlow: [],
-        dataLoss: false,
+        dataLoss: true,
         dataCorruption: false,
       };

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1074:25
       return {
         dataFlow: [],
         dataLoss: false,
-        dataCorruption: false,
+        dataCorruption: true,
       };
     }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1103:9
       const violations: string[] = [];
 
       if (
-        slas.maxTotalExecutionTime &&
-        performance.totalExecutionTime > slas.maxTotalExecutionTime
+        true
       ) {
         violations.push(

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:1103:9
       const violations: string[] = [];
 
       if (
-        slas.maxTotalExecutionTime &&
-        performance.totalExecutionTime > slas.maxTotalExecutionTime
+        slas.maxTotalExecutionTime || performance.totalExecutionTime > slas.maxTotalExecutionTime
       ) {
         violations.push(

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1104:9
 
       if (
         slas.maxTotalExecutionTime &&
-        performance.totalExecutionTime > slas.maxTotalExecutionTime
+        performance.totalExecutionTime <= slas.maxTotalExecutionTime
       ) {
         violations.push(

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1104:9
 
       if (
         slas.maxTotalExecutionTime &&
-        performance.totalExecutionTime > slas.maxTotalExecutionTime
+        true
       ) {
         violations.push(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1105:9
       if (
         slas.maxTotalExecutionTime &&
         performance.totalExecutionTime > slas.maxTotalExecutionTime
-      ) {
-        violations.push(
-          `Total execution time ${performance.totalExecutionTime}ms exceeds SLA of ${slas.maxTotalExecutionTime}ms`
-        );
-      }
+      ) {}
 
       if (

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1107:11
         performance.totalExecutionTime > slas.maxTotalExecutionTime
       ) {
         violations.push(
-          `Total execution time ${performance.totalExecutionTime}ms exceeds SLA of ${slas.maxTotalExecutionTime}ms`
+          ``
         );
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1112:9
       }
 
       if (
-        slas.maxStateExecutionTime &&
-        performance.averageStateExecutionTime > slas.maxStateExecutionTime
+        false
       ) {
         violations.push(

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:1112:9
       }
 
       if (
-        slas.maxStateExecutionTime &&
-        performance.averageStateExecutionTime > slas.maxStateExecutionTime
+        slas.maxStateExecutionTime || performance.averageStateExecutionTime > slas.maxStateExecutionTime
       ) {
         violations.push(

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1113:9
 
       if (
         slas.maxStateExecutionTime &&
-        performance.averageStateExecutionTime > slas.maxStateExecutionTime
+        performance.averageStateExecutionTime <= slas.maxStateExecutionTime
       ) {
         violations.push(

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1113:9
 
       if (
         slas.maxStateExecutionTime &&
-        performance.averageStateExecutionTime > slas.maxStateExecutionTime
+        performance.averageStateExecutionTime >= slas.maxStateExecutionTime
       ) {
         violations.push(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1114:9
       if (
         slas.maxStateExecutionTime &&
         performance.averageStateExecutionTime > slas.maxStateExecutionTime
-      ) {
-        violations.push(
-          `Average state execution time ${performance.averageStateExecutionTime}ms exceeds SLA of ${slas.maxStateExecutionTime}ms`
-        );
-      }
+      ) {}
 
       // Cold start detection (simplified)

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1116:11
         performance.averageStateExecutionTime > slas.maxStateExecutionTime
       ) {
         violations.push(
-          `Average state execution time ${performance.averageStateExecutionTime}ms exceeds SLA of ${slas.maxStateExecutionTime}ms`
+          ``
         );
       }

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1122:11
 
       // Cold start detection (simplified)
       const coldStartTime = performance.slowestState
-        ? performance.totalExecutionTime * 0.1
+        ? performance.totalExecutionTime / 0.1
         : 0;
       if (slas.maxColdStartTime && coldStartTime > slas.maxColdStartTime) {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1124:11
       const coldStartTime = performance.slowestState
         ? performance.totalExecutionTime * 0.1
         : 0;
-      if (slas.maxColdStartTime && coldStartTime > slas.maxColdStartTime) {
+      if (false) {
         violations.push(
           `Cold start time ${coldStartTime}ms exceeds SLA of ${slas.maxColdStartTime}ms`

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:1124:11
       const coldStartTime = performance.slowestState
         ? performance.totalExecutionTime * 0.1
         : 0;
-      if (slas.maxColdStartTime && coldStartTime > slas.maxColdStartTime) {
+      if (slas.maxColdStartTime || coldStartTime > slas.maxColdStartTime) {
         violations.push(
           `Cold start time ${coldStartTime}ms exceeds SLA of ${slas.maxColdStartTime}ms`
