[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:1415:12
    * Get slowest operations (top N)
    */
   getSlowestOperations(count = 5): PerformanceMetrics[] {
-    return this.performanceMetrics
-      .sort((a, b) => b.duration - a.duration)
-      .slice(0, count);
+    return this.performanceMetrics.sort((a, b) => b.duration - a.duration);
   }
 

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1416:23
    */
   getSlowestOperations(count = 5): PerformanceMetrics[] {
     return this.performanceMetrics
-      .sort((a, b) => b.duration - a.duration)
+      .sort((a, b) => b.duration + a.duration)
       .slice(0, count);
   }

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:1416:13
    */
   getSlowestOperations(count = 5): PerformanceMetrics[] {
     return this.performanceMetrics
-      .sort((a, b) => b.duration - a.duration)
+      .sort(() => undefined)
       .slice(0, count);
   }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1423:65
   /**
    * Get operations with most retries
    */
-  getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {
-    return this.performanceMetrics
-      .filter((m) => m.retryCount > 0)
-      .sort((a, b) => b.retryCount - a.retryCount)
-      .slice(0, count);
-  }
+  getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {}
 
   /**

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:1424:12
    * Get operations with most retries
    */
   getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {
-    return this.performanceMetrics
-      .filter((m) => m.retryCount > 0)
-      .sort((a, b) => b.retryCount - a.retryCount)
-      .slice(0, count);
+    return this.performanceMetrics.filter(m => m.retryCount > 0).sort((a, b) => b.retryCount - a.retryCount);
   }
 

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:1424:12
    * Get operations with most retries
    */
   getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {
-    return this.performanceMetrics
-      .filter((m) => m.retryCount > 0)
-      .sort((a, b) => b.retryCount - a.retryCount)
+    return this.performanceMetrics.filter(m => m.retryCount > 0)
       .slice(0, count);
   }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1425:22
    */
   getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {
     return this.performanceMetrics
-      .filter((m) => m.retryCount > 0)
+      .filter((m) => false)
       .sort((a, b) => b.retryCount - a.retryCount)
       .slice(0, count);

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:1425:15
    */
   getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {
     return this.performanceMetrics
-      .filter((m) => m.retryCount > 0)
+      .filter(() => undefined)
       .sort((a, b) => b.retryCount - a.retryCount)
       .slice(0, count);

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:1426:13
   getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {
     return this.performanceMetrics
       .filter((m) => m.retryCount > 0)
-      .sort((a, b) => b.retryCount - a.retryCount)
+      .sort(() => undefined)
       .slice(0, count);
   }

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1426:23
   getOperationsWithMostRetries(count = 5): PerformanceMetrics[] {
     return this.performanceMetrics
       .filter((m) => m.retryCount > 0)
-      .sort((a, b) => b.retryCount - a.retryCount)
+      .sort((a, b) => b.retryCount + a.retryCount)
       .slice(0, count);
   }

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1446:20
 - Total Operations: ${metrics.totalTests}
 - Successful: ${metrics.passedTests}
 - Failed: ${metrics.failedTests}
-- Success Rate: ${((metrics.passedTests / metrics.totalTests) * 100).toFixed(2)}%
+- Success Rate: ${(metrics.passedTests / metrics.totalTests / 100).toFixed(2)}%
 - Error Rate: ${metrics.errorRate.toFixed(2)}%
 - Retry Rate: ${metrics.retryRate.toFixed(2)}%

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1446:21
 - Total Operations: ${metrics.totalTests}
 - Successful: ${metrics.passedTests}
 - Failed: ${metrics.failedTests}
-- Success Rate: ${((metrics.passedTests / metrics.totalTests) * 100).toFixed(2)}%
+- Success Rate: ${((metrics.passedTests * metrics.totalTests) * 100).toFixed(2)}%
 - Error Rate: ${metrics.errorRate.toFixed(2)}%
 - Retry Rate: ${metrics.retryRate.toFixed(2)}%

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:1453:24
 Timing Metrics:
 - Total Execution Time: ${metrics.totalExecutionTime}ms
 - Average Execution Time: ${metrics.averageExecutionTime.toFixed(2)}ms
-- Fastest Operation: ${metrics.fastestOperation?.operationName} (${metrics.fastestOperation?.duration}ms)
+- Fastest Operation: ${metrics.fastestOperation.operationName} (${metrics.fastestOperation?.duration}ms)
 - Slowest Operation: ${metrics.slowestOperation?.operationName} (${metrics.slowestOperation?.duration}ms)
 

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:1453:68
 Timing Metrics:
 - Total Execution Time: ${metrics.totalExecutionTime}ms
 - Average Execution Time: ${metrics.averageExecutionTime.toFixed(2)}ms
-- Fastest Operation: ${metrics.fastestOperation?.operationName} (${metrics.fastestOperation?.duration}ms)
+- Fastest Operation: ${metrics.fastestOperation?.operationName} (${metrics.fastestOperation.duration}ms)
 - Slowest Operation: ${metrics.slowestOperation?.operationName} (${metrics.slowestOperation?.duration}ms)
 

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:1454:24
 - Total Execution Time: ${metrics.totalExecutionTime}ms
 - Average Execution Time: ${metrics.averageExecutionTime.toFixed(2)}ms
 - Fastest Operation: ${metrics.fastestOperation?.operationName} (${metrics.fastestOperation?.duration}ms)
-- Slowest Operation: ${metrics.slowestOperation?.operationName} (${metrics.slowestOperation?.duration}ms)
+- Slowest Operation: ${metrics.slowestOperation.operationName} (${metrics.slowestOperation?.duration}ms)
 
 Slowest Operations:

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:1454:68
 - Total Execution Time: ${metrics.totalExecutionTime}ms
 - Average Execution Time: ${metrics.averageExecutionTime.toFixed(2)}ms
 - Fastest Operation: ${metrics.fastestOperation?.operationName} (${metrics.fastestOperation?.duration}ms)
-- Slowest Operation: ${metrics.slowestOperation?.operationName} (${metrics.slowestOperation?.duration}ms)
+- Slowest Operation: ${metrics.slowestOperation?.operationName} (${metrics.slowestOperation.duration}ms)
 
 Slowest Operations:

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:1457:18
 - Slowest Operation: ${metrics.slowestOperation?.operationName} (${metrics.slowestOperation?.duration}ms)
 
 Slowest Operations:
-${slowestOps.map((op) => `- ${op.operationName}: ${op.duration}ms (${op.retryCount} retries)`).join('\n')}
+${slowestOps.map(() => undefined).join('\n')}
 
 Operations with Most Retries:

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1457:101
 - Slowest Operation: ${metrics.slowestOperation?.operationName} (${metrics.slowestOperation?.duration}ms)
 
 Slowest Operations:
-${slowestOps.map((op) => `- ${op.operationName}: ${op.duration}ms (${op.retryCount} retries)`).join('\n')}
+${slowestOps.map((op) => `- ${op.operationName}: ${op.duration}ms (${op.retryCount} retries)`).join("")}
 
 Operations with Most Retries:

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:1460:19
 ${slowestOps.map((op) => `- ${op.operationName}: ${op.duration}ms (${op.retryCount} retries)`).join('\n')}
 
 Operations with Most Retries:
-${mostRetries.map((op) => `- ${op.operationName}: ${op.retryCount} retries (${op.duration}ms)`).join('\n')}
+${mostRetries.map(() => undefined).join('\n')}
 
 Service Breakdown:

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1460:27
 ${slowestOps.map((op) => `- ${op.operationName}: ${op.duration}ms (${op.retryCount} retries)`).join('\n')}
 
 Operations with Most Retries:
-${mostRetries.map((op) => `- ${op.operationName}: ${op.retryCount} retries (${op.duration}ms)`).join('\n')}
+${mostRetries.map((op) => ``).join('\n')}
 
 Service Breakdown:

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1467:41
     `.trim();
   }
 
-  private getServiceBreakdown(): string {
-    const serviceMap = new Map<string, PerformanceMetrics[]>();
-
-    for (const metric of this.performanceMetrics) {
-      const existing = serviceMap.get(metric.awsService) || [];
-      existing.push(metric);
-      serviceMap.set(metric.awsService, existing);
-    }
-
-    return Array.from(serviceMap.entries())
-      .map(([service, metrics]) => {
-        const avgDuration =
-          metrics.reduce((sum, m) => sum + m.duration, 0) / metrics.length;
-        const successRate =
-          (metrics.filter((m) => m.success).length / metrics.length) * 100;
-        return `- ${service}: ${metrics.length} operations, ${avgDuration.toFixed(2)}ms avg, ${successRate.toFixed(2)}% success`;
-      })
-      .join('\n');
-  }
+  private getServiceBreakdown(): string {}
 
   /**

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1470:51
   private getServiceBreakdown(): string {
     const serviceMap = new Map<string, PerformanceMetrics[]>();
 
-    for (const metric of this.performanceMetrics) {
-      const existing = serviceMap.get(metric.awsService) || [];
-      existing.push(metric);
-      serviceMap.set(metric.awsService, existing);
-    }
+    for (const metric of this.performanceMetrics) {}
 
     return Array.from(serviceMap.entries())

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:1471:24
     const serviceMap = new Map<string, PerformanceMetrics[]>();
 
     for (const metric of this.performanceMetrics) {
-      const existing = serviceMap.get(metric.awsService) || [];
+      const existing = serviceMap.get(metric.awsService) && [];
       existing.push(metric);
       serviceMap.set(metric.awsService, existing);

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1471:24
     const serviceMap = new Map<string, PerformanceMetrics[]>();
 
     for (const metric of this.performanceMetrics) {
-      const existing = serviceMap.get(metric.awsService) || [];
+      const existing = true;
       existing.push(metric);
       serviceMap.set(metric.awsService, existing);

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1477:36
     }
 
     return Array.from(serviceMap.entries())
-      .map(([service, metrics]) => {
-        const avgDuration =
-          metrics.reduce((sum, m) => sum + m.duration, 0) / metrics.length;
-        const successRate =
-          (metrics.filter((m) => m.success).length / metrics.length) * 100;
-        return `- ${service}: ${metrics.length} operations, ${avgDuration.toFixed(2)}ms avg, ${successRate.toFixed(2)}% success`;
-      })
+      .map(([service, metrics]) => {})
       .join('\n');
   }

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1479:38
     return Array.from(serviceMap.entries())
       .map(([service, metrics]) => {
         const avgDuration =
-          metrics.reduce((sum, m) => sum + m.duration, 0) / metrics.length;
+          metrics.reduce((sum, m) => sum - m.duration, 0) / metrics.length;
         const successRate =
           (metrics.filter((m) => m.success).length / metrics.length) * 100;

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1479:11
     return Array.from(serviceMap.entries())
       .map(([service, metrics]) => {
         const avgDuration =
-          metrics.reduce((sum, m) => sum + m.duration, 0) / metrics.length;
+          metrics.reduce((sum, m) => sum + m.duration, 0) * metrics.length;
         const successRate =
           (metrics.filter((m) => m.success).length / metrics.length) * 100;

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1481:12
         const avgDuration =
           metrics.reduce((sum, m) => sum + m.duration, 0) / metrics.length;
         const successRate =
-          (metrics.filter((m) => m.success).length / metrics.length) * 100;
+          (metrics.filter(m => m.success).length * metrics.length) * 100;
         return `- ${service}: ${metrics.length} operations, ${avgDuration.toFixed(2)}ms avg, ${successRate.toFixed(2)}% success`;
       })

[Survived] MethodExpression
src/framework/AWSTestingFramework.ts:1481:12
         const avgDuration =
           metrics.reduce((sum, m) => sum + m.duration, 0) / metrics.length;
         const successRate =
-          (metrics.filter((m) => m.success).length / metrics.length) * 100;
+          (metrics.length / metrics.length) * 100;
         return `- ${service}: ${metrics.length} operations, ${avgDuration.toFixed(2)}ms avg, ${successRate.toFixed(2)}% success`;
       })

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1490:33
   /**
    * Get current step context
    */
-  getStepContext(): StepContext {
-    return { ...this.stepContext };
-  }
+  getStepContext(): StepContext {}
 
   /**

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1500:11
   setStepContext<K extends keyof StepContext>(
     key: K,
     value: StepContext[K]
-  ): void {
-    this.stepContext[key] = value;
-    this.log('debug', `Set step context ${String(key)}: ${value}`);
-  }
+  ): void {}
 
   /**

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1502:23
     value: StepContext[K]
   ): void {
     this.stepContext[key] = value;
-    this.log('debug', `Set step context ${String(key)}: ${value}`);
+    this.log('debug', ``);
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1510:33
    */
   getStepContextValue<K extends keyof StepContext>(
     key: K
-  ): StepContext[K] | undefined {
-    return this.stepContext[key];
-  }
+  ): StepContext[K] | undefined {}
 
   /**

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1517:28
   /**
    * Clear step context
    */
-  clearStepContext(): void {
-    this.stepContext = {};
-    this.log('debug', 'Cleared step context');
-  }
+  clearStepContext(): void {}
 
   /**

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1519:14
    */
   clearStepContext(): void {
     this.stepContext = {};
-    this.log('debug', 'Cleared step context');
+    this.log("", 'Cleared step context');
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1525:68
   /**
    * Clear specific step context value
    */
-  clearStepContextValue<K extends keyof StepContext>(key: K): void {
-    delete this.stepContext[key];
-    this.log('debug', `Cleared step context ${String(key)}`);
-  }
+  clearStepContextValue<K extends keyof StepContext>(key: K): void {}
 
   /**

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1527:23
    */
   clearStepContextValue<K extends keyof StepContext>(key: K): void {
     delete this.stepContext[key];
-    this.log('debug', `Cleared step context ${String(key)}`);
+    this.log('debug', ``);
   }
 

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1527:14
    */
   clearStepContextValue<K extends keyof StepContext>(key: K): void {
     delete this.stepContext[key];
-    this.log('debug', `Cleared step context ${String(key)}`);
+    this.log("", `Cleared step context ${String(key)}`);
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1533:69
   /**
    * Check if step context has a specific value
    */
-  hasStepContextValue<K extends keyof StepContext>(key: K): boolean {
-    return this.stepContext[key] !== undefined;
-  }
+  hasStepContextValue<K extends keyof StepContext>(key: K): boolean {}
 
   /**

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1534:12
    * Check if step context has a specific value
    */
   hasStepContextValue<K extends keyof StepContext>(key: K): boolean {
-    return this.stepContext[key] !== undefined;
+    return this.stepContext[key] === undefined;
   }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1534:12
    * Check if step context has a specific value
    */
   hasStepContextValue<K extends keyof StepContext>(key: K): boolean {
-    return this.stepContext[key] !== undefined;
+    return true;
   }
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1544:5
     isValid: boolean;
     missingKeys: (keyof StepContext)[];
     presentKeys: (keyof StepContext)[];
-  } {
-    const missingKeys: (keyof StepContext)[] = [];
-    const presentKeys: (keyof StepContext)[] = [];
-
-    for (const key of requiredKeys) {
-      if (this.stepContext[key] !== undefined) {
-        presentKeys.push(key);
-      } else {
-        missingKeys.push(key);
-      }
-    }
-
-    return {
-      isValid: missingKeys.length === 0,
-      missingKeys,
-      presentKeys,
-    };
-  }
+  } {}
 
   /**

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1548:37
     const missingKeys: (keyof StepContext)[] = [];
     const presentKeys: (keyof StepContext)[] = [];
 
-    for (const key of requiredKeys) {
-      if (this.stepContext[key] !== undefined) {
-        presentKeys.push(key);
-      } else {
-        missingKeys.push(key);
-      }
-    }
+    for (const key of requiredKeys) {}
 
     return {

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1549:11
     const presentKeys: (keyof StepContext)[] = [];
 
     for (const key of requiredKeys) {
-      if (this.stepContext[key] !== undefined) {
+      if (true) {
         presentKeys.push(key);
       } else {

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:1549:11
     const presentKeys: (keyof StepContext)[] = [];
 
     for (const key of requiredKeys) {
-      if (this.stepContext[key] !== undefined) {
+      if (this.stepContext[key] === undefined) {
         presentKeys.push(key);
       } else {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1551:14
     for (const key of requiredKeys) {
       if (this.stepContext[key] !== undefined) {
         presentKeys.push(key);
-      } else {
-        missingKeys.push(key);
-      }
+      } else {}
     }
 

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:1556:12
       }
     }
 
-    return {
-      isValid: missingKeys.length === 0,
-      missingKeys,
-      presentKeys,
-    };
+    return {};
   }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1557:16
     }
 
     return {
-      isValid: missingKeys.length === 0,
+      isValid: false,
       missingKeys,
       presentKeys,

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:1557:16
     }
 
     return {
-      isValid: missingKeys.length === 0,
+      isValid: true,
       missingKeys,
       presentKeys,

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1581:11
     const errors: string[] = [];
     const warnings: string[] = [];
     const services = {
-      s3: false,
+      s3: true,
       sqs: false,
       lambda: false,

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1582:12
     const warnings: string[] = [];
     const services = {
       s3: false,
-      sqs: false,
+      sqs: true,
       lambda: false,
       stepFunctions: false,

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1583:15
     const services = {
       s3: false,
       sqs: false,
-      lambda: false,
+      lambda: true,
       stepFunctions: false,
       cloudWatch: false,

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1584:22
       s3: false,
       sqs: false,
       lambda: false,
-      stepFunctions: false,
+      stepFunctions: true,
       cloudWatch: false,
     };

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1585:19
       sqs: false,
       lambda: false,
       stepFunctions: false,
-      cloudWatch: false,
+      cloudWatch: true,
     };
 

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1590:11
 
     try {
       // Test S3 access
-      try {
-        await this.s3Client.send(new ListBucketsCommand({}));
-        services.s3 = true;
-      } catch (error) {
+      try {} catch (error) {
         errors.push(
           `S3 access failed: ${error instanceof Error ? error.message : String(error)}`

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1592:23
       // Test S3 access
       try {
         await this.s3Client.send(new ListBucketsCommand({}));
-        services.s3 = true;
+        services.s3 = false;
       } catch (error) {
         errors.push(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1593:23
       try {
         await this.s3Client.send(new ListBucketsCommand({}));
         services.s3 = true;
-      } catch (error) {
-        errors.push(
-          `S3 access failed: ${error instanceof Error ? error.message : String(error)}`
-        );
-      }
+      } catch (error) {}
 
       // Test SQS access

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1595:11
         services.s3 = true;
       } catch (error) {
         errors.push(
-          `S3 access failed: ${error instanceof Error ? error.message : String(error)}`
+          ``
         );
       }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1600:11
       }
 
       // Test SQS access
-      try {
-        await this.sqsClient.send(new ListQueuesCommand({}));
-        services.sqs = true;
-      } catch (error) {
+      try {} catch (error) {
         errors.push(
           `SQS access failed: ${error instanceof Error ? error.message : String(error)}`

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1602:24
       // Test SQS access
       try {
         await this.sqsClient.send(new ListQueuesCommand({}));
-        services.sqs = true;
+        services.sqs = false;
       } catch (error) {
         errors.push(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1603:23
       try {
         await this.sqsClient.send(new ListQueuesCommand({}));
         services.sqs = true;
-      } catch (error) {
-        errors.push(
-          `SQS access failed: ${error instanceof Error ? error.message : String(error)}`
-        );
-      }
+      } catch (error) {}
 
       // Test Lambda access

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1610:11
       }
 
       // Test Lambda access
-      try {
-        await this.lambdaClient.send(new ListFunctionsCommand({}));
-        services.lambda = true;
-      } catch (error) {
+      try {} catch (error) {
         errors.push(
           `Lambda access failed: ${error instanceof Error ? error.message : String(error)}`

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1612:27
       // Test Lambda access
       try {
         await this.lambdaClient.send(new ListFunctionsCommand({}));
-        services.lambda = true;
+        services.lambda = false;
       } catch (error) {
         errors.push(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1613:23
       try {
         await this.lambdaClient.send(new ListFunctionsCommand({}));
         services.lambda = true;
-      } catch (error) {
-        errors.push(
-          `Lambda access failed: ${error instanceof Error ? error.message : String(error)}`
-        );
-      }
+      } catch (error) {}
 
       // Test Step Functions access

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1615:11
         services.lambda = true;
       } catch (error) {
         errors.push(
-          `Lambda access failed: ${error instanceof Error ? error.message : String(error)}`
+          ``
         );
       }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1620:11
       }
 
       // Test Step Functions access
-      try {
-        await this.sfnClient.send(new ListStateMachinesCommand({}));
-        services.stepFunctions = true;
-      } catch (error) {
+      try {} catch (error) {
         errors.push(
           `Step Functions access failed: ${error instanceof Error ? error.message : String(error)}`

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1622:34
       // Test Step Functions access
       try {
         await this.sfnClient.send(new ListStateMachinesCommand({}));
-        services.stepFunctions = true;
+        services.stepFunctions = false;
       } catch (error) {
         errors.push(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1623:23
       try {
         await this.sfnClient.send(new ListStateMachinesCommand({}));
         services.stepFunctions = true;
-      } catch (error) {
-        errors.push(
-          `Step Functions access failed: ${error instanceof Error ? error.message : String(error)}`
-        );
-      }
+      } catch (error) {}
 
       // Test CloudWatch access

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1625:11
         services.stepFunctions = true;
       } catch (error) {
         errors.push(
-          `Step Functions access failed: ${error instanceof Error ? error.message : String(error)}`
+          ``
         );
       }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1630:11
       }
 
       // Test CloudWatch access
-      try {
-        await this.cloudWatchLogsClient.send(
-          new FilterLogEventsCommand({
-            logGroupName: '/aws/lambda/test',
-            startTime: Date.now() - 60000,
-            endTime: Date.now(),
-          })
-        );
-        services.cloudWatch = true;
-      } catch (error) {
+      try {} catch (error) {
         warnings.push(
           `CloudWatch access failed: ${error instanceof Error ? error.message : String(error)}`

[Survived] ArithmeticOperator
src/framework/AWSTestingFramework.ts:1634:24
         await this.cloudWatchLogsClient.send(
           new FilterLogEventsCommand({
             logGroupName: '/aws/lambda/test',
-            startTime: Date.now() - 60000,
+            startTime: Date.now() + 60000,
             endTime: Date.now(),
           })

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:1638:31
             endTime: Date.now(),
           })
         );
-        services.cloudWatch = true;
+        services.cloudWatch = false;
       } catch (error) {
         warnings.push(

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1639:23
           })
         );
         services.cloudWatch = true;
-      } catch (error) {
-        warnings.push(
-          `CloudWatch access failed: ${error instanceof Error ? error.message : String(error)}`
-        );
-      }
+      } catch (error) {}
     } catch (error) {
       errors.push(

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:1641:11
         services.cloudWatch = true;
       } catch (error) {
         warnings.push(
-          `CloudWatch access failed: ${error instanceof Error ? error.message : String(error)}`
+          ``
         );
       }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:1644:21
           `CloudWatch access failed: ${error instanceof Error ? error.message : String(error)}`
         );
       }
-    } catch (error) {
-      errors.push(
-        `AWS setup validation failed: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
+    } catch (error) {}
 
     return {

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:1650:12
       );
     }
 
-    return {
-      isValid: errors.length === 0,
-      errors,
-      warnings,
-      services,
-    };
+    return {};
   }
 }
