[Timeout] BlockStatement
src/reporting/CustomFormatter.ts:7:68
 export default class CustomFormatter extends Formatter {
   private reporter: TestReporter;
 
-  constructor(options: IFormatterOptions, reporter?: TestReporter) {
-    super(options);
-    this.reporter = reporter ?? new TestReporter();
-  }
+  constructor(options: IFormatterOptions, reporter?: TestReporter) {}
 
   onTestRunFinished(options: IFormatterOptions) {

[Timeout] LogicalOperator
src/reporting/CustomFormatter.ts:9:21
 
   constructor(options: IFormatterOptions, reporter?: TestReporter) {
     super(options);
-    this.reporter = reporter ?? new TestReporter();
+    this.reporter = reporter && new TestReporter();
   }
 

[Timeout] BlockStatement
src/reporting/CustomFormatter.ts:12:49
     this.reporter = reporter ?? new TestReporter();
   }
 
-  onTestRunFinished(options: IFormatterOptions) {
-    this.reporter.onTestRunFinished(options);
-  }
+  onTestRunFinished(options: IFormatterOptions) {}
 
   onFeatureStarted(feature: { name: string }) {

[Timeout] BlockStatement
src/reporting/CustomFormatter.ts:16:47
     this.reporter.onTestRunFinished(options);
   }
 
-  onFeatureStarted(feature: { name: string }) {
-    this.reporter.onFeatureStarted(feature);
-  }
+  onFeatureStarted(feature: { name: string }) {}
 
   onScenarioStarted(scenario: { name: string }) {

[Timeout] BlockStatement
src/reporting/CustomFormatter.ts:20:49
     this.reporter.onFeatureStarted(feature);
   }
 
-  onScenarioStarted(scenario: { name: string }) {
-    this.reporter.onScenarioStarted(scenario);
-  }
+  onScenarioStarted(scenario: { name: string }) {}
 
   onScenarioFinished(

[Timeout] BlockStatement
src/reporting/CustomFormatter.ts:27:5
   onScenarioFinished(
     scenario: { name: string },
     result: { status: string; duration: number }
-  ) {
-    this.reporter.onScenarioFinished(scenario, result);
-  }
+  ) {}
 
   onStepFinished(

[Timeout] BlockStatement
src/reporting/CustomFormatter.ts:34:5
   onStepFinished(
     step: { text: string },
     result: { status: string; duration: number; error?: string }
-  ) {
-    this.reporter.onStepFinished(step, result);
-  }
+  ) {}
 }
 
