[Timeout] ArrayDeclaration
src/reporting/TestReporter.ts:36:44
 }
 
 export class TestReporter {
-  private results: TestReporterResults[] = [];
+  private results: TestReporterResults[] = ["Stryker was here"];
   private currentFeature: TestReporterResults | null = null;
 

[Timeout] BlockStatement
src/reporting/TestReporter.ts:39:42
   private results: TestReporterResults[] = [];
   private currentFeature: TestReporterResults | null = null;
 
-  onFeatureStarted(feature: TestFeature) {
-    this.currentFeature = {
-      feature: feature.name,
-      scenarios: [],
-    };
-    this.results.push(this.currentFeature);
-  }
+  onFeatureStarted(feature: TestFeature) {}
 
   onScenarioStarted(scenario: TestScenario) {

[Timeout] ObjectLiteral
src/reporting/TestReporter.ts:40:27
   private currentFeature: TestReporterResults | null = null;
 
   onFeatureStarted(feature: TestFeature) {
-    this.currentFeature = {
-      feature: feature.name,
-      scenarios: [],
-    };
+    this.currentFeature = {};
     this.results.push(this.currentFeature);
   }

[Timeout] ArrayDeclaration
src/reporting/TestReporter.ts:42:18
   onFeatureStarted(feature: TestFeature) {
     this.currentFeature = {
       feature: feature.name,
-      scenarios: [],
+      scenarios: ["Stryker was here"],
     };
     this.results.push(this.currentFeature);

[Killed] BlockStatement
src/reporting/TestReporter.ts:47:45
     this.results.push(this.currentFeature);
   }
 
-  onScenarioStarted(scenario: TestScenario) {
-    if (!this.currentFeature) {
-      throw new Error('No feature started');
-    }
-    this.currentFeature.scenarios.push({
-      name: scenario.name,
-      status: 'skipped',
-      steps: [],
-    });
-  }
+  onScenarioStarted(scenario: TestScenario) {}
 
   onStepFinished(step: TestStep, result: TestResult) {
killedBy: TestReporter onScenarioStarted should add scenario to current feature
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/reporting/TestReporter.ts:48:9
   }
 
   onScenarioStarted(scenario: TestScenario) {
-    if (!this.currentFeature) {
+    if (true) {
       throw new Error('No feature started');
     }
killedBy: TestReporter onScenarioStarted should add scenario to current feature
statusReason: Error: No feature started

[Killed] BooleanLiteral
src/reporting/TestReporter.ts:48:9
   }
 
   onScenarioStarted(scenario: TestScenario) {
-    if (!this.currentFeature) {
+    if (this.currentFeature) {
       throw new Error('No feature started');
     }
killedBy: TestReporter onScenarioStarted should add scenario to current feature
statusReason: Error: No feature started

[Killed] ObjectLiteral
src/reporting/TestReporter.ts:51:40
     if (!this.currentFeature) {
       throw new Error('No feature started');
     }
-    this.currentFeature.scenarios.push({
-      name: scenario.name,
-      status: 'skipped',
-      steps: [],
-    });
+    this.currentFeature.scenarios.push({});
   }
 
killedBy: TestReporter onScenarioStarted should add scenario to current feature
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test Scenario"
Received: undefined

[Killed] BlockStatement
src/reporting/TestReporter.ts:58:54
     });
   }
 
-  onStepFinished(step: TestStep, result: TestResult) {
-    if (!this.currentFeature) {
-      throw new Error('No feature started');
-    }
-    const currentScenario =
-      this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
-      throw new Error('No scenario started');
-    }
-    currentScenario.steps.push({
-      name: step.text,
-      status: result.status,
-      duration: result.duration,
-    });
-    currentScenario.status = result.status;
-  }
+  onStepFinished(step: TestStep, result: TestResult) {}
 
   onScenarioFinished(_scenario: TestScenario, result: TestResult) {
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BooleanLiteral
src/reporting/TestReporter.ts:59:9
   }
 
   onStepFinished(step: TestStep, result: TestResult) {
-    if (!this.currentFeature) {
+    if (this.currentFeature) {
       throw new Error('No feature started');
     }
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No feature started

[Killed] ConditionalExpression
src/reporting/TestReporter.ts:59:9
   }
 
   onStepFinished(step: TestStep, result: TestResult) {
-    if (!this.currentFeature) {
+    if (true) {
       throw new Error('No feature started');
     }
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No feature started

[Survived] StringLiteral
src/reporting/TestReporter.ts:60:23
 
   onStepFinished(step: TestStep, result: TestResult) {
     if (!this.currentFeature) {
-      throw new Error('No feature started');
+      throw new Error("");
     }
     const currentScenario =

[Killed] ArithmeticOperator
src/reporting/TestReporter.ts:63:37
       throw new Error('No feature started');
     }
     const currentScenario =
-      this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
+      this.currentFeature.scenarios[this.currentFeature.scenarios.length + 1];
     if (!currentScenario) {
       throw new Error('No scenario started');
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No scenario started

[Killed] ConditionalExpression
src/reporting/TestReporter.ts:64:9
     }
     const currentScenario =
       this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
+    if (true) {
       throw new Error('No scenario started');
     }
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No scenario started

[Killed] BooleanLiteral
src/reporting/TestReporter.ts:64:9
     }
     const currentScenario =
       this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
+    if (currentScenario) {
       throw new Error('No scenario started');
     }
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No scenario started

[Survived] StringLiteral
src/reporting/TestReporter.ts:65:23
     const currentScenario =
       this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
     if (!currentScenario) {
-      throw new Error('No scenario started');
+      throw new Error("");
     }
     currentScenario.steps.push({

[Survived] BlockStatement
src/reporting/TestReporter.ts:75:67
     currentScenario.status = result.status;
   }
 
-  onScenarioFinished(_scenario: TestScenario, result: TestResult) {
-    if (!this.currentFeature) {
-      throw new Error('No feature started');
-    }
-    const currentScenario =
-      this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
-      throw new Error('No scenario started');
-    }
-    currentScenario.status = result.status;
-  }
+  onScenarioFinished(_scenario: TestScenario, result: TestResult) {}
 
   onTestRunFinished(_options: unknown) {

[Survived] ConditionalExpression
src/reporting/TestReporter.ts:76:9
   }
 
   onScenarioFinished(_scenario: TestScenario, result: TestResult) {
-    if (!this.currentFeature) {
+    if (false) {
       throw new Error('No feature started');
     }

[Survived] BlockStatement
src/reporting/TestReporter.ts:76:31
   }
 
   onScenarioFinished(_scenario: TestScenario, result: TestResult) {
-    if (!this.currentFeature) {
-      throw new Error('No feature started');
-    }
+    if (!this.currentFeature) {}
     const currentScenario =
       this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];

[Survived] BlockStatement
src/reporting/TestReporter.ts:81:27
     }
     const currentScenario =
       this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
-      throw new Error('No scenario started');
-    }
+    if (!currentScenario) {}
     currentScenario.status = result.status;
   }

[Killed] BooleanLiteral
src/reporting/TestReporter.ts:89:47
 
   onTestRunFinished(_options: unknown) {
     // Create test-reports directory if it doesn't exist
-    fs.mkdirSync('test-reports', { recursive: true });
+    fs.mkdirSync('test-reports', { recursive: false });
 
     // Write JSON report
killedBy: TestReporter onTestRunFinished should generate reports
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "test-reports",
  Object {
-   "recursive": true,

[Killed] StringLiteral
src/reporting/TestReporter.ts:89:18
 
   onTestRunFinished(_options: unknown) {
     // Create test-reports directory if it doesn't exist
-    fs.mkdirSync('test-reports', { recursive: true });
+    fs.mkdirSync("", { recursive: true });
 
     // Write JSON report
killedBy: TestReporter onTestRunFinished should generate reports
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "test-reports",
+ "",
  {"recursive": true},

[Survived] ObjectLiteral
src/reporting/TestReporter.ts:93:16
 
     // Write JSON report
     const jsonReport = {
-      summary: {
-        total: this.results.reduce(
-          (acc, feature) => acc + feature.scenarios.length,
-          0
-        ),
-        passed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed')
-              .length,
-          0
-        ),
-        failed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed')
-              .length,
-          0
-        ),
-      },
+      summary: {},
       features: this.results,
     };

[Survived] ArrowFunction
src/reporting/TestReporter.ts:95:11
     const jsonReport = {
       summary: {
         total: this.results.reduce(
-          (acc, feature) => acc + feature.scenarios.length,
+          () => undefined,
           0
         ),

[Survived] ArithmeticOperator
src/reporting/TestReporter.ts:95:29
     const jsonReport = {
       summary: {
         total: this.results.reduce(
-          (acc, feature) => acc + feature.scenarios.length,
+          (acc, feature) => acc - feature.scenarios.length,
           0
         ),

[Survived] ArrowFunction
src/reporting/TestReporter.ts:99:11
           0
         ),
         passed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed')
-              .length,
+          () => undefined,
           0
         ),

[Survived] ArithmeticOperator
src/reporting/TestReporter.ts:100:13
         ),
         passed: this.results.reduce(
           (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed')
-              .length,
+            acc - feature.scenarios.filter(scenario => scenario.status === 'passed').length,
           0
         ),

[Survived] ConditionalExpression
src/reporting/TestReporter.ts:101:52
         passed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed')
+            feature.scenarios.filter((scenario) => true)
               .length,
           0

[Survived] EqualityOperator
src/reporting/TestReporter.ts:101:52
         passed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed')
+            feature.scenarios.filter((scenario) => scenario.status !== 'passed')
               .length,
           0

[Survived] ArrowFunction
src/reporting/TestReporter.ts:106:11
           0
         ),
         failed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed')
-              .length,
+          () => undefined,
           0
         ),

[Survived] ArithmeticOperator
src/reporting/TestReporter.ts:107:13
         ),
         failed: this.results.reduce(
           (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed')
-              .length,
+            acc - feature.scenarios.filter(scenario => scenario.status === 'failed').length,
           0
         ),

[Survived] ConditionalExpression
src/reporting/TestReporter.ts:108:52
         failed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed')
+            feature.scenarios.filter((scenario) => true)
               .length,
           0

[Survived] ConditionalExpression
src/reporting/TestReporter.ts:108:52
         failed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed')
+            feature.scenarios.filter((scenario) => false)
               .length,
           0

[Killed] StringLiteral
src/reporting/TestReporter.ts:117:28
     };
 
     fs.writeFileSync(
-      join('test-reports', 'cucumber-report.json'),
+      join('test-reports', ""),
       JSON.stringify(jsonReport, null, 2)
     );
killedBy: TestReporter onTestRunFinished should generate reports
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports/cucumber-report.json", StringContaining "Test Feature"
Received
       1: "test-reports/", "{
  \"summary\": {
    \"total\": 1,
    \"passed\": 1,

[Killed] StringLiteral
src/reporting/TestReporter.ts:123:27
 
     // Generate and write HTML report
     const htmlReport = generateHtmlReport(this.results);
-    fs.writeFileSync(join('test-reports', 'report.html'), htmlReport);
+    fs.writeFileSync(join("", 'report.html'), htmlReport);
   }
 }
killedBy: TestReporter onTestRunFinished should generate reports
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports/report.html", StringContaining "Test Feature"
Received
       1: "test-reports/cucumber-report.json", "{
  \"summary\": {
    \"total\": 1,
    \"passed\": 1,
