[Killed] BlockStatement
src/reporting/generateReport.ts:42:26
 
 function convertCucumberReportToResults(
   report: CucumberFeature[]
-): TestReporterResults[] {
-  return report.map((feature) => ({
-    feature: feature.name,
-    scenarios: feature.elements.map((scenario) => ({
-      name: scenario.name,
-      status: scenario.steps.every((step) => step.result.status === 'passed')
-        ? 'passed'
-        : scenario.steps.some((step) => step.result.status === 'failed')
-          ? 'failed'
-          : 'pending',
-      steps: scenario.steps.map((step) => ({
-        name: `${step.keyword} ${step.name}`,
-        status: step.result.status,
-        duration: step.result.duration,
-        error: step.result.error_message,
-      })),
-    })),
-  }));
-}
+): TestReporterResults[] {}
 
 export function generateHtmlReport(results: TestReporterResults[]): string {
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"
Received: "coverage/functional-tests/report.html", "
      <!DOCTYPE html>
      <html>
        <head>
          <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:43:21
 function convertCucumberReportToResults(
   report: CucumberFeature[]
 ): TestReporterResults[] {
-  return report.map((feature) => ({
-    feature: feature.name,
-    scenarios: feature.elements.map((scenario) => ({
-      name: scenario.name,
-      status: scenario.steps.every((step) => step.result.status === 'passed')
-        ? 'passed'
-        : scenario.steps.some((step) => step.result.status === 'failed')
-          ? 'failed'
-          : 'pending',
-      steps: scenario.steps.map((step) => ({
-        name: `${step.keyword} ${step.name}`,
-        status: step.result.status,
-        duration: step.result.duration,
-        error: step.result.error_message,
-      })),
-    })),
-  }));
+  return report.map(() => undefined);
 }
 
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"

Number of calls: 0

[Killed] ArrowFunction
src/reporting/generateReport.ts:45:37
 ): TestReporterResults[] {
   return report.map((feature) => ({
     feature: feature.name,
-    scenarios: feature.elements.map((scenario) => ({
-      name: scenario.name,
-      status: scenario.steps.every((step) => step.result.status === 'passed')
-        ? 'passed'
-        : scenario.steps.some((step) => step.result.status === 'failed')
-          ? 'failed'
-          : 'pending',
-      steps: scenario.steps.map((step) => ({
-        name: `${step.keyword} ${step.name}`,
-        status: step.result.status,
-        duration: step.result.duration,
-        error: step.result.error_message,
-      })),
-    })),
+    scenarios: feature.elements.map(() => undefined),
   }));
 }
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"

Number of calls: 0

[Killed] ObjectLiteral
src/reporting/generateReport.ts:45:52
 ): TestReporterResults[] {
   return report.map((feature) => ({
     feature: feature.name,
-    scenarios: feature.elements.map((scenario) => ({
-      name: scenario.name,
-      status: scenario.steps.every((step) => step.result.status === 'passed')
-        ? 'passed'
-        : scenario.steps.some((step) => step.result.status === 'failed')
-          ? 'failed'
-          : 'pending',
-      steps: scenario.steps.map((step) => ({
-        name: `${step.keyword} ${step.name}`,
-        status: step.result.status,
-        duration: step.result.duration,
-        error: step.result.error_message,
-      })),
-    })),
+    scenarios: feature.elements.map((scenario) => ({})),
   }));
 }
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"

Number of calls: 0

[Survived] ConditionalExpression
src/reporting/generateReport.ts:47:46
     feature: feature.name,
     scenarios: feature.elements.map((scenario) => ({
       name: scenario.name,
-      status: scenario.steps.every((step) => step.result.status === 'passed')
+      status: scenario.steps.every((step) => true)
         ? 'passed'
         : scenario.steps.some((step) => step.result.status === 'failed')

[Survived] MethodExpression
src/reporting/generateReport.ts:47:15
     feature: feature.name,
     scenarios: feature.elements.map((scenario) => ({
       name: scenario.name,
-      status: scenario.steps.every((step) => step.result.status === 'passed')
+      status: scenario.steps.some(step => step.result.status === 'passed')
         ? 'passed'
         : scenario.steps.some((step) => step.result.status === 'failed')

[Survived] StringLiteral
src/reporting/generateReport.ts:48:11
     scenarios: feature.elements.map((scenario) => ({
       name: scenario.name,
       status: scenario.steps.every((step) => step.result.status === 'passed')
-        ? 'passed'
+        ? ""
         : scenario.steps.some((step) => step.result.status === 'failed')
           ? 'failed'

[Survived] EqualityOperator
src/reporting/generateReport.ts:49:41
       name: scenario.name,
       status: scenario.steps.every((step) => step.result.status === 'passed')
         ? 'passed'
-        : scenario.steps.some((step) => step.result.status === 'failed')
+        : scenario.steps.some((step) => step.result.status !== 'failed')
           ? 'failed'
           : 'pending',

[Survived] MethodExpression
src/reporting/generateReport.ts:49:11
       name: scenario.name,
       status: scenario.steps.every((step) => step.result.status === 'passed')
         ? 'passed'
-        : scenario.steps.some((step) => step.result.status === 'failed')
+        : scenario.steps.every(step => step.result.status === 'failed')
           ? 'failed'
           : 'pending',

[Survived] StringLiteral
src/reporting/generateReport.ts:51:13
         ? 'passed'
         : scenario.steps.some((step) => step.result.status === 'failed')
           ? 'failed'
-          : 'pending',
+          : "",
       steps: scenario.steps.map((step) => ({
         name: `${step.keyword} ${step.name}`,

[Killed] ArrowFunction
src/reporting/generateReport.ts:52:33
         : scenario.steps.some((step) => step.result.status === 'failed')
           ? 'failed'
           : 'pending',
-      steps: scenario.steps.map((step) => ({
-        name: `${step.keyword} ${step.name}`,
-        status: step.result.status,
-        duration: step.result.duration,
-        error: step.result.error_message,
-      })),
+      steps: scenario.steps.map(() => undefined),
     })),
   }));
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"

Number of calls: 0

[Survived] StringLiteral
src/reporting/generateReport.ts:53:15
           ? 'failed'
           : 'pending',
       steps: scenario.steps.map((step) => ({
-        name: `${step.keyword} ${step.name}`,
+        name: ``,
         status: step.result.status,
         duration: step.result.duration,

[Killed] ConditionalExpression
src/reporting/generateReport.ts:63:19
 }
 
 export function generateHtmlReport(results: TestReporterResults[]): string {
-  if (!results || results.length === 0) {
+  if (!results || false) {
     return `
       <!DOCTYPE html>
killedBy: generateReport generateHtmlReport should generate HTML report for empty report
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "No test results found"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] BooleanLiteral
src/reporting/generateReport.ts:63:7
 }
 
 export function generateHtmlReport(results: TestReporterResults[]): string {
-  if (!results || results.length === 0) {
+  if (results || results.length === 0) {
     return `
       <!DOCTYPE html>
killedBy: generateReport generateHtmlReport should generate HTML report with test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Feature"
Received string:    "
      <!DOCTYPE html>
      <html>
        <head>
          <title>Test Report</title>

[Killed] StringLiteral
src/reporting/generateReport.ts:64:12
 
 export function generateHtmlReport(results: TestReporterResults[]): string {
   if (!results || results.length === 0) {
-    return `
-      <!DOCTYPE html>
-      <html>
-        <head>
-          <title>Test Report</title>
-          <style>
-            body { font-family: Arial, sans-serif; margin: 20px; }
-            .feature { margin-bottom: 20px; }
-            .scenario { margin: 10px 0; padding: 10px; border: 1px solid #ccc; }
-            .step { margin: 5px 0; padding: 5px; }
-            .passed { background-color: #dff0d8; }
-            .failed { background-color: #f2dede; }
-            .pending { background-color: #fcf8e3; }
-            .error { color: #a94442; font-family: monospace; white-space: pre-wrap; }
-          </style>
-        </head>
-        <body>
-          <h1>Test Report</h1>
-          <div class="features">
-            <p>No test results found</p>
-          </div>
-        </body>
-      </html>
-    `;
+    return ``;
   }
 
killedBy: generateReport generateHtmlReport should generate HTML report for empty report
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "No test results found"
Received string:    ""

[Killed] ArithmeticOperator
src/reporting/generateReport.ts:91:23
   }
 
   const totalScenarios = results.reduce(
-    (acc, feature) => acc + feature.scenarios.length,
+    (acc, feature) => acc - feature.scenarios.length,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Total Scenarios: 3"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:91:5
   }
 
   const totalScenarios = results.reduce(
-    (acc, feature) => acc + feature.scenarios.length,
+    () => undefined,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Total Scenarios: 3"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:95:5
     0
   );
   const passedScenarios = results.reduce(
-    (acc, feature) =>
-      acc +
-      feature.scenarios.filter((scenario) => scenario.status === 'passed')
-        .length,
+    () => undefined,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Passed: 2"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] MethodExpression
src/reporting/generateReport.ts:97:7
   const passedScenarios = results.reduce(
     (acc, feature) =>
       acc +
-      feature.scenarios.filter((scenario) => scenario.status === 'passed')
+      feature.scenarios
         .length,
     0
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Passed: 2"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:97:32
   const passedScenarios = results.reduce(
     (acc, feature) =>
       acc +
-      feature.scenarios.filter((scenario) => scenario.status === 'passed')
+      feature.scenarios.filter(() => undefined)
         .length,
     0
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Passed: 2"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:102:5
     0
   );
   const failedScenarios = results.reduce(
-    (acc, feature) =>
-      acc +
-      feature.scenarios.filter((scenario) => scenario.status === 'failed')
-        .length,
+    () => undefined,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Failed: 1"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:141:19
               <h2>${feature.feature}</h2>
               ${feature.scenarios
                 .map(
-                  (scenario) => `
-                <div class="scenario ${scenario.status}">
-                  <h3>${scenario.name}</h3>
-                  <div class="steps">
-                    ${scenario.steps
-                      .map(
-                        (step) => `
-                      <div class="step ${step.status}">
-                        <p>${step.name}</p>
-                        <p>Duration: ${step.duration}ms</p>
-                        ${step.error ? `<p class="error">${step.error}</p>` : ''}
-                      </div>
-                    `
-                      )
-                      .join('')}
-                  </div>
-                </div>
-              `
+                  () => undefined
                 )
                 .join('')}
killedBy: generateReport generateHtmlReport should generate HTML report with test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Scenario"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:147:25
                   <div class="steps">
                     ${scenario.steps
                       .map(
-                        (step) => `
-                      <div class="step ${step.status}">
-                        <p>${step.name}</p>
-                        <p>Duration: ${step.duration}ms</p>
-                        ${step.error ? `<p class="error">${step.error}</p>` : ''}
-                      </div>
-                    `
+                        () => undefined
                       )
                       .join('')}
killedBy: generateReport generateHtmlReport should generate HTML report with test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Step"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] StringLiteral
src/reporting/generateReport.ts:147:35
                   <div class="steps">
                     ${scenario.steps
                       .map(
-                        (step) => `
-                      <div class="step ${step.status}">
-                        <p>${step.name}</p>
-                        <p>Duration: ${step.duration}ms</p>
-                        ${step.error ? `<p class="error">${step.error}</p>` : ''}
-                      </div>
-                    `
+                        (step) => ``
                       )
                       .join('')}
killedBy: generateReport generateHtmlReport should generate HTML report with test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Step"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ConditionalExpression
src/reporting/generateReport.ts:173:7
 
 export function main() {
   // Create coverage/functional-tests directory if it doesn't exist
-  if (!existsSync('coverage/functional-tests')) {
+  if (false) {
     mkdirSync('coverage/functional-tests', { recursive: true });
   }
killedBy: generateReport file operations should create coverage/functional-tests directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests", {"recursive": true}

Number of calls: 0

[Killed] BlockStatement
src/reporting/generateReport.ts:173:49
 
 export function main() {
   // Create coverage/functional-tests directory if it doesn't exist
-  if (!existsSync('coverage/functional-tests')) {
-    mkdirSync('coverage/functional-tests', { recursive: true });
-  }
+  if (!existsSync('coverage/functional-tests')) {}
 
   const reportPath = join('coverage/functional-tests', 'cucumber-report.json');
killedBy: generateReport file operations should create coverage/functional-tests directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests", {"recursive": true}

Number of calls: 0

[Killed] BooleanLiteral
src/reporting/generateReport.ts:174:57
 export function main() {
   // Create coverage/functional-tests directory if it doesn't exist
   if (!existsSync('coverage/functional-tests')) {
-    mkdirSync('coverage/functional-tests', { recursive: true });
+    mkdirSync('coverage/functional-tests', { recursive: false });
   }
 
killedBy: generateReport file operations should create coverage/functional-tests directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "coverage/functional-tests",
  Object {
-   "recursive": true,

[Killed] StringLiteral
src/reporting/generateReport.ts:174:15
 export function main() {
   // Create coverage/functional-tests directory if it doesn't exist
   if (!existsSync('coverage/functional-tests')) {
-    mkdirSync('coverage/functional-tests', { recursive: true });
+    mkdirSync("", { recursive: true });
   }
 
killedBy: generateReport file operations should create coverage/functional-tests directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "coverage/functional-tests",
+ "",
  {"recursive": true},

[Killed] BlockStatement
src/reporting/generateReport.ts:178:32
   }
 
   const reportPath = join('coverage/functional-tests', 'cucumber-report.json');
-  if (!existsSync(reportPath)) {
-    console.error('Error: No test report found at', reportPath);
-    console.error('Please run the tests first to generate the report.');
-    process.exit(1);
-  }
+  if (!existsSync(reportPath)) {}
 
   try {
killedBy: generateReport file operations should handle missing report file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: No test report found at", "coverage/functional-tests/cucumber-report.json"
Received: "Error generating report:", [SyntaxError: "undefined" is not valid JSON]

Number of calls: 1

[Killed] BooleanLiteral
src/reporting/generateReport.ts:178:7
   }
 
   const reportPath = join('coverage/functional-tests', 'cucumber-report.json');
-  if (!existsSync(reportPath)) {
+  if (existsSync(reportPath)) {
     console.error('Error: No test report found at', reportPath);
     console.error('Please run the tests first to generate the report.');
killedBy: generateReport file operations should handle missing report file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: No test report found at", "coverage/functional-tests/cucumber-report.json"
Received: "Error generating report:", [SyntaxError: "undefined" is not valid JSON]

Number of calls: 1

[Killed] StringLiteral
src/reporting/generateReport.ts:179:19
 
   const reportPath = join('coverage/functional-tests', 'cucumber-report.json');
   if (!existsSync(reportPath)) {
-    console.error('Error: No test report found at', reportPath);
+    console.error("", reportPath);
     console.error('Please run the tests first to generate the report.');
     process.exit(1);
killedBy: generateReport file operations should handle missing report file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: No test report found at", "coverage/functional-tests/cucumber-report.json"
Received
       1: "", "coverage/functional-tests/cucumber-report.json"
       2: "Please run the tests first to generate the report."
       3: "Error generating report:", [SyntaxError: "undefined" is not valid JSON]

[Killed] BlockStatement
src/reporting/generateReport.ts:184:7
     process.exit(1);
   }
 
-  try {
-    const reportContent = readFileSync(reportPath, 'utf8');
-
-    const report = JSON.parse(reportContent) as CucumberFeature[];
-    if (!Array.isArray(report)) {
-      throw new Error('Invalid report format: expected an array of features');
-    }
-
-    const results = convertCucumberReportToResults(report);
-    const htmlReport = generateHtmlReport(results);
-    writeFileSync(join('coverage/functional-tests', 'report.html'), htmlReport);
-    console.info(
-      'HTML report generated successfully at coverage/functional-tests/report.html'
-    );
-  } catch (error) {
+  try {} catch (error) {
     console.error('Error generating report:', error);
     process.exit(1);
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"

Number of calls: 0

[Killed] BooleanLiteral
src/reporting/generateReport.ts:188:9
     const reportContent = readFileSync(reportPath, 'utf8');
 
     const report = JSON.parse(reportContent) as CucumberFeature[];
-    if (!Array.isArray(report)) {
+    if (Array.isArray(report)) {
       throw new Error('Invalid report format: expected an array of features');
     }
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"

Number of calls: 0

[Killed] ConditionalExpression
src/reporting/generateReport.ts:188:9
     const reportContent = readFileSync(reportPath, 'utf8');
 
     const report = JSON.parse(reportContent) as CucumberFeature[];
-    if (!Array.isArray(report)) {
+    if (true) {
       throw new Error('Invalid report format: expected an array of features');
     }
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "coverage/functional-tests/report.html", StringContaining "Test Feature"

Number of calls: 0

[Killed] StringLiteral
src/reporting/generateReport.ts:196:7
     const htmlReport = generateHtmlReport(results);
     writeFileSync(join('coverage/functional-tests', 'report.html'), htmlReport);
     console.info(
-      'HTML report generated successfully at coverage/functional-tests/report.html'
+      ""
     );
   } catch (error) {
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "HTML report generated successfully at coverage/functional-tests/report.html"
Received: ""

Number of calls: 1

[Survived] BlockStatement
src/reporting/generateReport.ts:198:19
     console.info(
       'HTML report generated successfully at coverage/functional-tests/report.html'
     );
-  } catch (error) {
-    console.error('Error generating report:', error);
-    process.exit(1);
-  }
+  } catch (error) {}
 }
 

[Survived] BlockStatement
src/reporting/generateReport.ts:204:30
   }
 }
 
-if (require.main === module) {
-  main();
-}
+if (require.main === module) {}
 
