[Survived] BlockStatement
src/steps/correlation-steps.ts:12:72
 // Cross-service setup and expectations
 Given(
   'I expect the Lambda function to trigger the Step Function named {string}',
-  async function (this: StepContext, expectedStateMachineName: string) {
-    this.expectedStateMachineName = expectedStateMachineName;
-  }
+  async function (this: StepContext, expectedStateMachineName: string) {}
 );
 

[Survived] BlockStatement
src/steps/correlation-steps.ts:20:38
 // Cross-service correlation verification steps
 Then(
   'the Lambda function should trigger the expected Step Function',
-  async function (this: StepContext) {
-    if (!this.functionName) {
-      throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
-      );
-    }
-    if (!this.expectedStateMachineName) {
-      throw new Error(
-        'Expected state machine name is not set. Use the step "I expect the Lambda function to trigger the Step Function named {string}" first.'
-      );
-    }
-
-    const triggered = await framework.verifyLambdaTriggeredStateMachine(
-      this.functionName,
-      this.expectedStateMachineName
-    );
-
-    if (!triggered) {
-      throw new Error(
-        `Lambda function ${this.functionName} did not trigger the expected state machine ${this.expectedStateMachineName}`
-      );
-    }
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] BooleanLiteral
src/steps/correlation-steps.ts:21:9
 Then(
   'the Lambda function should trigger the expected Step Function',
   async function (this: StepContext) {
-    if (!this.functionName) {
+    if (this.functionName) {
       throw new Error(
         'Function name is not set. Make sure to create a Lambda function first.'

[Survived] ConditionalExpression
src/steps/correlation-steps.ts:21:9
 Then(
   'the Lambda function should trigger the expected Step Function',
   async function (this: StepContext) {
-    if (!this.functionName) {
+    if (true) {
       throw new Error(
         'Function name is not set. Make sure to create a Lambda function first.'

[Survived] BlockStatement
src/steps/correlation-steps.ts:26:41
         'Function name is not set. Make sure to create a Lambda function first.'
       );
     }
-    if (!this.expectedStateMachineName) {
-      throw new Error(
-        'Expected state machine name is not set. Use the step "I expect the Lambda function to trigger the Step Function named {string}" first.'
-      );
-    }
+    if (!this.expectedStateMachineName) {}
 
     const triggered = await framework.verifyLambdaTriggeredStateMachine(

[Survived] ConditionalExpression
src/steps/correlation-steps.ts:26:9
         'Function name is not set. Make sure to create a Lambda function first.'
       );
     }
-    if (!this.expectedStateMachineName) {
+    if (false) {
       throw new Error(
         'Expected state machine name is not set. Use the step "I expect the Lambda function to trigger the Step Function named {string}" first.'

[Survived] BlockStatement
src/steps/correlation-steps.ts:37:21
       this.expectedStateMachineName
     );
 
-    if (!triggered) {
-      throw new Error(
-        `Lambda function ${this.functionName} did not trigger the expected state machine ${this.expectedStateMachineName}`
-      );
-    }
+    if (!triggered) {}
   }
 );

[Survived] ConditionalExpression
src/steps/correlation-steps.ts:37:9
       this.expectedStateMachineName
     );
 
-    if (!triggered) {
+    if (true) {
       throw new Error(
         `Lambda function ${this.functionName} did not trigger the expected state machine ${this.expectedStateMachineName}`

[Survived] StringLiteral
src/steps/correlation-steps.ts:46:3
 );
 
 Then(
-  'the Step Function {string} should have recent executions',
+  "",
   async function (this: StepContext, stateMachineName: string) {
     const executions = await framework.getExecutionDetails(stateMachineName);

[Survived] BlockStatement
src/steps/correlation-steps.ts:47:64
 
 Then(
   'the Step Function {string} should have recent executions',
-  async function (this: StepContext, stateMachineName: string) {
-    const executions = await framework.getExecutionDetails(stateMachineName);
-    const recentExecutions = executions.filter((execution) => {
-      const executionTime = new Date(execution.startDate).getTime();
-      const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-      return executionTime > fiveMinutesAgo;
-    });
-
-    if (recentExecutions.length === 0) {
-      throw new Error(
-        `No recent executions found for state machine ${stateMachineName}`
-      );
-    }
-  }
+  async function (this: StepContext, stateMachineName: string) {}
 );
 

[Survived] MethodExpression
src/steps/correlation-steps.ts:49:30
   'the Step Function {string} should have recent executions',
   async function (this: StepContext, stateMachineName: string) {
     const executions = await framework.getExecutionDetails(stateMachineName);
-    const recentExecutions = executions.filter((execution) => {
-      const executionTime = new Date(execution.startDate).getTime();
-      const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-      return executionTime > fiveMinutesAgo;
-    });
+    const recentExecutions = executions;
 
     if (recentExecutions.length === 0) {

[Survived] BlockStatement
src/steps/correlation-steps.ts:49:63
   'the Step Function {string} should have recent executions',
   async function (this: StepContext, stateMachineName: string) {
     const executions = await framework.getExecutionDetails(stateMachineName);
-    const recentExecutions = executions.filter((execution) => {
-      const executionTime = new Date(execution.startDate).getTime();
-      const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-      return executionTime > fiveMinutesAgo;
-    });
+    const recentExecutions = executions.filter((execution) => {});
 
     if (recentExecutions.length === 0) {

[Survived] ArithmeticOperator
src/steps/correlation-steps.ts:51:43
     const executions = await framework.getExecutionDetails(stateMachineName);
     const recentExecutions = executions.filter((execution) => {
       const executionTime = new Date(execution.startDate).getTime();
-      const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
+      const fiveMinutesAgo = Date.now() - 5 / 60 * 1000;
       return executionTime > fiveMinutesAgo;
     });

[Survived] ConditionalExpression
src/steps/correlation-steps.ts:52:14
     const recentExecutions = executions.filter((execution) => {
       const executionTime = new Date(execution.startDate).getTime();
       const fiveMinutesAgo = Date.now() - 5 * 60 * 1000;
-      return executionTime > fiveMinutesAgo;
+      return false;
     });
 

[Survived] ConditionalExpression
src/steps/correlation-steps.ts:55:9
       return executionTime > fiveMinutesAgo;
     });
 
-    if (recentExecutions.length === 0) {
+    if (true) {
       throw new Error(
         `No recent executions found for state machine ${stateMachineName}`

[Survived] EqualityOperator
src/steps/correlation-steps.ts:55:9
       return executionTime > fiveMinutesAgo;
     });
 
-    if (recentExecutions.length === 0) {
+    if (recentExecutions.length !== 0) {
       throw new Error(
         `No recent executions found for state machine ${stateMachineName}`

[Survived] StringLiteral
src/steps/correlation-steps.ts:57:9
 
     if (recentExecutions.length === 0) {
       throw new Error(
-        `No recent executions found for state machine ${stateMachineName}`
+        ``
       );
     }
