[Survived] BlockStatement
src/steps/lambda-steps.ts:12:60
 // Basic Lambda operations
 Given(
   'I have a Lambda function named {string}',
-  async function (this: StepContext, functionName: string) {
-    this.functionName = functionName;
-    await framework.findFunction(functionName);
-  }
+  async function (this: StepContext, functionName: string) {}
 );
 

[Survived] BlockStatement
src/steps/lambda-steps.ts:20:55
 
 When(
   'I invoke the Lambda function with payload {string}',
-  async function (this: StepContext, payload: string) {
-    if (!this.functionName) {
-      throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
-      );
-    }
-    await framework.invokeFunction(this.functionName, JSON.parse(payload));
-  }
+  async function (this: StepContext, payload: string) {}
 );
 

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:21:9
 When(
   'I invoke the Lambda function with payload {string}',
   async function (this: StepContext, payload: string) {
-    if (!this.functionName) {
+    if (false) {
       throw new Error(
         'Function name is not set. Make sure to create a Lambda function first.'

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:21:9
 When(
   'I invoke the Lambda function with payload {string}',
   async function (this: StepContext, payload: string) {
-    if (!this.functionName) {
+    if (true) {
       throw new Error(
         'Function name is not set. Make sure to create a Lambda function first.'

[Survived] BlockStatement
src/steps/lambda-steps.ts:32:62
 
 Then(
   'the Lambda function should return {string}',
-  async function (this: StepContext, expectedResult: string) {
-    if (!this.functionName) {
-      throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
-      );
-    }
-    await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
-      const result = await framework.invokeFunction(this.functionName, {});
-      return result?.Payload === expectedResult;
-    });
-  }
+  async function (this: StepContext, expectedResult: string) {}
 );
 

[Survived] BooleanLiteral
src/steps/lambda-steps.ts:33:9
 Then(
   'the Lambda function should return {string}',
   async function (this: StepContext, expectedResult: string) {
-    if (!this.functionName) {
+    if (this.functionName) {
       throw new Error(
         'Function name is not set. Make sure to create a Lambda function first.'

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:33:9
 Then(
   'the Lambda function should return {string}',
   async function (this: StepContext, expectedResult: string) {
-    if (!this.functionName) {
+    if (true) {
       throw new Error(
         'Function name is not set. Make sure to create a Lambda function first.'

[Survived] StringLiteral
src/steps/lambda-steps.ts:35:9
   async function (this: StepContext, expectedResult: string) {
     if (!this.functionName) {
       throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
+        ""
       );
     }

[Survived] BlockStatement
src/steps/lambda-steps.ts:38:50
         'Function name is not set. Make sure to create a Lambda function first.'
       );
     }
-    await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
-      const result = await framework.invokeFunction(this.functionName, {});
-      return result?.Payload === expectedResult;
-    });
+    await framework.waitForCondition(async () => {});
   }
 );

[Survived] BooleanLiteral
src/steps/lambda-steps.ts:39:38
       );
     }
     await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
+      if (!this.functionName) return true;
       const result = await framework.invokeFunction(this.functionName, {});
       return result?.Payload === expectedResult;

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:39:11
       );
     }
     await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
+      if (false) return false;
       const result = await framework.invokeFunction(this.functionName, {});
       return result?.Payload === expectedResult;

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:41:14
     await framework.waitForCondition(async () => {
       if (!this.functionName) return false;
       const result = await framework.invokeFunction(this.functionName, {});
-      return result?.Payload === expectedResult;
+      return true;
     });
   }

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:41:14
     await framework.waitForCondition(async () => {
       if (!this.functionName) return false;
       const result = await framework.invokeFunction(this.functionName, {});
-      return result?.Payload === expectedResult;
+      return false;
     });
   }

[Survived] BlockStatement
src/steps/lambda-steps.ts:48:38
 
 Then(
   'the Lambda function should be triggered',
-  async function (this: StepContext) {
-    if (!this.functionName) {
-      throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
-      );
-    }
-    await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
-      const lambdaTriggered = await framework.checkLambdaExecution(
-        this.functionName
-      );
-      return lambdaTriggered;
-    });
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:49:9
 Then(
   'the Lambda function should be triggered',
   async function (this: StepContext) {
-    if (!this.functionName) {
+    if (false) {
       throw new Error(
         'Function name is not set. Make sure to create a Lambda function first.'

[Survived] BlockStatement
src/steps/lambda-steps.ts:49:29
 Then(
   'the Lambda function should be triggered',
   async function (this: StepContext) {
-    if (!this.functionName) {
-      throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
-      );
-    }
+    if (!this.functionName) {}
     await framework.waitForCondition(async () => {
       if (!this.functionName) return false;

[Survived] BlockStatement
src/steps/lambda-steps.ts:54:50
         'Function name is not set. Make sure to create a Lambda function first.'
       );
     }
-    await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
-      const lambdaTriggered = await framework.checkLambdaExecution(
-        this.functionName
-      );
-      return lambdaTriggered;
-    });
+    await framework.waitForCondition(async () => {});
   }
 );

[Survived] BlockStatement
src/steps/lambda-steps.ts:66:38
 
 Then(
   'the Lambda function should be invoked',
-  async function (this: StepContext) {
-    if (!this.functionName) {
-      throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
-      );
-    }
-
-    await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
-      const lambdaTriggered = await framework.checkLambdaExecution(
-        this.functionName
-      );
-      return lambdaTriggered;
-    });
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] BlockStatement
src/steps/lambda-steps.ts:73:50
       );
     }
 
-    await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
-      const lambdaTriggered = await framework.checkLambdaExecution(
-        this.functionName
-      );
-      return lambdaTriggered;
-    });
+    await framework.waitForCondition(async () => {});
   }
 );

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:74:11
     }
 
     await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
+      if (true) return false;
       const lambdaTriggered = await framework.checkLambdaExecution(
         this.functionName

[Survived] StringLiteral
src/steps/lambda-steps.ts:84:3
 );
 
 Then(
-  'the Lambda function should be invoked multiple times',
+  "",
   async function (this: StepContext) {
     if (!this.functionName) {

[Survived] BlockStatement
src/steps/lambda-steps.ts:85:38
 
 Then(
   'the Lambda function should be invoked multiple times',
-  async function (this: StepContext) {
-    if (!this.functionName) {
-      throw new Error(
-        'Function name is not set. Make sure to create a Lambda function first.'
-      );
-    }
-
-    // Wait a bit for all invocations to complete
-    await new Promise((resolve) => setTimeout(resolve, 5000));
-
-    // Check that the Lambda function was invoked at least once
-    const lambdaTriggered = await framework.checkLambdaExecution(
-      this.functionName
-    );
-    if (!lambdaTriggered) {
-      throw new Error('Lambda function was not invoked');
-    }
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] ArrowFunction
src/steps/lambda-steps.ts:93:23
     }
 
     // Wait a bit for all invocations to complete
-    await new Promise((resolve) => setTimeout(resolve, 5000));
+    await new Promise(() => undefined);
 
     // Check that the Lambda function was invoked at least once

[Survived] BooleanLiteral
src/steps/lambda-steps.ts:99:9
     const lambdaTriggered = await framework.checkLambdaExecution(
       this.functionName
     );
-    if (!lambdaTriggered) {
+    if (lambdaTriggered) {
       throw new Error('Lambda function was not invoked');
     }

[Survived] ConditionalExpression
src/steps/lambda-steps.ts:99:9
     const lambdaTriggered = await framework.checkLambdaExecution(
       this.functionName
     );
-    if (!lambdaTriggered) {
+    if (false) {
       throw new Error('Lambda function was not invoked');
     }

[Survived] StringLiteral
src/steps/lambda-steps.ts:100:23
       this.functionName
     );
     if (!lambdaTriggered) {
-      throw new Error('Lambda function was not invoked');
+      throw new Error("");
     }
   }
