[Survived] StringLiteral
src/steps/monitoring-steps.ts:12:3
 // Basic monitoring steps that don't rely on workflow traces
 
 Then(
-  'the Lambda function {string} should be accessible',
+  "",
   async function (this: StepContext, functionName: string) {
     try {

[Survived] BlockStatement
src/steps/monitoring-steps.ts:13:60
 
 Then(
   'the Lambda function {string} should be accessible',
-  async function (this: StepContext, functionName: string) {
-    try {
-      await framework.findFunction(functionName);
-    } catch (error) {
-      throw new Error(
-        `Lambda function ${functionName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
-  }
+  async function (this: StepContext, functionName: string) {}
 );
 

[Survived] BlockStatement
src/steps/monitoring-steps.ts:14:9
 Then(
   'the Lambda function {string} should be accessible',
   async function (this: StepContext, functionName: string) {
-    try {
-      await framework.findFunction(functionName);
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(
         `Lambda function ${functionName} is not accessible: ${error instanceof Error ? error.message : String(error)}`

[Survived] BlockStatement
src/steps/monitoring-steps.ts:16:21
   async function (this: StepContext, functionName: string) {
     try {
       await framework.findFunction(functionName);
-    } catch (error) {
-      throw new Error(
-        `Lambda function ${functionName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
+    } catch (error) {}
   }
 );

[Survived] BlockStatement
src/steps/monitoring-steps.ts:26:64
 
 Then(
   'the Step Function {string} should be accessible',
-  async function (this: StepContext, stateMachineName: string) {
-    try {
-      const stateMachineArn =
-        await framework.findStateMachine(stateMachineName);
-      if (!stateMachineArn) {
-        throw new Error(`State machine ${stateMachineName} not found`);
-      }
-    } catch (error) {
-      throw new Error(
-        `Step Function ${stateMachineName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
-  }
+  async function (this: StepContext, stateMachineName: string) {}
 );
 

[Survived] BlockStatement
src/steps/monitoring-steps.ts:27:9
 Then(
   'the Step Function {string} should be accessible',
   async function (this: StepContext, stateMachineName: string) {
-    try {
-      const stateMachineArn =
-        await framework.findStateMachine(stateMachineName);
-      if (!stateMachineArn) {
-        throw new Error(`State machine ${stateMachineName} not found`);
-      }
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(
         `Step Function ${stateMachineName} is not accessible: ${error instanceof Error ? error.message : String(error)}`

[Survived] BooleanLiteral
src/steps/monitoring-steps.ts:30:11
     try {
       const stateMachineArn =
         await framework.findStateMachine(stateMachineName);
-      if (!stateMachineArn) {
+      if (stateMachineArn) {
         throw new Error(`State machine ${stateMachineName} not found`);
       }

[Survived] BlockStatement
src/steps/monitoring-steps.ts:30:29
     try {
       const stateMachineArn =
         await framework.findStateMachine(stateMachineName);
-      if (!stateMachineArn) {
-        throw new Error(`State machine ${stateMachineName} not found`);
-      }
+      if (!stateMachineArn) {}
     } catch (error) {
       throw new Error(

[Survived] BlockStatement
src/steps/monitoring-steps.ts:33:21
       if (!stateMachineArn) {
         throw new Error(`State machine ${stateMachineName} not found`);
       }
-    } catch (error) {
-      throw new Error(
-        `Step Function ${stateMachineName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
+    } catch (error) {}
   }
 );

[Survived] BlockStatement
src/steps/monitoring-steps.ts:43:58
 
 Then(
   'the S3 bucket {string} should be accessible',
-  async function (this: StepContext, bucketName: string) {
-    try {
-      await framework.findBucket(bucketName);
-    } catch (error) {
-      throw new Error(
-        `S3 bucket ${bucketName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
-  }
+  async function (this: StepContext, bucketName: string) {}
 );
 

[Survived] BlockStatement
src/steps/monitoring-steps.ts:44:9
 Then(
   'the S3 bucket {string} should be accessible',
   async function (this: StepContext, bucketName: string) {
-    try {
-      await framework.findBucket(bucketName);
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(
         `S3 bucket ${bucketName} is not accessible: ${error instanceof Error ? error.message : String(error)}`

[Survived] BlockStatement
src/steps/monitoring-steps.ts:46:21
   async function (this: StepContext, bucketName: string) {
     try {
       await framework.findBucket(bucketName);
-    } catch (error) {
-      throw new Error(
-        `S3 bucket ${bucketName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
+    } catch (error) {}
   }
 );

[Survived] StringLiteral
src/steps/monitoring-steps.ts:48:9
       await framework.findBucket(bucketName);
     } catch (error) {
       throw new Error(
-        `S3 bucket ${bucketName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
+        ``
       );
     }

[Survived] BlockStatement
src/steps/monitoring-steps.ts:56:57
 
 Then(
   'the SQS queue {string} should be accessible',
-  async function (this: StepContext, queueName: string) {
-    try {
-      const queueUrl = await framework.findQueue(queueName);
-      if (!queueUrl) {
-        throw new Error(`Queue ${queueName} not found`);
-      }
-    } catch (error) {
-      throw new Error(
-        `SQS queue ${queueName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
-  }
+  async function (this: StepContext, queueName: string) {}
 );
 

[Survived] BlockStatement
src/steps/monitoring-steps.ts:57:9
 Then(
   'the SQS queue {string} should be accessible',
   async function (this: StepContext, queueName: string) {
-    try {
-      const queueUrl = await framework.findQueue(queueName);
-      if (!queueUrl) {
-        throw new Error(`Queue ${queueName} not found`);
-      }
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(
         `SQS queue ${queueName} is not accessible: ${error instanceof Error ? error.message : String(error)}`

[Survived] BooleanLiteral
src/steps/monitoring-steps.ts:59:11
   async function (this: StepContext, queueName: string) {
     try {
       const queueUrl = await framework.findQueue(queueName);
-      if (!queueUrl) {
+      if (queueUrl) {
         throw new Error(`Queue ${queueName} not found`);
       }

[Survived] ConditionalExpression
src/steps/monitoring-steps.ts:59:11
   async function (this: StepContext, queueName: string) {
     try {
       const queueUrl = await framework.findQueue(queueName);
-      if (!queueUrl) {
+      if (false) {
         throw new Error(`Queue ${queueName} not found`);
       }

[Survived] StringLiteral
src/steps/monitoring-steps.ts:60:25
     try {
       const queueUrl = await framework.findQueue(queueName);
       if (!queueUrl) {
-        throw new Error(`Queue ${queueName} not found`);
+        throw new Error(``);
       }
     } catch (error) {

[Survived] BlockStatement
src/steps/monitoring-steps.ts:62:21
       if (!queueUrl) {
         throw new Error(`Queue ${queueName} not found`);
       }
-    } catch (error) {
-      throw new Error(
-        `SQS queue ${queueName} is not accessible: ${error instanceof Error ? error.message : String(error)}`
-      );
-    }
+    } catch (error) {}
   }
 );

[Survived] BlockStatement
src/steps/monitoring-steps.ts:70:74
   }
 );
 
-Then('the AWS setup should be valid', async function (this: StepContext) {
-  const healthStatus = await framework.getHealthStatus();
-  if (!healthStatus.isHealthy) {
-    const errors = healthStatus.awsSetup.errors.join(', ');
-    throw new Error(`AWS setup is not valid: ${errors}`);
-  }
-});
+Then('the AWS setup should be valid', async function (this: StepContext) {});
 
 Then(

[Survived] ConditionalExpression
src/steps/monitoring-steps.ts:72:7
 
 Then('the AWS setup should be valid', async function (this: StepContext) {
   const healthStatus = await framework.getHealthStatus();
-  if (!healthStatus.isHealthy) {
+  if (true) {
     const errors = healthStatus.awsSetup.errors.join(', ');
     throw new Error(`AWS setup is not valid: ${errors}`);

[Survived] BooleanLiteral
src/steps/monitoring-steps.ts:72:7
 
 Then('the AWS setup should be valid', async function (this: StepContext) {
   const healthStatus = await framework.getHealthStatus();
-  if (!healthStatus.isHealthy) {
+  if (healthStatus.isHealthy) {
     const errors = healthStatus.awsSetup.errors.join(', ');
     throw new Error(`AWS setup is not valid: ${errors}`);

[Survived] StringLiteral
src/steps/monitoring-steps.ts:79:3
 });
 
 Then(
-  'the framework should have good performance metrics',
+  "",
   async function (this: StepContext) {
     const metrics = framework.getTestMetrics();

[Survived] BlockStatement
src/steps/monitoring-steps.ts:80:38
 
 Then(
   'the framework should have good performance metrics',
-  async function (this: StepContext) {
-    const metrics = framework.getTestMetrics();
-    if (metrics.errorRate > 10) {
-      throw new Error(
-        `Error rate is too high: ${metrics.errorRate.toFixed(2)}%`
-      );
-    }
-    if (metrics.averageExecutionTime > 10000) {
-      throw new Error(
-        `Average execution time is too slow: ${metrics.averageExecutionTime.toFixed(2)}ms`
-      );
-    }
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] BlockStatement
src/steps/monitoring-steps.ts:82:33
   'the framework should have good performance metrics',
   async function (this: StepContext) {
     const metrics = framework.getTestMetrics();
-    if (metrics.errorRate > 10) {
-      throw new Error(
-        `Error rate is too high: ${metrics.errorRate.toFixed(2)}%`
-      );
-    }
+    if (metrics.errorRate > 10) {}
     if (metrics.averageExecutionTime > 10000) {
       throw new Error(

[Survived] EqualityOperator
src/steps/monitoring-steps.ts:82:9
   'the framework should have good performance metrics',
   async function (this: StepContext) {
     const metrics = framework.getTestMetrics();
-    if (metrics.errorRate > 10) {
+    if (metrics.errorRate >= 10) {
       throw new Error(
         `Error rate is too high: ${metrics.errorRate.toFixed(2)}%`

[Survived] ConditionalExpression
src/steps/monitoring-steps.ts:87:9
         `Error rate is too high: ${metrics.errorRate.toFixed(2)}%`
       );
     }
-    if (metrics.averageExecutionTime > 10000) {
+    if (true) {
       throw new Error(
         `Average execution time is too slow: ${metrics.averageExecutionTime.toFixed(2)}ms`

[Survived] EqualityOperator
src/steps/monitoring-steps.ts:87:9
         `Error rate is too high: ${metrics.errorRate.toFixed(2)}%`
       );
     }
-    if (metrics.averageExecutionTime > 10000) {
+    if (metrics.averageExecutionTime >= 10000) {
       throw new Error(
         `Average execution time is too slow: ${metrics.averageExecutionTime.toFixed(2)}ms`
