[Survived] StringLiteral
src/steps/s3-steps.ts:11:3
 
 // Basic S3 operations
 Given(
-  'I have an S3 bucket named {string}',
+  "",
   async function (this: StepContext, bucketName: string) {
     this.bucketName = bucketName;

[Survived] BlockStatement
src/steps/s3-steps.ts:12:58
 // Basic S3 operations
 Given(
   'I have an S3 bucket named {string}',
-  async function (this: StepContext, bucketName: string) {
-    this.bucketName = bucketName;
-    await framework.findBucket(bucketName);
-  }
+  async function (this: StepContext, bucketName: string) {}
 );
 

[Survived] BlockStatement
src/steps/s3-steps.ts:20:56
 
 When(
   'I upload a file {string} to the S3 bucket',
-  async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
-      throw new Error(
-        'Bucket name is not set. Make sure to create a bucket first.'
-      );
-    }
-
-    this.uploadedFileName = fileName;
-    this.uploadedFileContent = 'Test content';
-
-    await framework.uploadFile(this.bucketName, fileName, 'Test content');
-
-    // Add a small delay to allow S3 event notification to propagate
-    await new Promise((resolve) => setTimeout(resolve, 2000));
-  }
+  async function (this: StepContext, fileName: string) {}
 );
 

[Survived] BooleanLiteral
src/steps/s3-steps.ts:21:9
 When(
   'I upload a file {string} to the S3 bucket',
   async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
+    if (this.bucketName) {
       throw new Error(
         'Bucket name is not set. Make sure to create a bucket first.'

[Survived] BlockStatement
src/steps/s3-steps.ts:21:27
 When(
   'I upload a file {string} to the S3 bucket',
   async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
-      throw new Error(
-        'Bucket name is not set. Make sure to create a bucket first.'
-      );
-    }
+    if (!this.bucketName) {}
 
     this.uploadedFileName = fileName;

[Survived] ArrowFunction
src/steps/s3-steps.ts:33:23
     await framework.uploadFile(this.bucketName, fileName, 'Test content');
 
     // Add a small delay to allow S3 event notification to propagate
-    await new Promise((resolve) => setTimeout(resolve, 2000));
+    await new Promise(() => undefined);
   }
 );

[Survived] StringLiteral
src/steps/s3-steps.ts:38:3
 );
 
 Then(
-  'the S3 bucket should contain the file {string}',
+  "",
   async function (this: StepContext, fileName: string) {
     if (!this.bucketName) {

[Survived] BlockStatement
src/steps/s3-steps.ts:39:56
 
 Then(
   'the S3 bucket should contain the file {string}',
-  async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
-      throw new Error(
-        'Bucket name is not set. Make sure to create a bucket first.'
-      );
-    }
-    await framework.waitForCondition(async () => {
-      if (!this.bucketName) return false;
-      const exists = await framework.checkFileExists(this.bucketName, fileName);
-      return exists;
-    });
-  }
+  async function (this: StepContext, fileName: string) {}
 );
 

[Survived] ConditionalExpression
src/steps/s3-steps.ts:40:9
 Then(
   'the S3 bucket should contain the file {string}',
   async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
+    if (false) {
       throw new Error(
         'Bucket name is not set. Make sure to create a bucket first.'

[Survived] ConditionalExpression
src/steps/s3-steps.ts:40:9
 Then(
   'the S3 bucket should contain the file {string}',
   async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
+    if (true) {
       throw new Error(
         'Bucket name is not set. Make sure to create a bucket first.'

[Survived] BlockStatement
src/steps/s3-steps.ts:45:50
         'Bucket name is not set. Make sure to create a bucket first.'
       );
     }
-    await framework.waitForCondition(async () => {
-      if (!this.bucketName) return false;
-      const exists = await framework.checkFileExists(this.bucketName, fileName);
-      return exists;
-    });
+    await framework.waitForCondition(async () => {});
   }
 );

[Survived] BooleanLiteral
src/steps/s3-steps.ts:46:36
       );
     }
     await framework.waitForCondition(async () => {
-      if (!this.bucketName) return false;
+      if (!this.bucketName) return true;
       const exists = await framework.checkFileExists(this.bucketName, fileName);
       return exists;

[Survived] BooleanLiteral
src/steps/s3-steps.ts:46:11
       );
     }
     await framework.waitForCondition(async () => {
-      if (!this.bucketName) return false;
+      if (this.bucketName) return false;
       const exists = await framework.checkFileExists(this.bucketName, fileName);
       return exists;

[Survived] StringLiteral
src/steps/s3-steps.ts:54:3
 );
 
 When(
-  'I upload a file {string} with content {string} to the S3 bucket',
+  "",
   async function (this: StepContext, fileName: string, content: string) {
     if (!this.bucketName) {

[Survived] BlockStatement
src/steps/s3-steps.ts:55:73
 
 When(
   'I upload a file {string} with content {string} to the S3 bucket',
-  async function (this: StepContext, fileName: string, content: string) {
-    if (!this.bucketName) {
-      throw new Error(
-        'Bucket name is not set. Make sure to create a bucket first.'
-      );
-    }
-
-    this.uploadedFileName = fileName;
-    this.uploadedFileContent = content;
-
-    await framework.uploadFile(this.bucketName, fileName, content);
-
-    // Add a small delay to allow S3 event notification to propagate
-    await new Promise((resolve) => setTimeout(resolve, 2000));
-  }
+  async function (this: StepContext, fileName: string, content: string) {}
 );
 

[Survived] BooleanLiteral
src/steps/s3-steps.ts:56:9
 When(
   'I upload a file {string} with content {string} to the S3 bucket',
   async function (this: StepContext, fileName: string, content: string) {
-    if (!this.bucketName) {
+    if (this.bucketName) {
       throw new Error(
         'Bucket name is not set. Make sure to create a bucket first.'

[Survived] BlockStatement
src/steps/s3-steps.ts:56:27
 When(
   'I upload a file {string} with content {string} to the S3 bucket',
   async function (this: StepContext, fileName: string, content: string) {
-    if (!this.bucketName) {
-      throw new Error(
-        'Bucket name is not set. Make sure to create a bucket first.'
-      );
-    }
+    if (!this.bucketName) {}
 
     this.uploadedFileName = fileName;

[Survived] StringLiteral
src/steps/s3-steps.ts:58:9
   async function (this: StepContext, fileName: string, content: string) {
     if (!this.bucketName) {
       throw new Error(
-        'Bucket name is not set. Make sure to create a bucket first.'
+        ""
       );
     }

[Survived] BlockStatement
src/steps/s3-steps.ts:74:38
 
 When(
   'I upload multiple files to the S3 bucket',
-  async function (this: StepContext) {
-    if (!this.bucketName) {
-      throw new Error(
-        'Bucket name is not set. Make sure to create an S3 bucket first.'
-      );
-    }
-
-    const files = [
-      { name: 'file1.json', content: JSON.stringify({ id: 1, data: 'test1' }) },
-      { name: 'file2.json', content: JSON.stringify({ id: 2, data: 'test2' }) },
-      { name: 'file3.json', content: JSON.stringify({ id: 3, data: 'test3' }) },
-    ];
-
-    for (const file of files) {
-      await framework.uploadFile(this.bucketName, file.name, file.content);
-
-      // Wait a bit between uploads to avoid overwhelming the system
-      await new Promise((resolve) => setTimeout(resolve, 1000));
-    }
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] BlockStatement
src/steps/s3-steps.ts:75:27
 When(
   'I upload multiple files to the S3 bucket',
   async function (this: StepContext) {
-    if (!this.bucketName) {
-      throw new Error(
-        'Bucket name is not set. Make sure to create an S3 bucket first.'
-      );
-    }
+    if (!this.bucketName) {}
 
     const files = [

[Survived] BooleanLiteral
src/steps/s3-steps.ts:75:9
 When(
   'I upload multiple files to the S3 bucket',
   async function (this: StepContext) {
-    if (!this.bucketName) {
+    if (this.bucketName) {
       throw new Error(
         'Bucket name is not set. Make sure to create an S3 bucket first.'

[Survived] ObjectLiteral
src/steps/s3-steps.ts:82:7
     }
 
     const files = [
-      { name: 'file1.json', content: JSON.stringify({ id: 1, data: 'test1' }) },
+      {},
       { name: 'file2.json', content: JSON.stringify({ id: 2, data: 'test2' }) },
       { name: 'file3.json', content: JSON.stringify({ id: 3, data: 'test3' }) },

[Survived] StringLiteral
src/steps/s3-steps.ts:82:15
     }
 
     const files = [
-      { name: 'file1.json', content: JSON.stringify({ id: 1, data: 'test1' }) },
+      { name: "", content: JSON.stringify({ id: 1, data: 'test1' }) },
       { name: 'file2.json', content: JSON.stringify({ id: 2, data: 'test2' }) },
       { name: 'file3.json', content: JSON.stringify({ id: 3, data: 'test3' }) },

[Survived] ObjectLiteral
src/steps/s3-steps.ts:83:7
 
     const files = [
       { name: 'file1.json', content: JSON.stringify({ id: 1, data: 'test1' }) },
-      { name: 'file2.json', content: JSON.stringify({ id: 2, data: 'test2' }) },
+      {},
       { name: 'file3.json', content: JSON.stringify({ id: 3, data: 'test3' }) },
     ];

[Survived] ObjectLiteral
src/steps/s3-steps.ts:83:53
 
     const files = [
       { name: 'file1.json', content: JSON.stringify({ id: 1, data: 'test1' }) },
-      { name: 'file2.json', content: JSON.stringify({ id: 2, data: 'test2' }) },
+      { name: 'file2.json', content: JSON.stringify({}) },
       { name: 'file3.json', content: JSON.stringify({ id: 3, data: 'test3' }) },
     ];

[Survived] BlockStatement
src/steps/s3-steps.ts:87:31
       { name: 'file3.json', content: JSON.stringify({ id: 3, data: 'test3' }) },
     ];
 
-    for (const file of files) {
-      await framework.uploadFile(this.bucketName, file.name, file.content);
-
-      // Wait a bit between uploads to avoid overwhelming the system
-      await new Promise((resolve) => setTimeout(resolve, 1000));
-    }
+    for (const file of files) {}
   }
 );

[Survived] ArrowFunction
src/steps/s3-steps.ts:91:25
       await framework.uploadFile(this.bucketName, file.name, file.content);
 
       // Wait a bit between uploads to avoid overwhelming the system
-      await new Promise((resolve) => setTimeout(resolve, 1000));
+      await new Promise(() => undefined);
     }
   }
