[Survived] BlockStatement
src/steps/sqs-steps.ts:12:57
 // Basic SQS operations
 Given(
   'I have an SQS queue named {string}',
-  async function (this: StepContext, queueName: string) {
-    this.queueName = queueName;
-    this.queueUrl = await framework.findQueue(queueName);
-  }
+  async function (this: StepContext, queueName: string) {}
 );
 

[Survived] StringLiteral
src/steps/sqs-steps.ts:19:3
 );
 
 When(
-  'I send a message {string} to the SQS queue',
+  "",
   async function (this: StepContext, message: string) {
     if (!this.queueUrl) {

[Survived] BlockStatement
src/steps/sqs-steps.ts:20:55
 
 When(
   'I send a message {string} to the SQS queue',
-  async function (this: StepContext, message: string) {
-    if (!this.queueUrl) {
-      throw new Error(
-        'Queue URL is not set. Make sure to create a queue first.'
-      );
-    }
-    await framework.sendMessage(this.queueUrl, message);
-  }
+  async function (this: StepContext, message: string) {}
 );
 

[Survived] ConditionalExpression
src/steps/sqs-steps.ts:21:9
 When(
   'I send a message {string} to the SQS queue',
   async function (this: StepContext, message: string) {
-    if (!this.queueUrl) {
+    if (true) {
       throw new Error(
         'Queue URL is not set. Make sure to create a queue first.'

[Survived] BlockStatement
src/steps/sqs-steps.ts:21:25
 When(
   'I send a message {string} to the SQS queue',
   async function (this: StepContext, message: string) {
-    if (!this.queueUrl) {
-      throw new Error(
-        'Queue URL is not set. Make sure to create a queue first.'
-      );
-    }
+    if (!this.queueUrl) {}
     await framework.sendMessage(this.queueUrl, message);
   }

[Survived] BlockStatement
src/steps/sqs-steps.ts:32:38
 
 Then(
   'the SQS queue should receive a notification',
-  async function (this: StepContext) {
-    if (!this.queueUrl) {
-      throw new Error(
-        'Queue URL is not set. Make sure to create a queue first.'
-      );
-    }
-    await framework.waitForCondition(async () => {
-      if (!this.queueUrl) return false;
-      const unreadCount = await framework.getUnreadMessageCount(this.queueUrl);
-      return unreadCount > 0;
-    }, 30000);
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] ConditionalExpression
src/steps/sqs-steps.ts:33:9
 Then(
   'the SQS queue should receive a notification',
   async function (this: StepContext) {
-    if (!this.queueUrl) {
+    if (true) {
       throw new Error(
         'Queue URL is not set. Make sure to create a queue first.'

[Survived] BooleanLiteral
src/steps/sqs-steps.ts:33:9
 Then(
   'the SQS queue should receive a notification',
   async function (this: StepContext) {
-    if (!this.queueUrl) {
+    if (this.queueUrl) {
       throw new Error(
         'Queue URL is not set. Make sure to create a queue first.'

[Survived] BlockStatement
src/steps/sqs-steps.ts:38:50
         'Queue URL is not set. Make sure to create a queue first.'
       );
     }
-    await framework.waitForCondition(async () => {
-      if (!this.queueUrl) return false;
-      const unreadCount = await framework.getUnreadMessageCount(this.queueUrl);
-      return unreadCount > 0;
-    }, 30000);
+    await framework.waitForCondition(async () => {}, 30000);
   }
 );

[Survived] BooleanLiteral
src/steps/sqs-steps.ts:39:34
       );
     }
     await framework.waitForCondition(async () => {
-      if (!this.queueUrl) return false;
+      if (!this.queueUrl) return true;
       const unreadCount = await framework.getUnreadMessageCount(this.queueUrl);
       return unreadCount > 0;

[Survived] ConditionalExpression
src/steps/sqs-steps.ts:39:11
       );
     }
     await framework.waitForCondition(async () => {
-      if (!this.queueUrl) return false;
+      if (false) return false;
       const unreadCount = await framework.getUnreadMessageCount(this.queueUrl);
       return unreadCount > 0;

[Survived] ConditionalExpression
src/steps/sqs-steps.ts:41:14
     await framework.waitForCondition(async () => {
       if (!this.queueUrl) return false;
       const unreadCount = await framework.getUnreadMessageCount(this.queueUrl);
-      return unreadCount > 0;
+      return true;
     }, 30000);
   }

[Survived] EqualityOperator
src/steps/sqs-steps.ts:41:14
     await framework.waitForCondition(async () => {
       if (!this.queueUrl) return false;
       const unreadCount = await framework.getUnreadMessageCount(this.queueUrl);
-      return unreadCount > 0;
+      return unreadCount >= 0;
     }, 30000);
   }
