[Survived] BlockStatement
src/steps/step-function-steps.ts:12:64
 // Basic Step Function setup steps
 Given(
   'I have a Step Function named {string}',
-  async function (this: StepContext, stateMachineName: string) {
-    this.stateMachineName = stateMachineName;
-    const stateMachineArn = await framework.findStateMachine(stateMachineName);
-    this.stateMachineArn = stateMachineArn;
-  }
+  async function (this: StepContext, stateMachineName: string) {}
 );
 

[Survived] BlockStatement
src/steps/step-function-steps.ts:21:53
 
 When(
   'I start a Step Function execution with input {string}',
-  async function (this: StepContext, input: string) {
-    if (!this.stateMachineArn) {
-      throw new Error(
-        'State machine ARN is not set. Make sure to create a Step Function first.'
-      );
-    }
-
-    const executionInput = JSON.parse(input);
-    const executionArn = await framework.startExecution(
-      this.stateMachineArn,
-      executionInput
-    );
-    this.executionArn = executionArn;
-  }
+  async function (this: StepContext, input: string) {}
 );
 

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:22:9
 When(
   'I start a Step Function execution with input {string}',
   async function (this: StepContext, input: string) {
-    if (!this.stateMachineArn) {
+    if (false) {
       throw new Error(
         'State machine ARN is not set. Make sure to create a Step Function first.'

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:22:9
 When(
   'I start a Step Function execution with input {string}',
   async function (this: StepContext, input: string) {
-    if (!this.stateMachineArn) {
+    if (this.stateMachineArn) {
       throw new Error(
         'State machine ARN is not set. Make sure to create a Step Function first.'

[Survived] StringLiteral
src/steps/step-function-steps.ts:24:9
   async function (this: StepContext, input: string) {
     if (!this.stateMachineArn) {
       throw new Error(
-        'State machine ARN is not set. Make sure to create a Step Function first.'
+        ""
       );
     }

[Survived] BlockStatement
src/steps/step-function-steps.ts:40:38
 // Basic Step Function verification steps
 Then(
   'the Step Function execution should succeed',
-  async function (this: StepContext) {
-    if (!this.executionArn) {
-      throw new Error(
-        'Execution ARN is not set. Make sure to start an execution first.'
-      );
-    }
-
-    // Wait for execution to complete
-    let status = await framework.getExecutionStatus(this.executionArn);
-    const startTime = Date.now();
-    const timeout = 60000; // 1 minute timeout
-
-    while (status === 'RUNNING' && Date.now() - startTime < timeout) {
-      await new Promise((resolve) => setTimeout(resolve, 2000)); // Wait 2 seconds
-      status = await framework.getExecutionStatus(this.executionArn);
-    }
-
-    if (status !== 'SUCCEEDED') {
-      throw new Error(`Step Function execution failed with status: ${status}`);
-    }
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:41:9
 Then(
   'the Step Function execution should succeed',
   async function (this: StepContext) {
-    if (!this.executionArn) {
+    if (false) {
       throw new Error(
         'Execution ARN is not set. Make sure to start an execution first.'

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:41:9
 Then(
   'the Step Function execution should succeed',
   async function (this: StepContext) {
-    if (!this.executionArn) {
+    if (true) {
       throw new Error(
         'Execution ARN is not set. Make sure to start an execution first.'

[Survived] BlockStatement
src/steps/step-function-steps.ts:52:70
     const startTime = Date.now();
     const timeout = 60000; // 1 minute timeout
 
-    while (status === 'RUNNING' && Date.now() - startTime < timeout) {
-      await new Promise((resolve) => setTimeout(resolve, 2000)); // Wait 2 seconds
-      status = await framework.getExecutionStatus(this.executionArn);
-    }
+    while (status === 'RUNNING' && Date.now() - startTime < timeout) {}
 
     if (status !== 'SUCCEEDED') {

[Survived] EqualityOperator
src/steps/step-function-steps.ts:52:36
     const startTime = Date.now();
     const timeout = 60000; // 1 minute timeout
 
-    while (status === 'RUNNING' && Date.now() - startTime < timeout) {
+    while (status === 'RUNNING' && Date.now() - startTime <= timeout) {
       await new Promise((resolve) => setTimeout(resolve, 2000)); // Wait 2 seconds
       status = await framework.getExecutionStatus(this.executionArn);

[Survived] ArrowFunction
src/steps/step-function-steps.ts:53:25
     const timeout = 60000; // 1 minute timeout
 
     while (status === 'RUNNING' && Date.now() - startTime < timeout) {
-      await new Promise((resolve) => setTimeout(resolve, 2000)); // Wait 2 seconds
+      await new Promise(() => undefined); // Wait 2 seconds
       status = await framework.getExecutionStatus(this.executionArn);
     }

[Survived] BlockStatement
src/steps/step-function-steps.ts:57:33
       status = await framework.getExecutionStatus(this.executionArn);
     }
 
-    if (status !== 'SUCCEEDED') {
-      throw new Error(`Step Function execution failed with status: ${status}`);
-    }
+    if (status !== 'SUCCEEDED') {}
   }
 );

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:57:9
       status = await framework.getExecutionStatus(this.executionArn);
     }
 
-    if (status !== 'SUCCEEDED') {
+    if (true) {
       throw new Error(`Step Function execution failed with status: ${status}`);
     }

[Survived] StringLiteral
src/steps/step-function-steps.ts:58:23
     }
 
     if (status !== 'SUCCEEDED') {
-      throw new Error(`Step Function execution failed with status: ${status}`);
+      throw new Error(``);
     }
   }

[Survived] BlockStatement
src/steps/step-function-steps.ts:65:38
 
 Then(
   'the Step Function should have valid state machine definition',
-  async function (this: StepContext) {
-    if (!this.stateMachineName) {
-      throw new Error(
-        'State machine name is not set. Make sure to create a Step Function first.'
-      );
-    }
-
-    const definition = await framework.verifyStepFunctionDefinition(
-      this.stateMachineName
-    );
-
-    if (!definition.isValid) {
-      throw new Error(
-        `Step Function definition is invalid: ${definition.errors.join(', ')}`
-      );
-    }
-
-    if (!definition.hasStartState) {
-      throw new Error('Step Function definition is missing StartAt state');
-    }
-
-    if (!definition.hasEndStates) {
-      throw new Error('Step Function definition has no end states');
-    }
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:66:9
 Then(
   'the Step Function should have valid state machine definition',
   async function (this: StepContext) {
-    if (!this.stateMachineName) {
+    if (false) {
       throw new Error(
         'State machine name is not set. Make sure to create a Step Function first.'

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:66:9
 Then(
   'the Step Function should have valid state machine definition',
   async function (this: StepContext) {
-    if (!this.stateMachineName) {
+    if (this.stateMachineName) {
       throw new Error(
         'State machine name is not set. Make sure to create a Step Function first.'

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:76:9
       this.stateMachineName
     );
 
-    if (!definition.isValid) {
+    if (definition.isValid) {
       throw new Error(
         `Step Function definition is invalid: ${definition.errors.join(', ')}`

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:76:9
       this.stateMachineName
     );
 
-    if (!definition.isValid) {
+    if (false) {
       throw new Error(
         `Step Function definition is invalid: ${definition.errors.join(', ')}`

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:82:9
       );
     }
 
-    if (!definition.hasStartState) {
+    if (true) {
       throw new Error('Step Function definition is missing StartAt state');
     }

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:82:9
       );
     }
 
-    if (!definition.hasStartState) {
+    if (definition.hasStartState) {
       throw new Error('Step Function definition is missing StartAt state');
     }

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:86:9
       throw new Error('Step Function definition is missing StartAt state');
     }
 
-    if (!definition.hasEndStates) {
+    if (false) {
       throw new Error('Step Function definition has no end states');
     }

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:86:9
       throw new Error('Step Function definition is missing StartAt state');
     }
 
-    if (!definition.hasEndStates) {
+    if (true) {
       throw new Error('Step Function definition has no end states');
     }

[Survived] BlockStatement
src/steps/step-function-steps.ts:94:38
 
 Then(
   'the Step Function should be executed',
-  async function (this: StepContext) {
-    if (!this.stateMachineName) {
-      throw new Error(
-        'State machine name is not set. Make sure to create a Step Function first.'
-      );
-    }
-
-    // Wait a bit for execution to complete
-    await new Promise((resolve) => setTimeout(resolve, 5000));
-
-    // Check that the Step Function was executed at least once
-    const stateMachineTriggered = await framework.checkStateMachineExecution(
-      this.stateMachineName
-    );
-    if (!stateMachineTriggered) {
-      throw new Error('Step Function was not executed');
-    }
-  }
+  async function (this: StepContext) {}
 );
 

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:95:9
 Then(
   'the Step Function should be executed',
   async function (this: StepContext) {
-    if (!this.stateMachineName) {
+    if (true) {
       throw new Error(
         'State machine name is not set. Make sure to create a Step Function first.'

[Survived] BlockStatement
src/steps/step-function-steps.ts:95:33
 Then(
   'the Step Function should be executed',
   async function (this: StepContext) {
-    if (!this.stateMachineName) {
-      throw new Error(
-        'State machine name is not set. Make sure to create a Step Function first.'
-      );
-    }
+    if (!this.stateMachineName) {}
 
     // Wait a bit for execution to complete

[Survived] ArrowFunction
src/steps/step-function-steps.ts:102:23
     }
 
     // Wait a bit for execution to complete
-    await new Promise((resolve) => setTimeout(resolve, 5000));
+    await new Promise(() => undefined);
 
     // Check that the Step Function was executed at least once

[Survived] BlockStatement
src/steps/step-function-steps.ts:108:33
     const stateMachineTriggered = await framework.checkStateMachineExecution(
       this.stateMachineName
     );
-    if (!stateMachineTriggered) {
-      throw new Error('Step Function was not executed');
-    }
+    if (!stateMachineTriggered) {}
   }
 );

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:108:9
     const stateMachineTriggered = await framework.checkStateMachineExecution(
       this.stateMachineName
     );
-    if (!stateMachineTriggered) {
+    if (stateMachineTriggered) {
       throw new Error('Step Function was not executed');
     }

[Survived] BlockStatement
src/steps/step-function-steps.ts:117:62
 // Advanced Step Function verification steps (using executionArn directly)
 Then(
   'the Step Function execution should complete all expected states: {string}',
-  async function (this: StepContext, expectedStates: string) {
-    if (!this.executionArn) {
-      throw new Error(
-        'Execution ARN is not set. Make sure to start an execution first.'
-      );
-    }
-
-    const stateList = expectedStates.split(',').map((s) => s.trim());
-    const result = await framework.verifyStepFunctionExecutionSuccess(
-      this.executionArn,
-      stateList
-    );
-
-    if (!result.success) {
-      const missingStates = stateList.filter(
-        (state) => !result.completedStates.includes(state)
-      );
-      const errorMsg = `Step Function execution failed. Missing states: ${missingStates.join(', ')}. Failed states: ${result.failedStates.join(', ')}`;
-      throw new Error(errorMsg);
-    }
-  }
+  async function (this: StepContext, expectedStates: string) {}
 );
 

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:118:9
 Then(
   'the Step Function execution should complete all expected states: {string}',
   async function (this: StepContext, expectedStates: string) {
-    if (!this.executionArn) {
+    if (this.executionArn) {
       throw new Error(
         'Execution ARN is not set. Make sure to start an execution first.'

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:118:9
 Then(
   'the Step Function execution should complete all expected states: {string}',
   async function (this: StepContext, expectedStates: string) {
-    if (!this.executionArn) {
+    if (true) {
       throw new Error(
         'Execution ARN is not set. Make sure to start an execution first.'

[Survived] ArrowFunction
src/steps/step-function-steps.ts:124:53
       );
     }
 
-    const stateList = expectedStates.split(',').map((s) => s.trim());
+    const stateList = expectedStates.split(',').map(() => undefined);
     const result = await framework.verifyStepFunctionExecutionSuccess(
       this.executionArn,

[Survived] MethodExpression
src/steps/step-function-steps.ts:124:60
       );
     }
 
-    const stateList = expectedStates.split(',').map((s) => s.trim());
+    const stateList = expectedStates.split(',').map((s) => s);
     const result = await framework.verifyStepFunctionExecutionSuccess(
       this.executionArn,

[Survived] MethodExpression
src/steps/step-function-steps.ts:131:29
     );
 
     if (!result.success) {
-      const missingStates = stateList.filter(
-        (state) => !result.completedStates.includes(state)
-      );
+      const missingStates = stateList;
       const errorMsg = `Step Function execution failed. Missing states: ${missingStates.join(', ')}. Failed states: ${result.failedStates.join(', ')}`;
       throw new Error(errorMsg);

[Survived] ArrowFunction
src/steps/step-function-steps.ts:132:9
 
     if (!result.success) {
       const missingStates = stateList.filter(
-        (state) => !result.completedStates.includes(state)
+        () => undefined
       );
       const errorMsg = `Step Function execution failed. Missing states: ${missingStates.join(', ')}. Failed states: ${result.failedStates.join(', ')}`;

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:132:20
 
     if (!result.success) {
       const missingStates = stateList.filter(
-        (state) => !result.completedStates.includes(state)
+        (state) => result.completedStates.includes(state)
       );
       const errorMsg = `Step Function execution failed. Missing states: ${missingStates.join(', ')}. Failed states: ${result.failedStates.join(', ')}`;

[Survived] BlockStatement
src/steps/step-function-steps.ts:142:66
 
 Then(
   'the Step Function execution should complete within {int} milliseconds',
-  async function (this: StepContext, maxExecutionTimeMs: number) {
-    if (!this.executionArn) {
-      throw new Error(
-        'Execution ARN is not set. Make sure to start an execution first.'
-      );
-    }
-
-    const result = await framework.verifyStepFunctionExecutionSuccess(
-      this.executionArn
-    );
-
-    if (result.executionTime > maxExecutionTimeMs) {
-      throw new Error(
-        `Step Function execution time ${result.executionTime}ms exceeds limit of ${maxExecutionTimeMs}ms`
-      );
-    }
-  }
+  async function (this: StepContext, maxExecutionTimeMs: number) {}
 );
 

[Survived] BooleanLiteral
src/steps/step-function-steps.ts:143:9
 Then(
   'the Step Function execution should complete within {int} milliseconds',
   async function (this: StepContext, maxExecutionTimeMs: number) {
-    if (!this.executionArn) {
+    if (this.executionArn) {
       throw new Error(
         'Execution ARN is not set. Make sure to start an execution first.'

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:143:9
 Then(
   'the Step Function execution should complete within {int} milliseconds',
   async function (this: StepContext, maxExecutionTimeMs: number) {
-    if (!this.executionArn) {
+    if (true) {
       throw new Error(
         'Execution ARN is not set. Make sure to start an execution first.'

[Survived] StringLiteral
src/steps/step-function-steps.ts:145:9
   async function (this: StepContext, maxExecutionTimeMs: number) {
     if (!this.executionArn) {
       throw new Error(
-        'Execution ARN is not set. Make sure to start an execution first.'
+        ""
       );
     }

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:153:9
       this.executionArn
     );
 
-    if (result.executionTime > maxExecutionTimeMs) {
+    if (true) {
       throw new Error(
         `Step Function execution time ${result.executionTime}ms exceeds limit of ${maxExecutionTimeMs}ms`

[Survived] EqualityOperator
src/steps/step-function-steps.ts:153:9
       this.executionArn
     );
 
-    if (result.executionTime > maxExecutionTimeMs) {
+    if (result.executionTime >= maxExecutionTimeMs) {
       throw new Error(
         `Step Function execution time ${result.executionTime}ms exceeds limit of ${maxExecutionTimeMs}ms`

[Survived] StringLiteral
src/steps/step-function-steps.ts:155:9
 
     if (result.executionTime > maxExecutionTimeMs) {
       throw new Error(
-        `Step Function execution time ${result.executionTime}ms exceeds limit of ${maxExecutionTimeMs}ms`
+        ``
       );
     }

[Survived] BlockStatement
src/steps/step-function-steps.ts:164:29
 Then(
   'the Step Function performance should be acceptable',
   async function (this: StepContext) {
-    if (!this.executionArn) {
-      throw new Error(
-        'Execution ARN is not set. Make sure to start an execution first.'
-      );
-    }
+    if (!this.executionArn) {}
 
     const performance = await framework.checkStepFunctionPerformance(

[Survived] ConditionalExpression
src/steps/step-function-steps.ts:175:9
     );
 
     // Basic performance checks
-    if (performance.totalExecutionTime > 60000) {
+    if (false) {
       // 1 minute
       throw new Error(

[Survived] EqualityOperator
src/steps/step-function-steps.ts:175:9
     );
 
     // Basic performance checks
-    if (performance.totalExecutionTime > 60000) {
+    if (performance.totalExecutionTime >= 60000) {
       // 1 minute
       throw new Error(

[Survived] BlockStatement
src/steps/step-function-steps.ts:182:56
       );
     }
 
-    if (performance.averageStateExecutionTime > 10000) {
-      // 10 seconds per state
-      throw new Error(
-        `Average state execution time ${performance.averageStateExecutionTime}ms is too slow`
-      );
-    }
+    if (performance.averageStateExecutionTime > 10000) {}
   }
 );

[Survived] EqualityOperator
src/steps/step-function-steps.ts:182:9
       );
     }
 
-    if (performance.averageStateExecutionTime > 10000) {
+    if (performance.averageStateExecutionTime <= 10000) {
       // 10 seconds per state
       throw new Error(

[Survived] StringLiteral
src/steps/step-function-steps.ts:185:9
     if (performance.averageStateExecutionTime > 10000) {
       // 10 seconds per state
       throw new Error(
-        `Average state execution time ${performance.averageStateExecutionTime}ms is too slow`
+        ``
       );
     }
