[Survived] BlockStatement
src/utils/TestDataGenerator.ts:24:35
   /**
    * Generate a unique correlation ID
    */
-  generateCorrelationId(): string {
-    this.correlationIdCounter++;
-    return `test-${Date.now()}-${this.correlationIdCounter}`;
-  }
+  generateCorrelationId(): string {}
 
   /**

[Survived] UpdateOperator
src/utils/TestDataGenerator.ts:25:5
    * Generate a unique correlation ID
    */
   generateCorrelationId(): string {
-    this.correlationIdCounter++;
+    this.correlationIdCounter--;
     return `test-${Date.now()}-${this.correlationIdCounter}`;
   }

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:34:22
    */
   generateTestData(
     type: DataType,
-    size: DataSize = 'small',
+    size: DataSize = "",
     options: TestDataOptions = {}
   ): string {

[Survived] LogicalOperator
src/utils/TestDataGenerator.ts:37:27
     size: DataSize = 'small',
     options: TestDataOptions = {}
   ): string {
-    const correlationId = options.correlationId || this.generateCorrelationId();
+    const correlationId = options.correlationId && this.generateCorrelationId();
     const timestamp = options.timestamp || new Date();
 

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:37:27
     size: DataSize = 'small',
     options: TestDataOptions = {}
   ): string {
-    const correlationId = options.correlationId || this.generateCorrelationId();
+    const correlationId = false;
     const timestamp = options.timestamp || new Date();
 

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:38:23
     options: TestDataOptions = {}
   ): string {
     const correlationId = options.correlationId || this.generateCorrelationId();
-    const timestamp = options.timestamp || new Date();
+    const timestamp = false;
 
     switch (type) {

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:38:23
     options: TestDataOptions = {}
   ): string {
     const correlationId = options.correlationId || this.generateCorrelationId();
-    const timestamp = options.timestamp || new Date();
+    const timestamp = true;
 
     switch (type) {

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:41:7
     const timestamp = options.timestamp || new Date();
 
     switch (type) {
-      case 'json':
-        return this.generateJSONTestData(size, {
-          correlationId,
-          timestamp,
-          ...options,
-        });
+      case 'json':
       case 'csv':
         return this.generateCSVTestData(size, {

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:47:7
           timestamp,
           ...options,
         });
-      case 'csv':
-        return this.generateCSVTestData(size, {
-          correlationId,
-          timestamp,
-          ...options,
-        });
+      case 'csv':
       case 'xml':
         return this.generateXMLTestData(size, {

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:53:7
           timestamp,
           ...options,
         });
-      case 'xml':
-        return this.generateXMLTestData(size, {
-          correlationId,
-          timestamp,
-          ...options,
-        });
+      case 'xml':
       case 'text':
         return this.generateTextTestData(size, {

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:53:12
           timestamp,
           ...options,
         });
-      case 'xml':
+      case "":
         return this.generateXMLTestData(size, {
           correlationId,

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:59:7
           timestamp,
           ...options,
         });
-      case 'text':
-        return this.generateTextTestData(size, {
-          correlationId,
-          timestamp,
-          ...options,
-        });
+      case 'text':
       default:
         throw new Error(`Unsupported test data type: ${type}`);

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:59:12
           timestamp,
           ...options,
         });
-      case 'text':
+      case "":
         return this.generateTextTestData(size, {
           correlationId,

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:65:7
           timestamp,
           ...options,
         });
-      default:
-        throw new Error(`Unsupported test data type: ${type}`);
+      default:
     }
   }

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:66:25
           ...options,
         });
       default:
-        throw new Error(`Unsupported test data type: ${type}`);
+        throw new Error(``);
     }
   }

[Survived] BooleanLiteral
src/utils/TestDataGenerator.ts:81:17
       id: Date.now(),
       timestamp: options.timestamp.toISOString(),
       correlationId: options.correlationId,
-      testData: true,
+      testData: false,
     };
 

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:84:9
       testData: true,
     };
 
-    if (options.includeMetadata) {
+    if (true) {
       Object.assign(baseData, {
         metadata: {

[Survived] BlockStatement
src/utils/TestDataGenerator.ts:84:34
       testData: true,
     };
 
-    if (options.includeMetadata) {
-      Object.assign(baseData, {
-        metadata: {
-          generator: 'aws-testing-framework',
-          version: '1.0.0',
-          size,
-          type: 'json',
-        },
-      });
-    }
+    if (options.includeMetadata) {}
 
     switch (size) {

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:88:20
       Object.assign(baseData, {
         metadata: {
           generator: 'aws-testing-framework',
-          version: '1.0.0',
+          version: "",
           size,
           type: 'json',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:90:17
           generator: 'aws-testing-framework',
           version: '1.0.0',
           size,
-          type: 'json',
+          type: "",
         },
       });

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:96:7
     }
 
     switch (size) {
-      case 'small':
-        return JSON.stringify({
-          ...baseData,
-          message: 'Small test data',
-          value: Math.random() * 100,
-        });
+      case 'small':
       case 'medium':
         return JSON.stringify({

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:100:18
         return JSON.stringify({
           ...baseData,
           message: 'Small test data',
-          value: Math.random() * 100,
+          value: Math.random() / 100,
         });
       case 'medium':

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:102:7
           message: 'Small test data',
           value: Math.random() * 100,
         });
-      case 'medium':
-        return JSON.stringify({
-          ...baseData,
-          items: Array.from({ length: 10 }, (_, i) => ({
-            id: i + 1,
-            name: `Item ${i + 1}`,
-            value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 3) + 1}`,
-          })),
-        });
+      case 'medium':
       case 'large':
         return JSON.stringify({

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:105:45
       case 'medium':
         return JSON.stringify({
           ...baseData,
-          items: Array.from({ length: 10 }, (_, i) => ({
-            id: i + 1,
-            name: `Item ${i + 1}`,
-            value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 3) + 1}`,
-          })),
+          items: Array.from({ length: 10 }, () => undefined),
         });
       case 'large':

[Survived] ObjectLiteral
src/utils/TestDataGenerator.ts:105:29
       case 'medium':
         return JSON.stringify({
           ...baseData,
-          items: Array.from({ length: 10 }, (_, i) => ({
+          items: Array.from({}, (_, i) => ({
             id: i + 1,
             name: `Item ${i + 1}`,

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:106:17
         return JSON.stringify({
           ...baseData,
           items: Array.from({ length: 10 }, (_, i) => ({
-            id: i + 1,
+            id: i - 1,
             name: `Item ${i + 1}`,
             value: Math.random() * 100,

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:107:27
           ...baseData,
           items: Array.from({ length: 10 }, (_, i) => ({
             id: i + 1,
-            name: `Item ${i + 1}`,
+            name: `Item ${i - 1}`,
             value: Math.random() * 100,
             category: `Category ${Math.floor(i / 3) + 1}`,

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:108:20
           items: Array.from({ length: 10 }, (_, i) => ({
             id: i + 1,
             name: `Item ${i + 1}`,
-            value: Math.random() * 100,
+            value: Math.random() / 100,
             category: `Category ${Math.floor(i / 3) + 1}`,
           })),

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:109:35
             id: i + 1,
             name: `Item ${i + 1}`,
             value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 3) + 1}`,
+            category: `Category ${Math.floor(i / 3) - 1}`,
           })),
         });

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:109:46
             id: i + 1,
             name: `Item ${i + 1}`,
             value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 3) + 1}`,
+            category: `Category ${Math.floor(i * 3) + 1}`,
           })),
         });

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:112:7
             category: `Category ${Math.floor(i / 3) + 1}`,
           })),
         });
-      case 'large':
-        return JSON.stringify({
-          ...baseData,
-          items: Array.from({ length: 100 }, (_, i) => ({
-            id: i + 1,
-            name: `Item ${i + 1}`,
-            value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 10) + 1}`,
-            tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
-            metadata: {
-              priority: (i % 3) + 1,
-              active: i % 2 === 0,
-            },
-          })),
-        });
+      case 'large':
     }
   }

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:115:46
       case 'large':
         return JSON.stringify({
           ...baseData,
-          items: Array.from({ length: 100 }, (_, i) => ({
-            id: i + 1,
-            name: `Item ${i + 1}`,
-            value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 10) + 1}`,
-            tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
-            metadata: {
-              priority: (i % 3) + 1,
-              active: i % 2 === 0,
-            },
-          })),
+          items: Array.from({ length: 100 }, () => undefined),
         });
     }

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:116:17
         return JSON.stringify({
           ...baseData,
           items: Array.from({ length: 100 }, (_, i) => ({
-            id: i + 1,
+            id: i - 1,
             name: `Item ${i + 1}`,
             value: Math.random() * 100,

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:119:35
             id: i + 1,
             name: `Item ${i + 1}`,
             value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 10) + 1}`,
+            category: `Category ${Math.floor(i / 10) - 1}`,
             tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
             metadata: {

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:119:46
             id: i + 1,
             name: `Item ${i + 1}`,
             value: Math.random() * 100,
-            category: `Category ${Math.floor(i / 10) + 1}`,
+            category: `Category ${Math.floor(i * 10) + 1}`,
             tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
             metadata: {

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:120:27
             name: `Item ${i + 1}`,
             value: Math.random() * 100,
             category: `Category ${Math.floor(i / 10) + 1}`,
-            tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
+            tags: [`tag${(i * 5) + 1}`, `tag${(i % 3) + 1}`],
             metadata: {
               priority: (i % 3) + 1,

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:120:26
             name: `Item ${i + 1}`,
             value: Math.random() * 100,
             category: `Category ${Math.floor(i / 10) + 1}`,
-            tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
+            tags: [`tag${i % 5 - 1}`, `tag${(i % 3) + 1}`],
             metadata: {
               priority: (i % 3) + 1,

[Survived] ObjectLiteral
src/utils/TestDataGenerator.ts:121:23
             value: Math.random() * 100,
             category: `Category ${Math.floor(i / 10) + 1}`,
             tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
-            metadata: {
-              priority: (i % 3) + 1,
-              active: i % 2 === 0,
-            },
+            metadata: {},
           })),
         });

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:122:25
             category: `Category ${Math.floor(i / 10) + 1}`,
             tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
             metadata: {
-              priority: (i % 3) + 1,
+              priority: i % 3 - 1,
               active: i % 2 === 0,
             },

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:122:26
             category: `Category ${Math.floor(i / 10) + 1}`,
             tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
             metadata: {
-              priority: (i % 3) + 1,
+              priority: (i * 3) + 1,
               active: i % 2 === 0,
             },

[Survived] EqualityOperator
src/utils/TestDataGenerator.ts:123:23
             tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
             metadata: {
               priority: (i % 3) + 1,
-              active: i % 2 === 0,
+              active: i % 2 !== 0,
             },
           })),

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:123:23
             tags: [`tag${(i % 5) + 1}`, `tag${(i % 3) + 1}`],
             metadata: {
               priority: (i % 3) + 1,
-              active: i % 2 === 0,
+              active: false,
             },
           })),

[Survived] BlockStatement
src/utils/TestDataGenerator.ts:136:13
   private generateCSVTestData(
     size: DataSize,
     options: TestDataOptions & { correlationId: string; timestamp: Date }
-  ): string {
-    const headers = 'id,name,value,category,timestamp,correlation_id\n';
-    const rows = [];
-
-    const rowCount = size === 'small' ? 5 : size === 'medium' ? 20 : 100;
-
-    for (let i = 1; i <= rowCount; i++) {
-      rows.push(
-        `${i},Item ${i},${Math.random() * 100},Category ${Math.floor(i / 5) + 1},${options.timestamp.toISOString()},${options.correlationId}`
-      );
-    }
-
-    return headers + rows.join('\n');
-  }
+  ): string {}
 
   /**

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:140:45
     const headers = 'id,name,value,category,timestamp,correlation_id\n';
     const rows = [];
 
-    const rowCount = size === 'small' ? 5 : size === 'medium' ? 20 : 100;
+    const rowCount = size === 'small' ? 5 : true ? 20 : 100;
 
     for (let i = 1; i <= rowCount; i++) {

[Survived] EqualityOperator
src/utils/TestDataGenerator.ts:140:45
     const headers = 'id,name,value,category,timestamp,correlation_id\n';
     const rows = [];
 
-    const rowCount = size === 'small' ? 5 : size === 'medium' ? 20 : 100;
+    const rowCount = size === 'small' ? 5 : size !== 'medium' ? 20 : 100;
 
     for (let i = 1; i <= rowCount; i++) {

[Survived] BlockStatement
src/utils/TestDataGenerator.ts:142:41
 
     const rowCount = size === 'small' ? 5 : size === 'medium' ? 20 : 100;
 
-    for (let i = 1; i <= rowCount; i++) {
-      rows.push(
-        `${i},Item ${i},${Math.random() * 100},Category ${Math.floor(i / 5) + 1},${options.timestamp.toISOString()},${options.correlationId}`
-      );
-    }
+    for (let i = 1; i <= rowCount; i++) {}
 
     return headers + rows.join('\n');

[Survived] EqualityOperator
src/utils/TestDataGenerator.ts:142:21
 
     const rowCount = size === 'small' ? 5 : size === 'medium' ? 20 : 100;
 
-    for (let i = 1; i <= rowCount; i++) {
+    for (let i = 1; i < rowCount; i++) {
       rows.push(
         `${i},Item ${i},${Math.random() * 100},Category ${Math.floor(i / 5) + 1},${options.timestamp.toISOString()},${options.correlationId}`

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:144:70
 
     for (let i = 1; i <= rowCount; i++) {
       rows.push(
-        `${i},Item ${i},${Math.random() * 100},Category ${Math.floor(i / 5) + 1},${options.timestamp.toISOString()},${options.correlationId}`
+        `${i},Item ${i},${Math.random() * 100},Category ${Math.floor(i * 5) + 1},${options.timestamp.toISOString()},${options.correlationId}`
       );
     }

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:144:27
 
     for (let i = 1; i <= rowCount; i++) {
       rows.push(
-        `${i},Item ${i},${Math.random() * 100},Category ${Math.floor(i / 5) + 1},${options.timestamp.toISOString()},${options.correlationId}`
+        `${i},Item ${i},${Math.random() / 100},Category ${Math.floor(i / 5) + 1},${options.timestamp.toISOString()},${options.correlationId}`
       );
     }

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:148:12
       );
     }
 
-    return headers + rows.join('\n');
+    return headers - rows.join('\n');
   }
 

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:158:23
     size: DataSize,
     options: TestDataOptions & { correlationId: string; timestamp: Date }
   ): string {
-    const itemCount = size === 'small' ? 3 : size === 'medium' ? 10 : 50;
+    const itemCount = true ? 3 : size === 'medium' ? 10 : 50;
     const items = Array.from(
       { length: itemCount },

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:158:46
     size: DataSize,
     options: TestDataOptions & { correlationId: string; timestamp: Date }
   ): string {
-    const itemCount = size === 'small' ? 3 : size === 'medium' ? 10 : 50;
+    const itemCount = size === 'small' ? 3 : true ? 10 : 50;
     const items = Array.from(
       { length: itemCount },

[Survived] ObjectLiteral
src/utils/TestDataGenerator.ts:160:7
   ): string {
     const itemCount = size === 'small' ? 3 : size === 'medium' ? 10 : 50;
     const items = Array.from(
-      { length: itemCount },
+      {},
       (_, i) => `
     <item id="${i + 1}">

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:161:7
     const itemCount = size === 'small' ? 3 : size === 'medium' ? 10 : 50;
     const items = Array.from(
       { length: itemCount },
-      (_, i) => `
-    <item id="${i + 1}">
-      <name>Item ${i + 1}</name>
-      <value>${Math.random() * 100}</value>
-      <category>Category ${Math.floor(i / 5) + 1}</category>
-      <timestamp>${options.timestamp.toISOString()}</timestamp>
-      <correlation_id>${options.correlationId}</correlation_id>
-    </item>`
+      () => undefined
     ).join('');
 

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:162:17
     const items = Array.from(
       { length: itemCount },
       (_, i) => `
-    <item id="${i + 1}">
+    <item id="${i - 1}">
       <name>Item ${i + 1}</name>
       <value>${Math.random() * 100}</value>

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:163:20
       { length: itemCount },
       (_, i) => `
     <item id="${i + 1}">
-      <name>Item ${i + 1}</name>
+      <name>Item ${i - 1}</name>
       <value>${Math.random() * 100}</value>
       <category>Category ${Math.floor(i / 5) + 1}</category>

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:164:16
       (_, i) => `
     <item id="${i + 1}">
       <name>Item ${i + 1}</name>
-      <value>${Math.random() * 100}</value>
+      <value>${Math.random() / 100}</value>
       <category>Category ${Math.floor(i / 5) + 1}</category>
       <timestamp>${options.timestamp.toISOString()}</timestamp>

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:165:28
     <item id="${i + 1}">
       <name>Item ${i + 1}</name>
       <value>${Math.random() * 100}</value>
-      <category>Category ${Math.floor(i / 5) + 1}</category>
+      <category>Category ${Math.floor(i / 5) - 1}</category>
       <timestamp>${options.timestamp.toISOString()}</timestamp>
       <correlation_id>${options.correlationId}</correlation_id>

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:165:39
     <item id="${i + 1}">
       <name>Item ${i + 1}</name>
       <value>${Math.random() * 100}</value>
-      <category>Category ${Math.floor(i / 5) + 1}</category>
+      <category>Category ${Math.floor(i * 5) + 1}</category>
       <timestamp>${options.timestamp.toISOString()}</timestamp>
       <correlation_id>${options.correlationId}</correlation_id>

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:181:12
   </metadata>`
       : '';
 
-    return `<?xml version="1.0" encoding="UTF-8"?>
-<testdata>
-  <correlation_id>${options.correlationId}</correlation_id>
-  <timestamp>${options.timestamp.toISOString()}</timestamp>${metadata}
-  <items>${items}
-  </items>
-</testdata>`;
+    return ``;
   }
 

[Survived] EqualityOperator
src/utils/TestDataGenerator.ts:197:47
     size: DataSize,
     options: TestDataOptions & { correlationId: string; timestamp: Date }
   ): string {
-    const wordCount = size === 'small' ? 10 : size === 'medium' ? 50 : 200;
+    const wordCount = size === 'small' ? 10 : size !== 'medium' ? 50 : 200;
     const words = [
       'lorem',

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:197:47
     size: DataSize,
     options: TestDataOptions & { correlationId: string; timestamp: Date }
   ): string {
-    const wordCount = size === 'small' ? 10 : size === 'medium' ? 50 : 200;
+    const wordCount = size === 'small' ? 10 : true ? 50 : 200;
     const words = [
       'lorem',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:200:7
     const wordCount = size === 'small' ? 10 : size === 'medium' ? 50 : 200;
     const words = [
       'lorem',
-      'ipsum',
+      "",
       'dolor',
       'sit',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:202:7
       'lorem',
       'ipsum',
       'dolor',
-      'sit',
+      "",
       'amet',
       'consectetur',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:207:7
       'consectetur',
       'adipiscing',
       'elit',
-      'sed',
+      "",
       'do',
       'eiusmod',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:208:7
       'adipiscing',
       'elit',
       'sed',
-      'do',
+      "",
       'eiusmod',
       'tempor',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:209:7
       'elit',
       'sed',
       'do',
-      'eiusmod',
+      "",
       'tempor',
       'incididunt',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:210:7
       'sed',
       'do',
       'eiusmod',
-      'tempor',
+      "",
       'incididunt',
       'ut',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:212:7
       'eiusmod',
       'tempor',
       'incididunt',
-      'ut',
+      "",
       'labore',
       'et',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:215:7
       'ut',
       'labore',
       'et',
-      'dolore',
+      "",
       'magna',
       'aliqua',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:220:7
       'aliqua',
       'ut',
       'enim',
-      'ad',
+      "",
       'minim',
       'veniam',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:226:7
       'quis',
       'nostrud',
       'exercitation',
-      'ullamco',
+      "",
       'laboris',
       'nisi',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:227:7
       'nostrud',
       'exercitation',
       'ullamco',
-      'laboris',
+      "",
       'nisi',
       'ut',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:228:7
       'exercitation',
       'ullamco',
       'laboris',
-      'nisi',
+      "",
       'ut',
       'aliquip',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:229:7
       'ullamco',
       'laboris',
       'nisi',
-      'ut',
+      "",
       'aliquip',
       'ex',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:231:7
       'nisi',
       'ut',
       'aliquip',
-      'ex',
+      "",
       'ea',
       'commodo',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:235:7
       'ea',
       'commodo',
       'consequat',
-      'duis',
+      "",
       'aute',
       'irure',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:237:7
       'consequat',
       'duis',
       'aute',
-      'irure',
+      "",
       'dolor',
       'in',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:241:7
       'dolor',
       'in',
       'reprehenderit',
-      'voluptate',
+      "",
       'velit',
       'esse',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:242:7
       'in',
       'reprehenderit',
       'voluptate',
-      'velit',
+      "",
       'esse',
       'cillum',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:250:7
       'fugiat',
       'nulla',
       'pariatur',
-      'excepteur',
+      "",
       'sint',
       'occaecat',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:251:7
       'nulla',
       'pariatur',
       'excepteur',
-      'sint',
+      "",
       'occaecat',
       'cupidatat',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:252:7
       'pariatur',
       'excepteur',
       'sint',
-      'occaecat',
+      "",
       'cupidatat',
       'non',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:255:7
       'occaecat',
       'cupidatat',
       'non',
-      'proident',
+      "",
       'sunt',
       'culpa',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:259:7
       'sunt',
       'culpa',
       'qui',
-      'officia',
+      "",
       'deserunt',
       'mollit',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:264:7
       'mollit',
       'anim',
       'id',
-      'est',
+      "",
       'laborum',
       'sed',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:266:7
       'id',
       'est',
       'laborum',
-      'sed',
+      "",
       'ut',
       'perspiciatis',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:270:7
       'ut',
       'perspiciatis',
       'unde',
-      'omnis',
+      "",
       'iste',
       'natus',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:273:7
       'omnis',
       'iste',
       'natus',
-      'error',
+      "",
       'sit',
       'voluptatem',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:274:7
       'iste',
       'natus',
       'error',
-      'sit',
+      "",
       'voluptatem',
       'accusantium',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:277:7
       'sit',
       'voluptatem',
       'accusantium',
-      'doloremque',
+      "",
       'laudantium',
       'totam',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:278:7
       'voluptatem',
       'accusantium',
       'doloremque',
-      'laudantium',
+      "",
       'totam',
       'rem',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:280:7
       'doloremque',
       'laudantium',
       'totam',
-      'rem',
+      "",
       'aperiam',
       'eaque',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:288:7
       'ab',
       'illo',
       'inventore',
-      'veritatis',
+      "",
       'et',
       'quasi',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:296:7
       'vitae',
       'dicta',
       'sunt',
-      'explicabo',
+      "",
       'nemo',
       'enim',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:297:7
       'dicta',
       'sunt',
       'explicabo',
-      'nemo',
+      "",
       'enim',
       'ipsam',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:304:7
       'quia',
       'voluptas',
       'sit',
-      'aspernatur',
+      "",
       'aut',
       'odit',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:307:7
       'aspernatur',
       'aut',
       'odit',
-      'aut',
+      "",
       'fugit',
       'sed',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:310:7
       'aut',
       'fugit',
       'sed',
-      'quia',
+      "",
       'consequuntur',
       'magni',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:313:7
       'quia',
       'consequuntur',
       'magni',
-      'dolores',
+      "",
       'eos',
       'qui',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:315:7
       'magni',
       'dolores',
       'eos',
-      'qui',
+      "",
       'ratione',
       'voluptatem',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:318:7
       'qui',
       'ratione',
       'voluptatem',
-      'sequi',
+      "",
       'nesciunt',
       'neque',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:321:7
       'sequi',
       'nesciunt',
       'neque',
-      'porro',
+      "",
       'quisquam',
       'est',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:322:7
       'nesciunt',
       'neque',
       'porro',
-      'quisquam',
+      "",
       'est',
       'qui',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:325:7
       'quisquam',
       'est',
       'qui',
-      'dolorem',
+      "",
       'ipsum',
       'quia',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:328:7
       'dolorem',
       'ipsum',
       'quia',
-      'dolor',
+      "",
       'sit',
       'amet',
