[Survived] StringLiteral
src/utils/TestDataGenerator.ts:330:7
       'quia',
       'dolor',
       'sit',
-      'amet',
+      "",
       'consectetur',
       'adipisci',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:331:7
       'dolor',
       'sit',
       'amet',
-      'consectetur',
+      "",
       'adipisci',
       'velit',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:332:7
       'sit',
       'amet',
       'consectetur',
-      'adipisci',
+      "",
       'velit',
       'sed',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:334:7
       'consectetur',
       'adipisci',
       'velit',
-      'sed',
+      "",
       'quia',
       'non',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:338:7
       'quia',
       'non',
       'numquam',
-      'eius',
+      "",
       'modi',
       'tempora',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:342:7
       'modi',
       'tempora',
       'incidunt',
-      'ut',
+      "",
       'labore',
       'et',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:343:7
       'tempora',
       'incidunt',
       'ut',
-      'labore',
+      "",
       'et',
       'dolore',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:354:7
       'enim',
       'ad',
       'minima',
-      'veniam',
+      "",
       'quis',
       'nostrum',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:355:7
       'ad',
       'minima',
       'veniam',
-      'quis',
+      "",
       'nostrum',
       'exercitationem',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:357:7
       'veniam',
       'quis',
       'nostrum',
-      'exercitationem',
+      "",
       'ullam',
       'corporis',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:362:7
       'corporis',
       'suscipit',
       'laboriosam',
-      'nisi',
+      "",
       'ut',
       'aliquid',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:366:7
       'ut',
       'aliquid',
       'ex',
-      'ea',
+      "",
       'commodi',
       'consequatur',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:369:7
       'ea',
       'commodi',
       'consequatur',
-      'quis',
+      "",
       'autem',
       'vel',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:372:7
       'quis',
       'autem',
       'vel',
-      'eum',
+      "",
       'iure',
       'reprehenderit',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:373:7
       'autem',
       'vel',
       'eum',
-      'iure',
+      "",
       'reprehenderit',
       'qui',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:375:7
       'eum',
       'iure',
       'reprehenderit',
-      'qui',
+      "",
       'in',
       'ea',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:376:7
       'iure',
       'reprehenderit',
       'qui',
-      'in',
+      "",
       'ea',
       'voluptate',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:378:7
       'qui',
       'in',
       'ea',
-      'voluptate',
+      "",
       'velit',
       'esse',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:380:7
       'ea',
       'voluptate',
       'velit',
-      'esse',
+      "",
       'quam',
       'nihil',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:384:7
       'quam',
       'nihil',
       'molestiae',
-      'consequatur',
+      "",
       'vel',
       'illum',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:385:7
       'nihil',
       'molestiae',
       'consequatur',
-      'vel',
+      "",
       'illum',
       'qui',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:387:7
       'consequatur',
       'vel',
       'illum',
-      'qui',
+      "",
       'dolorem',
       'eum',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:389:7
       'illum',
       'qui',
       'dolorem',
-      'eum',
+      "",
       'fugiat',
       'quo',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:390:7
       'qui',
       'dolorem',
       'eum',
-      'fugiat',
+      "",
       'quo',
       'voluptas',

[Survived] UpdateOperator
src/utils/TestDataGenerator.ts:398:36
     ];
 
     const result = [];
-    for (let i = 0; i < wordCount; i++) {
+    for (let i = 0; i < wordCount; i--) {
       result.push(words[Math.floor(Math.random() * words.length)]);
     }

[Survived] BlockStatement
src/utils/TestDataGenerator.ts:398:41
     ];
 
     const result = [];
-    for (let i = 0; i < wordCount; i++) {
-      result.push(words[Math.floor(Math.random() * words.length)]);
-    }
+    for (let i = 0; i < wordCount; i++) {}
 
     let text = `${result.join(' ')}.`;

[Survived] ArithmeticOperator
src/utils/TestDataGenerator.ts:399:36
 
     const result = [];
     for (let i = 0; i < wordCount; i++) {
-      result.push(words[Math.floor(Math.random() * words.length)]);
+      result.push(words[Math.floor(Math.random() / words.length)]);
     }
 

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:402:31
       result.push(words[Math.floor(Math.random() * words.length)]);
     }
 
-    let text = `${result.join(' ')}.`;
+    let text = `${result.join("")}.`;
 
     if (options.includeMetadata) {

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:402:16
       result.push(words[Math.floor(Math.random() * words.length)]);
     }
 
-    let text = `${result.join(' ')}.`;
+    let text = ``;
 
     if (options.includeMetadata) {

[Survived] BlockStatement
src/utils/TestDataGenerator.ts:404:34
 
     let text = `${result.join(' ')}.`;
 
-    if (options.includeMetadata) {
-      text += `\n\n---\nCorrelation ID: ${options.correlationId}\nTimestamp: ${options.timestamp.toISOString()}\nSize: ${size}`;
-    }
+    if (options.includeMetadata) {}
 
     return text;

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:404:9
 
     let text = `${result.join(' ')}.`;
 
-    if (options.includeMetadata) {
+    if (false) {
       text += `\n\n---\nCorrelation ID: ${options.correlationId}\nTimestamp: ${options.timestamp.toISOString()}\nSize: ${size}`;
     }

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:418:27
     size: DataSize = 'small',
     options: TestDataOptions = {}
   ): string {
-    const correlationId = options.correlationId || this.generateCorrelationId();
+    const correlationId = true;
     const timestamp = options.timestamp || new Date();
 

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:424:25
     const eventData = {
       Records: [
         {
-          eventVersion: '2.1',
+          eventVersion: "",
           eventSource: 'aws:s3',
           awsRegion: 'us-east-1',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:425:24
       Records: [
         {
           eventVersion: '2.1',
-          eventSource: 'aws:s3',
+          eventSource: "",
           awsRegion: 'us-east-1',
           eventTime: timestamp.toISOString(),

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:426:22
         {
           eventVersion: '2.1',
           eventSource: 'aws:s3',
-          awsRegion: 'us-east-1',
+          awsRegion: "",
           eventTime: timestamp.toISOString(),
           eventName: 'ObjectCreated:Put',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:430:30
           eventTime: timestamp.toISOString(),
           eventName: 'ObjectCreated:Put',
           s3: {
-            s3SchemaVersion: '1.0',
+            s3SchemaVersion: "",
             configurationId: 'test-config',
             bucket: {

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:433:21
             s3SchemaVersion: '1.0',
             configurationId: 'test-config',
             bucket: {
-              name: 'test-bucket',
+              name: "",
               ownerIdentity: {
                 principalId: 'test-owner',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:440:20
               arn: 'arn:aws:s3:::test-bucket',
             },
             object: {
-              key: `test-file-${correlationId}.json`,
+              key: ``,
               size:
                 size === 'small' ? 1024 : size === 'medium' ? 10240 : 102400,

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:442:17
             object: {
               key: `test-file-${correlationId}.json`,
               size:
-                size === 'small' ? 1024 : size === 'medium' ? 10240 : 102400,
+                true ? 1024 : size === 'medium' ? 10240 : 102400,
               eTag: `etag-${correlationId}`,
               sequencer: '0A1B2C3D4E5F678901',

[Survived] ConditionalExpression
src/utils/TestDataGenerator.ts:442:43
             object: {
               key: `test-file-${correlationId}.json`,
               size:
-                size === 'small' ? 1024 : size === 'medium' ? 10240 : 102400,
+                size === 'small' ? 1024 : true ? 10240 : 102400,
               eTag: `etag-${correlationId}`,
               sequencer: '0A1B2C3D4E5F678901',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:444:26
               size:
                 size === 'small' ? 1024 : size === 'medium' ? 10240 : 102400,
               eTag: `etag-${correlationId}`,
-              sequencer: '0A1B2C3D4E5F678901',
+              sequencer: "",
             },
           },

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:458:22
    * Generate SQS message data
    */
   generateSQSMessageData(
-    size: DataSize = 'small',
+    size: DataSize = "",
     options: TestDataOptions = {}
   ): string {

[Survived] BlockStatement
src/utils/TestDataGenerator.ts:460:13
   generateSQSMessageData(
     size: DataSize = 'small',
     options: TestDataOptions = {}
-  ): string {
-    const correlationId = options.correlationId || this.generateCorrelationId();
-    const timestamp = options.timestamp || new Date();
-
-    const messageData = {
-      correlationId,
-      timestamp: timestamp.toISOString(),
-      messageType: 'test-message',
-      data: this.generateTestData('json', size, {
-        correlationId,
-        timestamp,
-        ...options,
-      }),
-      metadata: options.includeMetadata
-        ? {
-            source: 'aws-testing-framework',
-            version: '1.0.0',
-            size,
-          }
-        : undefined,
-    };
-
-    return JSON.stringify(messageData, null, 2);
-  }
+  ): string {}
 
   /**

[Survived] ObjectLiteral
src/utils/TestDataGenerator.ts:464:25
     const correlationId = options.correlationId || this.generateCorrelationId();
     const timestamp = options.timestamp || new Date();
 
-    const messageData = {
-      correlationId,
-      timestamp: timestamp.toISOString(),
-      messageType: 'test-message',
-      data: this.generateTestData('json', size, {
-        correlationId,
-        timestamp,
-        ...options,
-      }),
-      metadata: options.includeMetadata
-        ? {
-            source: 'aws-testing-framework',
-            version: '1.0.0',
-            size,
-          }
-        : undefined,
-    };
+    const messageData = {};
 
     return JSON.stringify(messageData, null, 2);

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:467:20
     const messageData = {
       correlationId,
       timestamp: timestamp.toISOString(),
-      messageType: 'test-message',
+      messageType: "",
       data: this.generateTestData('json', size, {
         correlationId,

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:476:22
       metadata: options.includeMetadata
         ? {
             source: 'aws-testing-framework',
-            version: '1.0.0',
+            version: "",
             size,
           }

[Survived] LogicalOperator
src/utils/TestDataGenerator.ts:493:23
     options: TestDataOptions = {}
   ): string {
     const correlationId = options.correlationId || this.generateCorrelationId();
-    const timestamp = options.timestamp || new Date();
+    const timestamp = options.timestamp && new Date();
 
     const payloadData = {

[Survived] ObjectLiteral
src/utils/TestDataGenerator.ts:495:25
     const correlationId = options.correlationId || this.generateCorrelationId();
     const timestamp = options.timestamp || new Date();
 
-    const payloadData = {
-      correlationId,
-      timestamp: timestamp.toISOString(),
-      event: this.generateS3EventData(size, {
-        correlationId,
-        timestamp,
-        ...options,
-      }),
-      context: {
-        functionName: 'test-lambda-function',
-        functionVersion: '$LATEST',
-        invokedFunctionArn:
-          'arn:aws:lambda:us-east-1:123456789012:function:test-lambda-function',
-        memoryLimitInMB: '128',
-        awsRequestId: `req-${correlationId}`,
-        logGroupName: '/aws/lambda/test-lambda-function',
-        logStreamName: `2024/01/15/[$LATEST]${correlationId}`,
-        remainingTimeInMillis: 30000,
-      },
-    };
+    const payloadData = {};
 
     return JSON.stringify(payloadData, null, 2);

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:504:23
         ...options,
       }),
       context: {
-        functionName: 'test-lambda-function',
+        functionName: "",
         functionVersion: '$LATEST',
         invokedFunctionArn:

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:508:26
         functionVersion: '$LATEST',
         invokedFunctionArn:
           'arn:aws:lambda:us-east-1:123456789012:function:test-lambda-function',
-        memoryLimitInMB: '128',
+        memoryLimitInMB: "",
         awsRequestId: `req-${correlationId}`,
         logGroupName: '/aws/lambda/test-lambda-function',

[Survived] ObjectLiteral
src/utils/TestDataGenerator.ts:529:23
     const correlationId = options.correlationId || this.generateCorrelationId();
     const timestamp = options.timestamp || new Date();
 
-    const inputData = {
-      correlationId,
-      timestamp: timestamp.toISOString(),
-      executionId: `exec-${correlationId}`,
-      data: this.generateTestData('json', size, {
-        correlationId,
-        timestamp,
-        ...options,
-      }),
-      workflow: {
-        name: 'test-workflow',
-        version: '1.0.0',
-        steps: ['process', 'validate', 'complete'],
-      },
-      metadata: options.includeMetadata
-        ? {
-            source: 'aws-testing-framework',
-            environment: 'test',
-            size,
-          }
-        : undefined,
-    };
+    const inputData = {};
 
     return JSON.stringify(inputData, null, 2);

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:532:20
     const inputData = {
       correlationId,
       timestamp: timestamp.toISOString(),
-      executionId: `exec-${correlationId}`,
+      executionId: ``,
       data: this.generateTestData('json', size, {
         correlationId,

[Survived] ObjectLiteral
src/utils/TestDataGenerator.ts:533:49
       correlationId,
       timestamp: timestamp.toISOString(),
       executionId: `exec-${correlationId}`,
-      data: this.generateTestData('json', size, {
-        correlationId,
-        timestamp,
-        ...options,
-      }),
+      data: this.generateTestData('json', size, {}),
       workflow: {
         name: 'test-workflow',

[Survived] StringLiteral
src/utils/TestDataGenerator.ts:546:26
       metadata: options.includeMetadata
         ? {
             source: 'aws-testing-framework',
-            environment: 'test',
+            environment: "",
             size,
           }

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:560:33
 export const testDataGenerator = new TestDataGenerator();
 
 // Export individual functions for direct use
-export const generateTestData = (
-  type: DataType,
-  size: DataSize = 'small',
-  options?: TestDataOptions
-) => testDataGenerator.generateTestData(type, size, options);
+export const generateTestData = () => undefined;
 
 export const generateS3EventData = (

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:566:36
   options?: TestDataOptions
 ) => testDataGenerator.generateTestData(type, size, options);
 
-export const generateS3EventData = (
-  size: DataSize = 'small',
-  options?: TestDataOptions
-) => testDataGenerator.generateS3EventData(size, options);
+export const generateS3EventData = () => undefined;
 
 export const generateSQSMessageData = (

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:571:39
   options?: TestDataOptions
 ) => testDataGenerator.generateS3EventData(size, options);
 
-export const generateSQSMessageData = (
-  size: DataSize = 'small',
-  options?: TestDataOptions
-) => testDataGenerator.generateSQSMessageData(size, options);
+export const generateSQSMessageData = () => undefined;
 
 export const generateLambdaPayloadData = (

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:576:42
   options?: TestDataOptions
 ) => testDataGenerator.generateSQSMessageData(size, options);
 
-export const generateLambdaPayloadData = (
-  size: DataSize = 'small',
-  options?: TestDataOptions
-) => testDataGenerator.generateLambdaPayloadData(size, options);
+export const generateLambdaPayloadData = () => undefined;
 
 export const generateStepFunctionInputData = (

[Survived] ArrowFunction
src/utils/TestDataGenerator.ts:581:46
   options?: TestDataOptions
 ) => testDataGenerator.generateLambdaPayloadData(size, options);
 
-export const generateStepFunctionInputData = (
-  size: DataSize = 'small',
-  options?: TestDataOptions
-) => testDataGenerator.generateStepFunctionInputData(size, options);
+export const generateStepFunctionInputData = () => undefined;
 
