[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:54:17
   private sfnClient: SFNClient;
   private reporter: TestReporter;
 
-  constructor() {
-    this.s3Client = new S3Client({});
-    this.sqsClient = new SQSClient({});
-    this.lambdaClient = new LambdaClient({});
-    this.sfnClient = new SFNClient({});
-    this.reporter = new TestReporter();
-  }
+  constructor() {}
 
   configureReporter(_outputDir?: string) {
killedBy: AWSTestingFramework S3 Operations should create a bucket
statusReason: TypeError: Cannot read properties of undefined (reading 'send')

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:71:57
     return this.reporter;
   }
 
-  async createBucket(bucketName: string): Promise<void> {
-    await this.s3Client.send(new CreateBucketCommand({ Bucket: bucketName }));
-  }
+  async createBucket(bucketName: string): Promise<void> {}
 
   async findBucket(bucketName: string): Promise<void> {
killedBy: AWSTestingFramework S3 Operations should create a bucket
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:75:55
     await this.s3Client.send(new CreateBucketCommand({ Bucket: bucketName }));
   }
 
-  async findBucket(bucketName: string): Promise<void> {
-    const command = new ListBucketsCommand({});
-    const response = await this.s3Client.send(command);
-    const bucket = response.Buckets?.find((bucket) => bucket.Name === bucketName);
-    if (!bucket) {
-      throw new Error(`Bucket ${bucketName} not found`);
-    }
-  }
+  async findBucket(bucketName: string): Promise<void> {}
 
   async uploadFile(bucketName: string, fileName: string, content: string): Promise<void> {

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:78:55
   async findBucket(bucketName: string): Promise<void> {
     const command = new ListBucketsCommand({});
     const response = await this.s3Client.send(command);
-    const bucket = response.Buckets?.find((bucket) => bucket.Name === bucketName);
+    const bucket = response.Buckets?.find((bucket) => bucket.Name !== bucketName);
     if (!bucket) {
       throw new Error(`Bucket ${bucketName} not found`);

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:78:55
   async findBucket(bucketName: string): Promise<void> {
     const command = new ListBucketsCommand({});
     const response = await this.s3Client.send(command);
-    const bucket = response.Buckets?.find((bucket) => bucket.Name === bucketName);
+    const bucket = response.Buckets?.find((bucket) => false);
     if (!bucket) {
       throw new Error(`Bucket ${bucketName} not found`);

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:79:9
     const command = new ListBucketsCommand({});
     const response = await this.s3Client.send(command);
     const bucket = response.Buckets?.find((bucket) => bucket.Name === bucketName);
-    if (!bucket) {
+    if (true) {
       throw new Error(`Bucket ${bucketName} not found`);
     }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:79:9
     const command = new ListBucketsCommand({});
     const response = await this.s3Client.send(command);
     const bucket = response.Buckets?.find((bucket) => bucket.Name === bucketName);
-    if (!bucket) {
+    if (false) {
       throw new Error(`Bucket ${bucketName} not found`);
     }

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:84:90
     }
   }
 
-  async uploadFile(bucketName: string, fileName: string, content: string): Promise<void> {
-    await this.s3Client.send(
-      new PutObjectCommand({
-        Bucket: bucketName,
-        Key: fileName,
-        Body: content,
-      })
-    );
-  }
+  async uploadFile(bucketName: string, fileName: string, content: string): Promise<void> {}
 
   async checkFileExists(bucketName: string, fileName: string): Promise<boolean> {
killedBy: AWSTestingFramework S3 Operations should upload a file to S3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:94:81
     );
   }
 
-  async checkFileExists(bucketName: string, fileName: string): Promise<boolean> {
-    try {
-      await this.s3Client.send(
-        new HeadObjectCommand({
-          Bucket: bucketName,
-          Key: fileName,
-        })
-      );
-      return true;
-    } catch (_error) {
-      return false;
-    }
-  }
+  async checkFileExists(bucketName: string, fileName: string): Promise<boolean> {}
 
   async createQueue(queueName: string): Promise<string> {
killedBy: AWSTestingFramework S3 Operations should check if a file exists in S3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:95:9
   }
 
   async checkFileExists(bucketName: string, fileName: string): Promise<boolean> {
-    try {
-      await this.s3Client.send(
-        new HeadObjectCommand({
-          Bucket: bucketName,
-          Key: fileName,
-        })
-      );
-      return true;
-    } catch (_error) {
+    try {} catch (_error) {
       return false;
     }
killedBy: AWSTestingFramework S3 Operations should check if a file exists in S3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:103:22
         })
       );
       return true;
-    } catch (_error) {
-      return false;
-    }
+    } catch (_error) {}
   }
 

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:104:14
       );
       return true;
     } catch (_error) {
-      return false;
+      return true;
     }
   }

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:108:57
     }
   }
 
-  async createQueue(queueName: string): Promise<string> {
-    const response = await this.sqsClient.send(
-      new CreateQueueCommand({
-        QueueName: queueName,
-      })
-    );
-    return response.QueueUrl || '';
-  }
+  async createQueue(queueName: string): Promise<string> {}
 
   async findQueue(queueName: string): Promise<string> {
killedBy: AWSTestingFramework SQS Operations should create a queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://sqs.us-east-1.amazonaws.com/123456789012/test-queue"
Received: undefined

[Killed] ObjectLiteral
src/framework/AWSTestingFramework.ts:110:30
 
   async createQueue(queueName: string): Promise<string> {
     const response = await this.sqsClient.send(
-      new CreateQueueCommand({
-        QueueName: queueName,
-      })
+      new CreateQueueCommand({})
     );
     return response.QueueUrl || '';
killedBy: AWSTestingFramework SQS Operations should create a queue
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "QueueName": "test-queue",
- }

[Killed] ConditionalExpression
src/framework/AWSTestingFramework.ts:114:12
         QueueName: queueName,
       })
     );
-    return response.QueueUrl || '';
+    return true;
   }
 
killedBy: AWSTestingFramework SQS Operations should create a queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://sqs.us-east-1.amazonaws.com/123456789012/test-queue"
Received: true

[Killed] LogicalOperator
src/framework/AWSTestingFramework.ts:114:12
         QueueName: queueName,
       })
     );
-    return response.QueueUrl || '';
+    return response.QueueUrl && '';
   }
 
killedBy: AWSTestingFramework SQS Operations should create a queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://sqs.us-east-1.amazonaws.com/123456789012/test-queue"
Received: ""

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:117:55
     return response.QueueUrl || '';
   }
 
-  async findQueue(queueName: string): Promise<string> {
-    const command = new ListQueuesCommand({});
-    const response = await this.sqsClient.send(command);
-    const queue = response.QueueUrls?.find((queue) => queue.includes(queueName));
-    return queue ?? '';
-  }
+  async findQueue(queueName: string): Promise<string> {}
 
   async sendMessage(queueUrl: string, message: string): Promise<void> {

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:120:44
   async findQueue(queueName: string): Promise<string> {
     const command = new ListQueuesCommand({});
     const response = await this.sqsClient.send(command);
-    const queue = response.QueueUrls?.find((queue) => queue.includes(queueName));
+    const queue = response.QueueUrls?.find(() => undefined);
     return queue ?? '';
   }

[Survived] OptionalChaining
src/framework/AWSTestingFramework.ts:120:19
   async findQueue(queueName: string): Promise<string> {
     const command = new ListQueuesCommand({});
     const response = await this.sqsClient.send(command);
-    const queue = response.QueueUrls?.find((queue) => queue.includes(queueName));
+    const queue = response.QueueUrls.find((queue) => queue.includes(queueName));
     return queue ?? '';
   }

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:121:12
     const command = new ListQueuesCommand({});
     const response = await this.sqsClient.send(command);
     const queue = response.QueueUrls?.find((queue) => queue.includes(queueName));
-    return queue ?? '';
+    return queue && '';
   }
 

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:121:21
     const command = new ListQueuesCommand({});
     const response = await this.sqsClient.send(command);
     const queue = response.QueueUrls?.find((queue) => queue.includes(queueName));
-    return queue ?? '';
+    return queue ?? "Stryker was here!";
   }
 

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:133:77
     );
   }
 
-  async receiveMessage(queueUrl: string): Promise<{ Body?: string } | null> {
-    const response = await this.sqsClient.send(
-      new ReceiveMessageCommand({
-        QueueUrl: queueUrl,
-        MaxNumberOfMessages: 1,
-        WaitTimeSeconds: 1,
-      })
-    );
-    return response.Messages?.[0] ?? null;
-  }
+  async receiveMessage(queueUrl: string): Promise<{ Body?: string } | null> {}
 
   async getUnreadMessageCount(queueUrl: string): Promise<number> {
killedBy: AWSTestingFramework SQS Operations should receive messages from a queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test message"
Received: undefined

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:144:66
     return response.Messages?.[0] ?? null;
   }
 
-  async getUnreadMessageCount(queueUrl: string): Promise<number> {
-    const response = await this.sqsClient.send(
-      new GetQueueAttributesCommand({
-        QueueUrl: queueUrl,
-        AttributeNames: ['ApproximateNumberOfMessages'],
-      })
-    );
-    return Number.parseInt(response.Attributes?.ApproximateNumberOfMessages || '0', 10);
-  }
+  async getUnreadMessageCount(queueUrl: string): Promise<number> {}
 
   async createFunction(functionName: string, handler: string): Promise<void> {

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:151:28
         AttributeNames: ['ApproximateNumberOfMessages'],
       })
     );
-    return Number.parseInt(response.Attributes?.ApproximateNumberOfMessages || '0', 10);
+    return Number.parseInt(response.Attributes?.ApproximateNumberOfMessages && '0', 10);
   }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:151:28
         AttributeNames: ['ApproximateNumberOfMessages'],
       })
     );
-    return Number.parseInt(response.Attributes?.ApproximateNumberOfMessages || '0', 10);
+    return Number.parseInt(false, 10);
   }
 

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:154:78
     return Number.parseInt(response.Attributes?.ApproximateNumberOfMessages || '0', 10);
   }
 
-  async createFunction(functionName: string, handler: string): Promise<void> {
-    // This is a simplified version. In a real implementation, you would need to provide
-    // the function code, runtime, role, etc.
-    await this.lambdaClient.send(
-      new CreateFunctionCommand({
-        FunctionName: functionName,
-        Handler: handler,
-        Role: 'arn:aws:iam::123456789012:role/lambda-role', // Replace with actual role
-        Runtime: 'nodejs18.x',
-        Code: {
-          ZipFile: Uint8ArrayBlobAdapter.from(
-            'exports.handler = async () => { return "Hello, World!"; }'
-          ),
-        },
-      })
-    );
-  }
+  async createFunction(functionName: string, handler: string): Promise<void> {}
 
   async findFunction(functionName: string): Promise<void> {
killedBy: AWSTestingFramework Lambda Operations should create a function
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:172:59
     );
   }
 
-  async findFunction(functionName: string): Promise<void> {
-    const command = new ListFunctionsCommand({});
-    const response = await this.lambdaClient.send(command);
-    const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
-    if (!functionDetails) {
-      throw new Error(`Lambda function ${functionName} not found`);
-    }
-  }
+  async findFunction(functionName: string): Promise<void> {}
 
   async invokeFunction(

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:175:61
   async findFunction(functionName: string): Promise<void> {
     const command = new ListFunctionsCommand({});
     const response = await this.lambdaClient.send(command);
-    const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
+    const functionDetails = response.Functions?.find((f) => false);
     if (!functionDetails) {
       throw new Error(`Lambda function ${functionName} not found`);

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:175:61
   async findFunction(functionName: string): Promise<void> {
     const command = new ListFunctionsCommand({});
     const response = await this.lambdaClient.send(command);
-    const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
+    const functionDetails = response.Functions?.find((f) => f.FunctionName !== functionName);
     if (!functionDetails) {
       throw new Error(`Lambda function ${functionName} not found`);

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:176:9
     const command = new ListFunctionsCommand({});
     const response = await this.lambdaClient.send(command);
     const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
-    if (!functionDetails) {
+    if (functionDetails) {
       throw new Error(`Lambda function ${functionName} not found`);
     }

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:176:27
     const command = new ListFunctionsCommand({});
     const response = await this.lambdaClient.send(command);
     const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
-    if (!functionDetails) {
-      throw new Error(`Lambda function ${functionName} not found`);
-    }
+    if (!functionDetails) {}
   }
 

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:184:43
   async invokeFunction(
     functionName: string,
     payload: Record<string, unknown>
-  ): Promise<{ Payload?: string } | null> {
-    const response = await this.lambdaClient.send(
-      new InvokeCommand({
-        FunctionName: functionName,
-        Payload: Uint8ArrayBlobAdapter.from(JSON.stringify(payload)),
-      })
-    );
-    return {
-      Payload: response.Payload ? Buffer.from(response.Payload).toString() : undefined,
-    };
-  }
+  ): Promise<{ Payload?: string } | null> {}
 
   async checkLambdaExecution(functionName: string): Promise<boolean> {
killedBy: AWSTestingFramework Lambda Operations should invoke a function
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"test\":\"response\"}"
Received: undefined

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:196:70
     };
   }
 
-  async checkLambdaExecution(functionName: string): Promise<boolean> {
-    try {
-      const response = await this.lambdaClient.send(
-        new ListFunctionsCommand({
-          MaxItems: 1000,
-        })
-      );
-      const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
-      if (!functionDetails) {
-        throw new Error(`Lambda function ${functionName} not found`);
-      }
-      return true;
-    } catch (_error) {
-      return false;
-    }
-  }
+  async checkLambdaExecution(functionName: string): Promise<boolean> {}
 
   async createStateMachine(stateMachineName: string): Promise<string> {

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:197:9
   }
 
   async checkLambdaExecution(functionName: string): Promise<boolean> {
-    try {
-      const response = await this.lambdaClient.send(
-        new ListFunctionsCommand({
-          MaxItems: 1000,
-        })
-      );
-      const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
-      if (!functionDetails) {
-        throw new Error(`Lambda function ${functionName} not found`);
-      }
-      return true;
-    } catch (_error) {
+    try {} catch (_error) {
       return false;
     }

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:203:63
           MaxItems: 1000,
         })
       );
-      const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
+      const functionDetails = response.Functions?.find((f) => f.FunctionName !== functionName);
       if (!functionDetails) {
         throw new Error(`Lambda function ${functionName} not found`);

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:203:63
           MaxItems: 1000,
         })
       );
-      const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
+      const functionDetails = response.Functions?.find((f) => false);
       if (!functionDetails) {
         throw new Error(`Lambda function ${functionName} not found`);

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:204:11
         })
       );
       const functionDetails = response.Functions?.find((f) => f.FunctionName === functionName);
-      if (!functionDetails) {
+      if (true) {
         throw new Error(`Lambda function ${functionName} not found`);
       }

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:213:71
     }
   }
 
-  async createStateMachine(stateMachineName: string): Promise<string> {
-    // This is a simplified version. In a real implementation, you would need to provide
-    // the state machine definition, role, etc.
-    const response = await this.sfnClient.send(
-      new CreateStateMachineCommand({
-        name: stateMachineName,
-        roleArn: 'arn:aws:iam::123456789012:role/step-functions-role', // Replace with actual role
-        definition: JSON.stringify({
-          StartAt: 'HelloWorld',
-          States: {
-            HelloWorld: {
-              Type: 'Task',
-              Resource: 'arn:aws:lambda:us-east-1:123456789012:function:hello-world',
-              End: true,
-            },
-          },
-        }),
-      })
-    );
-    return response.stateMachineArn || '';
-  }
+  async createStateMachine(stateMachineName: string): Promise<string> {}
 
   async findStateMachine(stateMachineName: string): Promise<string> {
killedBy: AWSTestingFramework Step Functions Operations should create a state machine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "arn:aws:states:us-east-1:123456789012:stateMachine:test-state-machine"
Received: undefined

[Killed] StringLiteral
src/framework/AWSTestingFramework.ts:219:18
     const response = await this.sfnClient.send(
       new CreateStateMachineCommand({
         name: stateMachineName,
-        roleArn: 'arn:aws:iam::123456789012:role/step-functions-role', // Replace with actual role
+        roleArn: "", // Replace with actual role
         definition: JSON.stringify({
           StartAt: 'HelloWorld',
killedBy: AWSTestingFramework Step Functions Operations should create a state machine
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "definition": Any<String>,
    "name": "test-state-machine",

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:222:19
         roleArn: 'arn:aws:iam::123456789012:role/step-functions-role', // Replace with actual role
         definition: JSON.stringify({
           StartAt: 'HelloWorld',
-          States: {
-            HelloWorld: {
-              Type: 'Task',
-              Resource: 'arn:aws:lambda:us-east-1:123456789012:function:hello-world',
-              End: true,
-            },
-          },
+          States: {},
         }),
       })

[Survived] ObjectLiteral
src/framework/AWSTestingFramework.ts:223:25
         definition: JSON.stringify({
           StartAt: 'HelloWorld',
           States: {
-            HelloWorld: {
-              Type: 'Task',
-              Resource: 'arn:aws:lambda:us-east-1:123456789012:function:hello-world',
-              End: true,
-            },
+            HelloWorld: {},
           },
         }),

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:225:25
           States: {
             HelloWorld: {
               Type: 'Task',
-              Resource: 'arn:aws:lambda:us-east-1:123456789012:function:hello-world',
+              Resource: "",
               End: true,
             },

[Survived] BooleanLiteral
src/framework/AWSTestingFramework.ts:226:20
             HelloWorld: {
               Type: 'Task',
               Resource: 'arn:aws:lambda:us-east-1:123456789012:function:hello-world',
-              End: true,
+              End: false,
             },
           },

[Killed] ConditionalExpression
src/framework/AWSTestingFramework.ts:232:12
         }),
       })
     );
-    return response.stateMachineArn || '';
+    return false;
   }
 
killedBy: AWSTestingFramework Step Functions Operations should create a state machine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "arn:aws:states:us-east-1:123456789012:stateMachine:test-state-machine"
Received: false

[Killed] ConditionalExpression
src/framework/AWSTestingFramework.ts:232:12
         }),
       })
     );
-    return response.stateMachineArn || '';
+    return true;
   }
 
killedBy: AWSTestingFramework Step Functions Operations should create a state machine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "arn:aws:states:us-east-1:123456789012:stateMachine:test-state-machine"
Received: true

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:235:69
     return response.stateMachineArn || '';
   }
 
-  async findStateMachine(stateMachineName: string): Promise<string> {
-    const command = new ListStateMachinesCommand({});
-    const response = await this.sfnClient.send(command);
-    const stateMachine = response.stateMachines?.find((sm) => sm.name === stateMachineName);
-    return stateMachine?.stateMachineArn || '';
-  }
+  async findStateMachine(stateMachineName: string): Promise<string> {}
 
   async startExecution(stateMachineArn: string, input: Record<string, unknown>): Promise<string> {

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:238:63
   async findStateMachine(stateMachineName: string): Promise<string> {
     const command = new ListStateMachinesCommand({});
     const response = await this.sfnClient.send(command);
-    const stateMachine = response.stateMachines?.find((sm) => sm.name === stateMachineName);
+    const stateMachine = response.stateMachines?.find((sm) => sm.name !== stateMachineName);
     return stateMachine?.stateMachineArn || '';
   }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:238:63
   async findStateMachine(stateMachineName: string): Promise<string> {
     const command = new ListStateMachinesCommand({});
     const response = await this.sfnClient.send(command);
-    const stateMachine = response.stateMachines?.find((sm) => sm.name === stateMachineName);
+    const stateMachine = response.stateMachines?.find((sm) => true);
     return stateMachine?.stateMachineArn || '';
   }

[Survived] LogicalOperator
src/framework/AWSTestingFramework.ts:239:12
     const command = new ListStateMachinesCommand({});
     const response = await this.sfnClient.send(command);
     const stateMachine = response.stateMachines?.find((sm) => sm.name === stateMachineName);
-    return stateMachine?.stateMachineArn || '';
+    return stateMachine?.stateMachineArn && '';
   }
 

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:239:12
     const command = new ListStateMachinesCommand({});
     const response = await this.sfnClient.send(command);
     const stateMachine = response.stateMachines?.find((sm) => sm.name === stateMachineName);
-    return stateMachine?.stateMachineArn || '';
+    return false;
   }
 

[Killed] BlockStatement
src/framework/AWSTestingFramework.ts:242:98
     return stateMachine?.stateMachineArn || '';
   }
 
-  async startExecution(stateMachineArn: string, input: Record<string, unknown>): Promise<string> {
-    const response = await this.sfnClient.send(
-      new StartExecutionCommand({
-        stateMachineArn,
-        input: JSON.stringify(input),
-      })
-    );
-    if (!response.executionArn) {
-      throw new Error('Failed to start execution: No execution ARN returned');
-    }
-    return response.executionArn;
-  }
+  async startExecution(stateMachineArn: string, input: Record<string, unknown>): Promise<string> {}
 
   async getExecutionStatus(executionArn: string): Promise<string> {
killedBy: AWSTestingFramework Step Functions Operations should start an execution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "arn:aws:states:us-east-1:123456789012:execution:test-state-machine:test-execution"
Received: undefined

[Killed] ConditionalExpression
src/framework/AWSTestingFramework.ts:261:12
         executionArn,
       })
     );
-    return response.status || '';
+    return false;
   }
 
killedBy: AWSTestingFramework Step Functions Operations should get execution status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SUCCEEDED"
Received: false

[Survived] BlockStatement
src/framework/AWSTestingFramework.ts:268:20
     condition: () => Promise<boolean>,
     timeout = 30000,
     interval = 1000
-  ): Promise<void> {
-    const startTime = Date.now();
-    while (Date.now() - startTime < timeout) {
-      if (await condition()) {
-        return;
-      }
-      await new Promise((resolve) => setTimeout(resolve, interval));
-    }
-    throw new Error('Condition not met within timeout');
-  }
+  ): Promise<void> {}
 
   // Cleanup methods

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:270:12
     interval = 1000
   ): Promise<void> {
     const startTime = Date.now();
-    while (Date.now() - startTime < timeout) {
+    while (Date.now() - startTime >= timeout) {
       if (await condition()) {
         return;

[Survived] EqualityOperator
src/framework/AWSTestingFramework.ts:270:12
     interval = 1000
   ): Promise<void> {
     const startTime = Date.now();
-    while (Date.now() - startTime < timeout) {
+    while (Date.now() - startTime <= timeout) {
       if (await condition()) {
         return;

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:271:11
   ): Promise<void> {
     const startTime = Date.now();
     while (Date.now() - startTime < timeout) {
-      if (await condition()) {
+      if (false) {
         return;
       }

[Survived] ConditionalExpression
src/framework/AWSTestingFramework.ts:271:11
   ): Promise<void> {
     const startTime = Date.now();
     while (Date.now() - startTime < timeout) {
-      if (await condition()) {
+      if (true) {
         return;
       }

[Survived] ArrowFunction
src/framework/AWSTestingFramework.ts:274:25
       if (await condition()) {
         return;
       }
-      await new Promise((resolve) => setTimeout(resolve, interval));
+      await new Promise(() => undefined);
     }
     throw new Error('Condition not met within timeout');

[Survived] StringLiteral
src/framework/AWSTestingFramework.ts:276:21
       }
       await new Promise((resolve) => setTimeout(resolve, interval));
     }
-    throw new Error('Condition not met within timeout');
+    throw new Error("");
   }
 
