[Killed] BlockStatement
src/reporting/CustomFormatter.ts:24:96
     this.reporter.onScenarioStarted(scenario);
   }
 
-  onScenarioFinished(scenario: { name: string }, result: { status: string; duration: number }) {
-    this.reporter.onScenarioFinished(scenario, result);
-  }
+  onScenarioFinished(scenario: { name: string }, result: { status: string; duration: number }) {}
 
   onStepFinished(
killedBy: CustomFormatter should handle scenario finished event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"name": "Test Scenario"}, {"duration": 100, "status": "passed"}

Number of calls: 0
