[Killed] BlockStatement
src/reporting/TestReporter.ts:58:54
     });
   }
 
-  onStepFinished(step: TestStep, result: TestResult) {
-    if (!this.currentFeature) {
-      throw new Error('No feature started');
-    }
-    const currentScenario = this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
-      throw new Error('No scenario started');
-    }
-    currentScenario.steps.push({
-      name: step.text,
-      status: result.status,
-      duration: result.duration,
-    });
-    currentScenario.status = result.status;
-  }
+  onStepFinished(step: TestStep, result: TestResult) {}
 
   onScenarioFinished(_scenario: TestScenario, result: TestResult) {
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ArithmeticOperator
src/reporting/TestReporter.ts:62:59
     if (!this.currentFeature) {
       throw new Error('No feature started');
     }
-    const currentScenario = this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
+    const currentScenario = this.currentFeature.scenarios[this.currentFeature.scenarios.length + 1];
     if (!currentScenario) {
       throw new Error('No scenario started');
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No scenario started

[Killed] ConditionalExpression
src/reporting/TestReporter.ts:63:9
       throw new Error('No feature started');
     }
     const currentScenario = this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
+    if (true) {
       throw new Error('No scenario started');
     }
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No scenario started

[Killed] BooleanLiteral
src/reporting/TestReporter.ts:63:9
       throw new Error('No feature started');
     }
     const currentScenario = this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
+    if (currentScenario) {
       throw new Error('No scenario started');
     }
killedBy: TestReporter onStepFinished should add step to current scenario
statusReason: Error: No scenario started

[Survived] BlockStatement
src/reporting/TestReporter.ts:74:67
     currentScenario.status = result.status;
   }
 
-  onScenarioFinished(_scenario: TestScenario, result: TestResult) {
-    if (!this.currentFeature) {
-      throw new Error('No feature started');
-    }
-    const currentScenario = this.currentFeature.scenarios[this.currentFeature.scenarios.length - 1];
-    if (!currentScenario) {
-      throw new Error('No scenario started');
-    }
-    currentScenario.status = result.status;
-  }
+  onScenarioFinished(_scenario: TestScenario, result: TestResult) {}
 
   onTestRunFinished(_options: unknown) {

[Survived] ConditionalExpression
src/reporting/TestReporter.ts:75:9
   }
 
   onScenarioFinished(_scenario: TestScenario, result: TestResult) {
-    if (!this.currentFeature) {
+    if (true) {
       throw new Error('No feature started');
     }

[Killed] ObjectLiteral
src/reporting/TestReporter.ts:90:24
     fs.mkdirSync('test-reports', { recursive: true });
 
     // Write JSON report
-    const jsonReport = {
-      summary: {
-        total: this.results.reduce((acc, feature) => acc + feature.scenarios.length, 0),
-        passed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
-          0
-        ),
-        failed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
-          0
-        ),
-      },
-      features: this.results,
-    };
+    const jsonReport = {};
 
     fs.writeFileSync(
killedBy: TestReporter onTestRunFinished should generate reports
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports/cucumber-report.json", StringContaining "Test Feature"
Received
       1: "test-reports/cucumber-report.json", "{}"
       2: "test-reports/report.html", "
    <!DOCTYPE html>
    <html>

[Survived] ObjectLiteral
src/reporting/TestReporter.ts:91:16
 
     // Write JSON report
     const jsonReport = {
-      summary: {
-        total: this.results.reduce((acc, feature) => acc + feature.scenarios.length, 0),
-        passed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
-          0
-        ),
-        failed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
-          0
-        ),
-      },
+      summary: {},
       features: this.results,
     };

[Survived] ArithmeticOperator
src/reporting/TestReporter.ts:92:54
     // Write JSON report
     const jsonReport = {
       summary: {
-        total: this.results.reduce((acc, feature) => acc + feature.scenarios.length, 0),
+        total: this.results.reduce((acc, feature) => acc - feature.scenarios.length, 0),
         passed: this.results.reduce(
           (acc, feature) =>

[Survived] ArrowFunction
src/reporting/TestReporter.ts:92:36
     // Write JSON report
     const jsonReport = {
       summary: {
-        total: this.results.reduce((acc, feature) => acc + feature.scenarios.length, 0),
+        total: this.results.reduce(() => undefined, 0),
         passed: this.results.reduce(
           (acc, feature) =>

[Survived] ArrowFunction
src/reporting/TestReporter.ts:94:11
       summary: {
         total: this.results.reduce((acc, feature) => acc + feature.scenarios.length, 0),
         passed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
+          () => undefined,
           0
         ),

[Survived] ArithmeticOperator
src/reporting/TestReporter.ts:95:13
         total: this.results.reduce((acc, feature) => acc + feature.scenarios.length, 0),
         passed: this.results.reduce(
           (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
+            acc - feature.scenarios.filter(scenario => scenario.status === 'passed').length,
           0
         ),

[Survived] EqualityOperator
src/reporting/TestReporter.ts:96:52
         passed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
+            feature.scenarios.filter((scenario) => scenario.status !== 'passed').length,
           0
         ),

[Survived] ConditionalExpression
src/reporting/TestReporter.ts:96:52
         passed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
+            feature.scenarios.filter((scenario) => false).length,
           0
         ),

[Survived] ArrowFunction
src/reporting/TestReporter.ts:100:11
           0
         ),
         failed: this.results.reduce(
-          (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
+          () => undefined,
           0
         ),

[Survived] ArithmeticOperator
src/reporting/TestReporter.ts:101:13
         ),
         failed: this.results.reduce(
           (acc, feature) =>
-            acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
+            acc - feature.scenarios.filter(scenario => scenario.status === 'failed').length,
           0
         ),

[Survived] EqualityOperator
src/reporting/TestReporter.ts:102:52
         failed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
+            feature.scenarios.filter((scenario) => scenario.status !== 'failed').length,
           0
         ),

[Survived] MethodExpression
src/reporting/TestReporter.ts:102:13
         failed: this.results.reduce(
           (acc, feature) =>
             acc +
-            feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
+            feature.scenarios.length,
           0
         ),

[Killed] StringLiteral
src/reporting/TestReporter.ts:116:43
 
     // Generate and write HTML report
     const htmlReport = generateHtmlReport(this.results);
-    fs.writeFileSync(join('test-reports', 'report.html'), htmlReport);
+    fs.writeFileSync(join('test-reports', ""), htmlReport);
   }
 }
killedBy: TestReporter onTestRunFinished should generate reports
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports/report.html", StringContaining "Test Feature"
Received
       1: "test-reports/cucumber-report.json", "{
  \"summary\": {
    \"total\": 1,
    \"passed\": 1,
