[Killed] ConditionalExpression
src/reporting/generateReport.ts:18:7
 }
 
 export function generateHtmlReport(results: TestReporterResults[]): string {
-  if (results.length === 0) {
+  if (false) {
     return `
       <!DOCTYPE html>
killedBy: generateReport generateHtmlReport should generate HTML report for empty report
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "No test results found"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] BlockStatement
src/reporting/generateReport.ts:18:29
 }
 
 export function generateHtmlReport(results: TestReporterResults[]): string {
-  if (results.length === 0) {
-    return `
-      <!DOCTYPE html>
-      <html>
-        <head>
-          <title>Test Report</title>
-          <style>
-            body { font-family: Arial, sans-serif; margin: 20px; }
-            .feature { margin-bottom: 20px; }
-            .scenario { margin: 10px 0; padding: 10px; border: 1px solid #ccc; }
-            .step { margin: 5px 0; padding: 5px; }
-            .passed { background-color: #dff0d8; }
-            .failed { background-color: #f2dede; }
-            .pending { background-color: #fcf8e3; }
-          </style>
-        </head>
-        <body>
-          <h1>Test Report</h1>
-          <div class="features">
-            <p>No test results found</p>
-          </div>
-        </body>
-      </html>
-    `;
-  }
+  if (results.length === 0) {}
 
   const totalScenarios = results.reduce((acc, feature) => acc + feature.scenarios.length, 0);
killedBy: generateReport generateHtmlReport should generate HTML report for empty report
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "No test results found"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] StringLiteral
src/reporting/generateReport.ts:19:12
 
 export function generateHtmlReport(results: TestReporterResults[]): string {
   if (results.length === 0) {
-    return `
-      <!DOCTYPE html>
-      <html>
-        <head>
-          <title>Test Report</title>
-          <style>
-            body { font-family: Arial, sans-serif; margin: 20px; }
-            .feature { margin-bottom: 20px; }
-            .scenario { margin: 10px 0; padding: 10px; border: 1px solid #ccc; }
-            .step { margin: 5px 0; padding: 5px; }
-            .passed { background-color: #dff0d8; }
-            .failed { background-color: #f2dede; }
-            .pending { background-color: #fcf8e3; }
-          </style>
-        </head>
-        <body>
-          <h1>Test Report</h1>
-          <div class="features">
-            <p>No test results found</p>
-          </div>
-        </body>
-      </html>
-    `;
+    return ``;
   }
 
killedBy: generateReport generateHtmlReport should generate HTML report for empty report
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "No test results found"
Received string:    ""

[Killed] ArithmeticOperator
src/reporting/generateReport.ts:44:59
     `;
   }
 
-  const totalScenarios = results.reduce((acc, feature) => acc + feature.scenarios.length, 0);
+  const totalScenarios = results.reduce((acc, feature) => acc - feature.scenarios.length, 0);
   const passedScenarios = results.reduce(
     (acc, feature) =>
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Total Scenarios: 3"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:44:41
     `;
   }
 
-  const totalScenarios = results.reduce((acc, feature) => acc + feature.scenarios.length, 0);
+  const totalScenarios = results.reduce(() => undefined, 0);
   const passedScenarios = results.reduce(
     (acc, feature) =>
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Total Scenarios: 3"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:46:5
 
   const totalScenarios = results.reduce((acc, feature) => acc + feature.scenarios.length, 0);
   const passedScenarios = results.reduce(
-    (acc, feature) =>
-      acc + feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
+    () => undefined,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Passed: 2"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:47:38
   const totalScenarios = results.reduce((acc, feature) => acc + feature.scenarios.length, 0);
   const passedScenarios = results.reduce(
     (acc, feature) =>
-      acc + feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
+      acc + feature.scenarios.filter(() => undefined).length,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Passed: 2"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] EqualityOperator
src/reporting/generateReport.ts:47:52
   const totalScenarios = results.reduce((acc, feature) => acc + feature.scenarios.length, 0);
   const passedScenarios = results.reduce(
     (acc, feature) =>
-      acc + feature.scenarios.filter((scenario) => scenario.status === 'passed').length,
+      acc + feature.scenarios.filter((scenario) => scenario.status !== 'passed').length,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Passed: 2"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:51:5
     0
   );
   const failedScenarios = results.reduce(
-    (acc, feature) =>
-      acc + feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
+    () => undefined,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Failed: 1"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ConditionalExpression
src/reporting/generateReport.ts:52:52
   );
   const failedScenarios = results.reduce(
     (acc, feature) =>
-      acc + feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
+      acc + feature.scenarios.filter((scenario) => false).length,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Failed: 1"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:52:38
   );
   const failedScenarios = results.reduce(
     (acc, feature) =>
-      acc + feature.scenarios.filter((scenario) => scenario.status === 'failed').length,
+      acc + feature.scenarios.filter(() => undefined).length,
     0
   );
killedBy: generateReport generateHtmlReport should calculate correct summary statistics
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Failed: 1"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:87:19
               <h2>${feature.feature}</h2>
               ${feature.scenarios
                 .map(
-                  (scenario) => `
-                <div class="scenario ${scenario.status}">
-                  <h3>${scenario.name}</h3>
-                  <div class="steps">
-                    ${scenario.steps
-                      .map(
-                        (step) => `
-                      <div class="step ${step.status}">
-                        <p>${step.name}</p>
-                        <p>Duration: ${step.duration}ms</p>
-                        ${step.status === 'failed' ? '<p>Test error</p>' : ''}
-                      </div>
-                    `
-                      )
-                      .join('')}
-                  </div>
-                </div>
-              `
+                  () => undefined
                 )
                 .join('')}
killedBy: generateReport generateHtmlReport should generate HTML report with test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Scenario"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ArrowFunction
src/reporting/generateReport.ts:93:25
                   <div class="steps">
                     ${scenario.steps
                       .map(
-                        (step) => `
-                      <div class="step ${step.status}">
-                        <p>${step.name}</p>
-                        <p>Duration: ${step.duration}ms</p>
-                        ${step.status === 'failed' ? '<p>Test error</p>' : ''}
-                      </div>
-                    `
+                        () => undefined
                       )
                       .join('')}
killedBy: generateReport generateHtmlReport should generate HTML report with test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Step"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] StringLiteral
src/reporting/generateReport.ts:93:35
                   <div class="steps">
                     ${scenario.steps
                       .map(
-                        (step) => `
-                      <div class="step ${step.status}">
-                        <p>${step.name}</p>
-                        <p>Duration: ${step.duration}ms</p>
-                        ${step.status === 'failed' ? '<p>Test error</p>' : ''}
-                      </div>
-                    `
+                        (step) => ``
                       )
                       .join('')}
killedBy: generateReport generateHtmlReport should generate HTML report with test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Step"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] ConditionalExpression
src/reporting/generateReport.ts:97:27
                       <div class="step ${step.status}">
                         <p>${step.name}</p>
                         <p>Duration: ${step.duration}ms</p>
-                        ${step.status === 'failed' ? '<p>Test error</p>' : ''}
+                        ${false ? '<p>Test error</p>' : ''}
                       </div>
                     `
killedBy: generateReport generateHtmlReport should handle failed test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test error"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Killed] EqualityOperator
src/reporting/generateReport.ts:97:27
                       <div class="step ${step.status}">
                         <p>${step.name}</p>
                         <p>Duration: ${step.duration}ms</p>
-                        ${step.status === 'failed' ? '<p>Test error</p>' : ''}
+                        ${step.status !== 'failed' ? '<p>Test error</p>' : ''}
                       </div>
                     `
killedBy: generateReport generateHtmlReport should handle failed test results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test error"
Received string:    "
    <!DOCTYPE html>
    <html>
      <head>
        <title>Test Report</title>

[Survived] StringLiteral
src/reporting/generateReport.ts:110:19
             </div>
           `
             )
-            .join('')}
+            .join("Stryker was here!")}
         </div>
       </body>

[Killed] BlockStatement
src/reporting/generateReport.ts:117:24
   `;
 }
 
-export function main() {
-  // Create test-reports directory if it doesn't exist
-  if (!existsSync('test-reports')) {
-    mkdirSync('test-reports', { recursive: true });
-  }
-
-  const reportPath = join('test-reports', 'cucumber-report.json');
-  if (!existsSync(reportPath)) {
-    console.error('Error: No test report found. Please run the tests first.');
-    process.exit(1);
-  }
-
-  try {
-    const report = JSON.parse(readFileSync(reportPath, 'utf8'));
-    const htmlReport = generateHtmlReport(report.features);
-    writeFileSync(join('test-reports', 'report.html'), htmlReport);
-    console.info('HTML report generated successfully at test-reports/report.html');
-  } catch (error) {
-    console.error('Error generating report:', error);
-    process.exit(1);
-  }
-}
+export function main() {}
 
 if (require.main === module) {
killedBy: generateReport file operations should create test-reports directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports", {"recursive": true}

Number of calls: 0

[Killed] BooleanLiteral
src/reporting/generateReport.ts:119:7
 
 export function main() {
   // Create test-reports directory if it doesn't exist
-  if (!existsSync('test-reports')) {
+  if (existsSync('test-reports')) {
     mkdirSync('test-reports', { recursive: true });
   }
killedBy: generateReport file operations should create test-reports directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports", {"recursive": true}

Number of calls: 0

[Killed] BlockStatement
src/reporting/generateReport.ts:119:36
 
 export function main() {
   // Create test-reports directory if it doesn't exist
-  if (!existsSync('test-reports')) {
-    mkdirSync('test-reports', { recursive: true });
-  }
+  if (!existsSync('test-reports')) {}
 
   const reportPath = join('test-reports', 'cucumber-report.json');
killedBy: generateReport file operations should create test-reports directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports", {"recursive": true}

Number of calls: 0

[Killed] BooleanLiteral
src/reporting/generateReport.ts:120:44
 export function main() {
   // Create test-reports directory if it doesn't exist
   if (!existsSync('test-reports')) {
-    mkdirSync('test-reports', { recursive: true });
+    mkdirSync('test-reports', { recursive: false });
   }
 
killedBy: generateReport file operations should create test-reports directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "test-reports",
  Object {
-   "recursive": true,

[Survived] StringLiteral
src/reporting/generateReport.ts:123:43
     mkdirSync('test-reports', { recursive: true });
   }
 
-  const reportPath = join('test-reports', 'cucumber-report.json');
+  const reportPath = join('test-reports', "");
   if (!existsSync(reportPath)) {
     console.error('Error: No test report found. Please run the tests first.');

[Killed] ConditionalExpression
src/reporting/generateReport.ts:124:7
   }
 
   const reportPath = join('test-reports', 'cucumber-report.json');
-  if (!existsSync(reportPath)) {
+  if (false) {
     console.error('Error: No test report found. Please run the tests first.');
     process.exit(1);
killedBy: generateReport file operations should handle missing report file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: No test report found. Please run the tests first."
Received: "Error generating report:", [SyntaxError: "undefined" is not valid JSON]

Number of calls: 1

[Killed] BooleanLiteral
src/reporting/generateReport.ts:124:7
   }
 
   const reportPath = join('test-reports', 'cucumber-report.json');
-  if (!existsSync(reportPath)) {
+  if (existsSync(reportPath)) {
     console.error('Error: No test report found. Please run the tests first.');
     process.exit(1);
killedBy: generateReport file operations should handle missing report file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: No test report found. Please run the tests first."
Received: "Error generating report:", [SyntaxError: "undefined" is not valid JSON]

Number of calls: 1

[Killed] StringLiteral
src/reporting/generateReport.ts:125:19
 
   const reportPath = join('test-reports', 'cucumber-report.json');
   if (!existsSync(reportPath)) {
-    console.error('Error: No test report found. Please run the tests first.');
+    console.error("");
     process.exit(1);
   }
killedBy: generateReport file operations should handle missing report file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: No test report found. Please run the tests first."
Received
       1: ""
       2: "Error generating report:", [SyntaxError: "undefined" is not valid JSON]

Number of calls: 2

[Killed] BlockStatement
src/reporting/generateReport.ts:129:7
     process.exit(1);
   }
 
-  try {
-    const report = JSON.parse(readFileSync(reportPath, 'utf8'));
-    const htmlReport = generateHtmlReport(report.features);
-    writeFileSync(join('test-reports', 'report.html'), htmlReport);
-    console.info('HTML report generated successfully at test-reports/report.html');
-  } catch (error) {
+  try {} catch (error) {
     console.error('Error generating report:', error);
     process.exit(1);
killedBy: generateReport file operations should generate and write HTML report successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-reports/report.html", StringContaining "Test Feature"

Number of calls: 0

[Survived] StringLiteral
src/reporting/generateReport.ts:130:56
   }
 
   try {
-    const report = JSON.parse(readFileSync(reportPath, 'utf8'));
+    const report = JSON.parse(readFileSync(reportPath, ""));
     const htmlReport = generateHtmlReport(report.features);
     writeFileSync(join('test-reports', 'report.html'), htmlReport);

[Survived] BlockStatement
src/reporting/generateReport.ts:134:19
     const htmlReport = generateHtmlReport(report.features);
     writeFileSync(join('test-reports', 'report.html'), htmlReport);
     console.info('HTML report generated successfully at test-reports/report.html');
-  } catch (error) {
-    console.error('Error generating report:', error);
-    process.exit(1);
-  }
+  } catch (error) {}
 }
 
