[Survived] BlockStatement
src/steps/base-steps.ts:6:100
 
 const framework = new AWSTestingFramework();
 
-Given('I have an S3 bucket named {string}', async function (this: StepContext, bucketName: string) {
-  this.bucketName = bucketName;
-  await framework.findBucket(bucketName);
-});
+Given('I have an S3 bucket named {string}', async function (this: StepContext, bucketName: string) {});
 
 When(

[Survived] BlockStatement
src/steps/base-steps.ts:13:56
 
 When(
   'I upload a file {string} to the S3 bucket',
-  async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
-      throw new Error('Bucket name is not set. Make sure to create a bucket first.');
-    }
-    await framework.uploadFile(this.bucketName, fileName, 'Test content');
-  }
+  async function (this: StepContext, fileName: string) {}
 );
 

[Survived] BlockStatement
src/steps/base-steps.ts:14:27
 When(
   'I upload a file {string} to the S3 bucket',
   async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
-      throw new Error('Bucket name is not set. Make sure to create a bucket first.');
-    }
+    if (!this.bucketName) {}
     await framework.uploadFile(this.bucketName, fileName, 'Test content');
   }

[Survived] BlockStatement
src/steps/base-steps.ts:23:56
 
 Then(
   'the S3 bucket should contain the file {string}',
-  async function (this: StepContext, fileName: string) {
-    if (!this.bucketName) {
-      throw new Error('Bucket name is not set. Make sure to create a bucket first.');
-    }
-    await framework.waitForCondition(async () => {
-      if (!this.bucketName) return false;
-      const exists = await framework.checkFileExists(this.bucketName, fileName);
-      return exists;
-    });
-  }
+  async function (this: StepContext, fileName: string) {}
 );
 

[Survived] ConditionalExpression
src/steps/base-steps.ts:28:11
       throw new Error('Bucket name is not set. Make sure to create a bucket first.');
     }
     await framework.waitForCondition(async () => {
-      if (!this.bucketName) return false;
+      if (false) return false;
       const exists = await framework.checkFileExists(this.bucketName, fileName);
       return exists;

[Survived] BlockStatement
src/steps/base-steps.ts:35:99
   }
 );
 
-Given('I have an SQS queue named {string}', async function (this: StepContext, queueName: string) {
-  this.queueName = queueName;
-  this.queueUrl = await framework.findQueue(queueName);
-});
+Given('I have an SQS queue named {string}', async function (this: StepContext, queueName: string) {});
 
 When(

[Survived] BlockStatement
src/steps/base-steps.ts:42:55
 
 When(
   'I send a message {string} to the SQS queue',
-  async function (this: StepContext, message: string) {
-    if (!this.queueUrl) {
-      throw new Error('Queue URL is not set. Make sure to create a queue first.');
-    }
-    await framework.sendMessage(this.queueUrl, message);
-  }
+  async function (this: StepContext, message: string) {}
 );
 

[Survived] BooleanLiteral
src/steps/base-steps.ts:43:9
 When(
   'I send a message {string} to the SQS queue',
   async function (this: StepContext, message: string) {
-    if (!this.queueUrl) {
+    if (this.queueUrl) {
       throw new Error('Queue URL is not set. Make sure to create a queue first.');
     }

[Survived] BlockStatement
src/steps/base-steps.ts:43:25
 When(
   'I send a message {string} to the SQS queue',
   async function (this: StepContext, message: string) {
-    if (!this.queueUrl) {
-      throw new Error('Queue URL is not set. Make sure to create a queue first.');
-    }
+    if (!this.queueUrl) {}
     await framework.sendMessage(this.queueUrl, message);
   }

[Survived] StringLiteral
src/steps/base-steps.ts:44:23
   'I send a message {string} to the SQS queue',
   async function (this: StepContext, message: string) {
     if (!this.queueUrl) {
-      throw new Error('Queue URL is not set. Make sure to create a queue first.');
+      throw new Error("");
     }
     await framework.sendMessage(this.queueUrl, message);

[Survived] BlockStatement
src/steps/base-steps.ts:50:88
   }
 );
 
-Then('the SQS queue should receive a notification', async function (this: StepContext) {
-  if (!this.queueUrl) {
-    throw new Error('Queue URL is not set. Make sure to create a queue first.');
-  }
-  await framework.waitForCondition(async () => {
-    if (!this.queueUrl) return false;
-    const unreadCount = await framework.getUnreadMessageCount(this.queueUrl);
-    return unreadCount > 0;
-  }, 30000);
-});
+Then('the SQS queue should receive a notification', async function (this: StepContext) {});
 
 Given(

[Survived] BooleanLiteral
src/steps/base-steps.ts:51:7
 );
 
 Then('the SQS queue should receive a notification', async function (this: StepContext) {
-  if (!this.queueUrl) {
+  if (this.queueUrl) {
     throw new Error('Queue URL is not set. Make sure to create a queue first.');
   }

[Survived] ConditionalExpression
src/steps/base-steps.ts:51:7
 );
 
 Then('the SQS queue should receive a notification', async function (this: StepContext) {
-  if (!this.queueUrl) {
+  if (true) {
     throw new Error('Queue URL is not set. Make sure to create a queue first.');
   }

[Survived] BlockStatement
src/steps/base-steps.ts:71:55
 
 When(
   'I invoke the Lambda function with payload {string}',
-  async function (this: StepContext, payload: string) {
-    if (!this.functionName) {
-      throw new Error('Function name is not set. Make sure to create a Lambda function first.');
-    }
-    await framework.invokeFunction(this.functionName, JSON.parse(payload));
-  }
+  async function (this: StepContext, payload: string) {}
 );
 

[Survived] BooleanLiteral
src/steps/base-steps.ts:72:9
 When(
   'I invoke the Lambda function with payload {string}',
   async function (this: StepContext, payload: string) {
-    if (!this.functionName) {
+    if (this.functionName) {
       throw new Error('Function name is not set. Make sure to create a Lambda function first.');
     }

[Survived] BlockStatement
src/steps/base-steps.ts:81:62
 
 Then(
   'the Lambda function should return {string}',
-  async function (this: StepContext, expectedResult: string) {
-    if (!this.functionName) {
-      throw new Error('Function name is not set. Make sure to create a Lambda function first.');
-    }
-    await framework.waitForCondition(async () => {
-      if (!this.functionName) return false;
-      const result = await framework.invokeFunction(this.functionName, {});
-      return result?.Payload === expectedResult;
-    });
-  }
+  async function (this: StepContext, expectedResult: string) {}
 );
 

[Survived] ConditionalExpression
src/steps/base-steps.ts:82:9
 Then(
   'the Lambda function should return {string}',
   async function (this: StepContext, expectedResult: string) {
-    if (!this.functionName) {
+    if (false) {
       throw new Error('Function name is not set. Make sure to create a Lambda function first.');
     }

[Survived] StringLiteral
src/steps/base-steps.ts:83:23
   'the Lambda function should return {string}',
   async function (this: StepContext, expectedResult: string) {
     if (!this.functionName) {
-      throw new Error('Function name is not set. Make sure to create a Lambda function first.');
+      throw new Error("");
     }
     await framework.waitForCondition(async () => {

[Survived] BlockStatement
src/steps/base-steps.ts:93:84
   }
 );
 
-Then('the Lambda function should be triggered', async function (this: StepContext) {
-  if (!this.functionName) {
-    throw new Error('Function name is not set. Make sure to create a Lambda function first.');
-  }
-  await framework.waitForCondition(async () => {
-    if (!this.functionName) return false;
-    const lambdaTriggered = await framework.checkLambdaExecution(this.functionName);
-    return lambdaTriggered;
-  });
-});
+Then('the Lambda function should be triggered', async function (this: StepContext) {});
 
 Given(

[Survived] ConditionalExpression
src/steps/base-steps.ts:94:7
 );
 
 Then('the Lambda function should be triggered', async function (this: StepContext) {
-  if (!this.functionName) {
+  if (true) {
     throw new Error('Function name is not set. Make sure to create a Lambda function first.');
   }

[Survived] BlockStatement
src/steps/base-steps.ts:94:27
 );
 
 Then('the Lambda function should be triggered', async function (this: StepContext) {
-  if (!this.functionName) {
-    throw new Error('Function name is not set. Make sure to create a Lambda function first.');
-  }
+  if (!this.functionName) {}
   await framework.waitForCondition(async () => {
     if (!this.functionName) return false;

[Survived] BlockStatement
src/steps/base-steps.ts:97:48
   if (!this.functionName) {
     throw new Error('Function name is not set. Make sure to create a Lambda function first.');
   }
-  await framework.waitForCondition(async () => {
-    if (!this.functionName) return false;
-    const lambdaTriggered = await framework.checkLambdaExecution(this.functionName);
-    return lambdaTriggered;
-  });
+  await framework.waitForCondition(async () => {});
 });
 

[Survived] BooleanLiteral
src/steps/base-steps.ts:98:9
     throw new Error('Function name is not set. Make sure to create a Lambda function first.');
   }
   await framework.waitForCondition(async () => {
-    if (!this.functionName) return false;
+    if (this.functionName) return false;
     const lambdaTriggered = await framework.checkLambdaExecution(this.functionName);
     return lambdaTriggered;

[Survived] BlockStatement
src/steps/base-steps.ts:106:64
 
 Given(
   'I have a Step Function named {string}',
-  async function (this: StepContext, stateMachineName: string) {
-    this.stateMachineName = stateMachineName;
-    this.stateMachineArn = await framework.findStateMachine(stateMachineName);
-  }
+  async function (this: StepContext, stateMachineName: string) {}
 );
 

[Survived] BlockStatement
src/steps/base-steps.ts:112:100
   }
 );
 
-When('I start an execution with input {string}', async function (this: StepContext, input: string) {
-  if (!this.stateMachineArn) {
-    throw new Error('State machine ARN is not set. Make sure to create a Step Function first.');
-  }
-  this.executionArn = await framework.startExecution(this.stateMachineArn, JSON.parse(input));
-});
+When('I start an execution with input {string}', async function (this: StepContext, input: string) {});
 
 Then('the execution should complete successfully', async function (this: StepContext) {

[Survived] StringLiteral
src/steps/base-steps.ts:112:6
   }
 );
 
-When('I start an execution with input {string}', async function (this: StepContext, input: string) {
+When("", async function (this: StepContext, input: string) {
   if (!this.stateMachineArn) {
     throw new Error('State machine ARN is not set. Make sure to create a Step Function first.');

[Survived] ConditionalExpression
src/steps/base-steps.ts:113:7
 );
 
 When('I start an execution with input {string}', async function (this: StepContext, input: string) {
-  if (!this.stateMachineArn) {
+  if (false) {
     throw new Error('State machine ARN is not set. Make sure to create a Step Function first.');
   }

[Survived] ConditionalExpression
src/steps/base-steps.ts:113:7
 );
 
 When('I start an execution with input {string}', async function (this: StepContext, input: string) {
-  if (!this.stateMachineArn) {
+  if (true) {
     throw new Error('State machine ARN is not set. Make sure to create a Step Function first.');
   }

[Survived] StringLiteral
src/steps/base-steps.ts:114:21
 
 When('I start an execution with input {string}', async function (this: StepContext, input: string) {
   if (!this.stateMachineArn) {
-    throw new Error('State machine ARN is not set. Make sure to create a Step Function first.');
+    throw new Error("");
   }
   this.executionArn = await framework.startExecution(this.stateMachineArn, JSON.parse(input));

[Survived] BlockStatement
src/steps/base-steps.ts:119:87
   this.executionArn = await framework.startExecution(this.stateMachineArn, JSON.parse(input));
 });
 
-Then('the execution should complete successfully', async function (this: StepContext) {
-  if (!this.executionArn) {
-    throw new Error('Execution ARN is not set. Make sure to start an execution first.');
-  }
-  await framework.waitForCondition(async () => {
-    if (!this.executionArn) return false;
-    const status = await framework.getExecutionStatus(this.executionArn);
-    return status === 'SUCCEEDED';
-  });
-});
+Then('the execution should complete successfully', async function (this: StepContext) {});
 

[Survived] BlockStatement
src/steps/base-steps.ts:120:27
 });
 
 Then('the execution should complete successfully', async function (this: StepContext) {
-  if (!this.executionArn) {
-    throw new Error('Execution ARN is not set. Make sure to start an execution first.');
-  }
+  if (!this.executionArn) {}
   await framework.waitForCondition(async () => {
     if (!this.executionArn) return false;

[Survived] ConditionalExpression
src/steps/base-steps.ts:120:7
 });
 
 Then('the execution should complete successfully', async function (this: StepContext) {
-  if (!this.executionArn) {
+  if (false) {
     throw new Error('Execution ARN is not set. Make sure to start an execution first.');
   }

[Survived] StringLiteral
src/steps/base-steps.ts:121:21
 
 Then('the execution should complete successfully', async function (this: StepContext) {
   if (!this.executionArn) {
-    throw new Error('Execution ARN is not set. Make sure to start an execution first.');
+    throw new Error("");
   }
   await framework.waitForCondition(async () => {

[Survived] BlockStatement
src/steps/base-steps.ts:123:48
   if (!this.executionArn) {
     throw new Error('Execution ARN is not set. Make sure to start an execution first.');
   }
-  await framework.waitForCondition(async () => {
-    if (!this.executionArn) return false;
-    const status = await framework.getExecutionStatus(this.executionArn);
-    return status === 'SUCCEEDED';
-  });
+  await framework.waitForCondition(async () => {});
 });
 

[Survived] ConditionalExpression
src/steps/base-steps.ts:124:9
     throw new Error('Execution ARN is not set. Make sure to start an execution first.');
   }
   await framework.waitForCondition(async () => {
-    if (!this.executionArn) return false;
+    if (true) return false;
     const status = await framework.getExecutionStatus(this.executionArn);
     return status === 'SUCCEEDED';

[Survived] ConditionalExpression
src/steps/base-steps.ts:124:9
     throw new Error('Execution ARN is not set. Make sure to start an execution first.');
   }
   await framework.waitForCondition(async () => {
-    if (!this.executionArn) return false;
+    if (false) return false;
     const status = await framework.getExecutionStatus(this.executionArn);
     return status === 'SUCCEEDED';

[Survived] ConditionalExpression
src/steps/base-steps.ts:126:12
   await framework.waitForCondition(async () => {
     if (!this.executionArn) return false;
     const status = await framework.getExecutionStatus(this.executionArn);
-    return status === 'SUCCEEDED';
+    return true;
   });
 });

[Survived] EqualityOperator
src/steps/base-steps.ts:126:12
   await framework.waitForCondition(async () => {
     if (!this.executionArn) return false;
     const status = await framework.getExecutionStatus(this.executionArn);
-    return status === 'SUCCEEDED';
+    return status !== 'SUCCEEDED';
   });
 });
